{
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.description": "Напредък от BlocksJr до MartyBlocks!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-1": "Добре дошли в MartyBlocks! <br /><br /> Нека обобщим какво знаем от MartyBlocks Jr, за да свикнем с тази нова настройка.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-2": "Можем да намерим „бутона за стартиране“ в „Събития“. <br /><br /> Плъзнете го в областта на скрипта, за да започнете да кодирате",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-3": "В Motion можем да намерим „пригответе се!“ блок. <br /><br /> Не забравяйте, че винаги е добре да добавите този блок, преди Марти да започне да се движи.<br /><br /> Поставете го под блока със зелен флаг.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-4": "Можете ли да пресъздадете тази последователност на MartyBlocks Jr в MartyBlocks? <br /><br /> Вече имаме зеления флаг и пригответе се блок, нека свършим останалото!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-5": "Можете да намерите блока за ходене напред в Движение. <br /><br /> Добавете блока след \"Пригответе се!\" и променете броя на стъпките, които Марти прави в бялото поле. Въведете \"4\", за да съответства на кода на BlocksJr.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-6": "Можете да намерите блока за плъзгане в Движение. <br /><br /> Добавете блока след „Вървете 4 стъпки напред“, задайте падащото поле на „надясно“ и въведете „3“, за да съответства на кода на BlocksJr.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-7": "Използвайте същия блок, за да накарате Марти да се плъзне наляво. <br /><br /> Добавете блока след „Плъзни се 3 пъти надясно“, задайте падащото меню на „наляво“ и въведете „2“, за да съответства на кода на BlocksJr.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-8": "Накрая ще добавим блока за ходене назад. <br /><br /> Добавете блока след „Плъзни се 2 пъти наляво“ и въведете „1“, за да съответства на кода на BlocksJr.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-9": "<b/>Вие го направихте! Успешно преминахте от BlocksJr към MartyBlocks.</b> <br /><br /> Сега сте готови да изследвате MartyBlocks и да правите толкова много страхотни неща с Marty!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.description": "Научете се как да създавате и управлявате спрайтове в MartyBlocks!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-1": "Можем да използваме спрайтове, за да правим толкова много неща в MartyBlocks! От контролиране на Марти до излъчване на съобщения и приемане на информация. <br /><br /><b/>Нека използваме нашата мишка, за да управляваме спрайт и да изследваме различни фонове!</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-2": "Изберете спрайт, с който да работите - можете да изберете спрайт от библиотеката или да получите спрайт изненада!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-3": "Нека да изберем блок със зелен флаг, за да започнем - плъзнете го в областта на скрипта, за да започнете кодирането.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-4": "Нека използваме цикъла „завинаги“, така че спрайтът да продължи да следва, докато не му кажем да спре с червения бутон за спиране.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-5": "В Движение изберете точката към блока с показалец на мишката. <br /><br /> Добавете това като нашия първи блок в цикъла винаги.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-6": "Също така в Движение изберете блока за ходене с 10 стъпки. <br /><br /> Нека добавим това под точката към блока и да променим броя на стъпките на 5.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-7": "Можете също да промените фона, върху който е вашият спрайт. <br /><br />Те могат да ни помогнат да правим още повече неща със спрайтове.  <br /><br /> Изберете десет различни фона (ще разберете, че сте направили това, когато пише фонове: 10)",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-8": "Нека помогнем на нашия спрайт да превключва между тези фонове, за да ги изследва!  <br /><br />Изберете блок за превключване на фона и използвайте падащото меню, за да изберете „произволен фон“.<br /><br />Поставете това между блока „при щракване върху зеления флаг“ и цикъла \"завинаги\", както е показано в примерния код тук:",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-9": "Ти го направи! <br /><br /> <b/>Сега всеки път, когато щракнем върху зеления флаг, можем да изследваме нов фон с нашия спрайт! </b><br/><br /> Можете да използвате бутона с четири стрелки, за да гледате своя спрайт на цял екран!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.description": "Нека проучим Събития и Спрайтове и как те могат да контролират движенията на Марти!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-1": "След като вече знаем как да управляваме спрайт, нека използваме спрайт, фон и някои блокове за събития, за да контролираме Марти в Арктика!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-2": "Първо, нека отворим менюто със спрайтове, за да изберем нашия арктически спрайт. <br /><br /><b/>Потърсете „полярна мечка“</b> и изберете спрайта, за да го поставите на фона.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-3": "Страхотно! Сега нека се уверим, че нашата полярна мечка се чувства като у дома си. <br /><br />Отворете менюто с фонове, след което изберете арктическия фон, за да дадете дом на нашата полярна мечка!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-4": "Кликнете върху полярната мечка в менюто на спрайтовете, за да изведете нейния код.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-5": "След това отидете до Събития. <br /><br />Тези блокове казват <b/>„когато това се случи, направете това“</b>. Те могат да ни помогнат да сме сигурни, че нашият код се изпълнява само когато искаме.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-6": "За да започнем кодирането, имаме нужда от два отделни блока за събития. <br /><br />Изберете блока за събития зелен флаг и блока за събития „когато този спрайт е щракнат“.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-7": "Искаме да напишем код, който казва: <br /> <br /> <i> Когато този спрайт щракне, превключете фона към Арктика.  <br /> Когато щракнете върху зеления флаг, превключете фона обратно към стандартния.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-8": "Нека вземем два блока „смяна на фона“ от Външност и ги добавим под блоковете за събития, както е показано <br /><br />Използвайте падащото меню, за да изберете arctic за единия и backdrop1 (по подразбиране) за другия.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-9": "Сега нека използваме блоковете за събития на Марти, за да го накараме да реагира на този код. <br /><br />Навигирайте до блоковете на вашия Марти, като щракнете върху Марти в менюто на устройствата.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-10": "Искаме да напишем код, който казва: <br /> <i> Когато фонът превключи на арктически, разклати се! </i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-11": "В събитията изберете блок „когато фонът превключи на“. <br /> Използвайте падащото меню, за да изберете Арктика.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-12": "Накрая отидете до Движение, изберете \"Wiggle!\" блок и го поставете, както е показано в примерния код:",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-13": "Ти го направи! Щракнете върху зеления флаг, за да нулирате сцената, след това щракнете върху полярната мечка, за да направите арктическа сцена, и гледайте как Марти се разклати!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.description": "Използвайте спрайт, за да кажете на Марти, че е време за парти!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-1": "Можем да използваме спрайтове, за да общуваме с Марти и помежду си, като излъчваме съобщения.<br /><br />Ще използваме спрайт, за да кажем на Марти, че е време за парти!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-2": "Първо, нека изберем парти фон. <br/>Отворете фоновото меню и потърсете <b/>party</b>, за да зададете сцената.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-3": "Сега нашето парти има нужда от музика! <br/> Кликнете върху „Изберете спрайт“ и потърсете <b/>speaker</b>, за да завършите нашата парти сцена.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-4": "Кликнете върху Speaker в менюто със спрайтове, за да отидете до кода на speaker. Искаме да напишем код, който казва: <br /><br /><i> когато този спрайт щракне, излъчете „време за парти!“</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-5": "Плъзнете този блок в зоната за кодиране, за да започнете нашия спрайт код.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-6": "Плъзнете блока \"разпространи съобщение1\" в позиция, както е показано. <br /><br />",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-7": "Използвайте падащото меню, за да изберете „ново съобщение“, след което създайте ново съобщение, наречено „време за парти!“ за излъчване.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-8": "Това трябва да е вашият завършен спрайт код за тонколона.<br/><br/>А сега нека кажем на Марти какво да прави, когато чуе съобщението <i/>време за парти!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-9": "Отидете до блоковете на вашия Марти, като щракнете върху Марти в менюто на устройствата.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-10": "В събития ще изберем „когато получа“, плъзнете го в областта за скриптове и използвайте падащото меню, за да изберете „време за парти!“ <br /><br />Ще използваме това, за да кажем на Марти какво да прави, когато е време за парти - пуснете музика и танцувайте!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-11": "Изберете началния звуков блок и го поставете, както е показано по-долу.<br/><br/>Използвайте падащото меню, за да изберете „Празнувайте!“ и започнете партито!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-12": "Накрая отидете до Движение, изберете \"Dance!\" блок и го поставете, както е показано в примерния код по-долу.<br/><br/>Сега Марти наистина може да купонясва!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-13": "Успяхте! Щракнете върху speaker, за да пуснете музиката и гледайте партито на Марти!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.description": "Научете се да използвате инструкции if, за да предпазите Марти!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-1": "В този урок ще научим как работят <b/> ​​операторите if</b> и <b/>сензорите за препятствия</b> на Марти!  <br /><br /> Ще ги използваме заедно в цикъл завинаги, за да помогнем на Марти да спре да ходи, ако нещо блокира пътя му.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-2": "Това е блок \"ако\".  <br /><br />Изразите If са наистина важни в програмирането. Те ни помагат да контролираме кога се изпълнява даден код.<br/><br/>Понякога искаме само част от кода да се изпълнява <b /> ако <b /> нещо друго е вярно.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-3": "Кодът в if ще се изпълнява само ако кодът в диаманта е верен - можем да направим толкова много с изразите if!<br /><br /> Плъзнете блок if в областта за скриптове, за да стартираме нашия код.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-4": "Ще използваме сензорите за препятствия на Марти за тази дейност - можете да ги видите тук в червените кръгове.<br /><br />Те могат да разберат дали нещо блокира пътя на Марти, като използват специален вид невидима светлина, наречена инфрачервена (IR).",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-5": "IR сензорите се състоят от две части: <b />предаватели и приемници.</b> <br /><br /><b />Предавателят</b> изпраща невидима светлина, която се отразява обратно, ако има препятствие по пътя. <br /> <b />Приемникът</b> търси инфрачервена светлина, отскачаща обратно от препятствие.   <br /><br />Ако приемникът открие отразена светлина, тогава сензорът знае, че има нещо на пътя.  <br /><br />инфрачервените сензори се използват за отваряне на автоматични врати, паркиране на коли и помагат на роботите Марти да избягват препятствия! <br/><br/><br/><i/>Щракнете върху изображението, за да разгънете диаграмата.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-6": "Отидете до Sensing и изберете блока „избери усетено препятствие за краката“.<br /><br />В този пример можете да изберете левия или десния земен сензор от падащото меню – но трябва да изберете един или блокът няма да работи!!<br /><br />поставете сензорния блок вътре в диаманта на блока if-statement, както е показано по-долу. Този код сега казва, че ако <i />„открито препятствие за крака“ е вярно, тогава изпълни нещо. </i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-7": "Ако Марти усети препятствие, искаме той да спре, за да можем да го предпазим. В нашия if нека поставим блок „спри Марти веднага“.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-8": "Ние не искаме Марти да проверява за препятствия само веднъж, ние искаме той да продължава да проверява отново и отново, така че нека поставим нашето If в цикъл завинаги.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-9": "Страхотно! Сега нека тестваме кода if, като накараме Марти да върви напред завинаги, освен ако не види препятствие.<br /><br />Изберете блока „върви 2 стъпки напред“ и го поставете сам, готов да работи паралелно с кода if.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-10": "Нека поставим нашия блок за разходка в цикъл завинаги, така че Марти да продължи да върви, освен ако не види препятствие.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-11": "Успяхте!<br /><br /> Сега поставете Марти на земята пред препятствие, щракнете върху двата цикъла завинаги, за да стартирате своя код, и вижте дали Марти се пази!<br /><br /> Опитайте да премахнете препятствието и проверете дали Марти знае, че е безопасно да продължи да върви.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.description": "Научете се да използвате инструкции if else, за да предпазите Марти!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-1": "В този урок ще научим как работят <b/> ​​if-else</b>! <br /><br /> Ще използваме наземните сензори на Марти в израз if-else, за да спрем Марти да се отдалечава от ръба.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-2": "Вече знаем как да използваме if инструкции. <br /><br /> Кодът if ще се изпълнява само <b/>ако</b> кодът в диаманта е верен – но какво ще стане, ако искаме да контролираме какво се случва, когато кодът НЕ е верен? <br /><br /> Инструкциите If-else ни помагат да кажем, <b /> ако </b> това е вярно, изпълни някакъв код, <b/>иначе</b> изпълни друг код.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-3": "Изберете if-else. <br /><br /> Плъзнете го в областта за скриптове, за да стартирате нашия код.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-4": "Ще използваме наземните сензори на Марти за тази дейност. Те могат да разберат дали кракът на Марти е на повърхност или не.<br /><br /> Искаме да сме сигурни, че той върви напред само <b/> ​​ако И ДВАТА крака са на земята.<b/> <br /><br /> Изберете <b/>два</b> блока „избор на сензор за крак на земята“. Използвайте падащото меню, за да зададете един на десния крак и един на левия. <br /><br /> Искаме да кажем на Марти да върви напред <b/>АКО</b> и двата крака са на земята.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-5": "За да сме сигурни, че нашият код проверява и двата сензора едновременно, ще използваме блока \"и\" в раздела Оператори.  <br /><br />Поставете двата сензорни блока вътре в \"и\" блока, както е показано в примерния код:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-6": "Сега нека поставим блока \"и\" в нашия блок if-else, така че да съответства на примерния код по-долу.<br /><br />Този код сега казва: <i/>Ако „ляв крак и десен крак на земята“ е вярно, направете нещо. Ако това не е вярно, направете нещо друго.<i/>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-7": "Нека попълним нашата if-else инструкция. Ако и двата крака са на земята, искаме Марти да върви напред. Поставете блокче за ходене напред в горното пространство, както е показано.<br /><br /> Тъй като искаме Марти да провери дали и двата крака са безопасно на земята след <b/>всяка стъпка</b>, променете \"2\" на \"1\" в блока за ходене.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-8": "Ако единият или двата крака са над земята, искаме да спрем Марти безопасно - за да направим това, ще използваме блока \"приготви се\", за да изправим краката му. <br /><br />Поставете блок приготви се след \"else\", както е показано по-долу:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-9": "Почти сме готови! Освен че не искаме кодът ни да се изпълнява само веднъж, искаме той да се изпълнява отново и отново, така че нека го поставим в <b/>цикъл винаги.</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-10": "Успяхте! Сега нека подложим вашия код на тест!    <br /><br /> <b/> ​​Важно:</b> препоръчваме да поставите вашия Marty на ръб <b/>не по-висок от 5 инча</b>, за да предотвратите повреда при падане.   <br/>Препоръчваме да използвате <b/>бяла повърхност</b> (като лист хартия), по която Марти да ходи, тъй като това може да помогне за точността на неговото откриване на земята.    <br /><br /> Поставете вашия Марти на малък перваз и щракнете върху цикъл завинаги, за да тествате защитата на Марти от падане!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.name": "Игра за реакция!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.description": "Нека направим игра за реакция!<br /><br />Ще програмираме Cog да свети на случаен принцип и играчът ще има кратко време, за да натисне бутона и да отбележи точка<br /><br />Ще използваме <i>променлива</i>, за да запазим резултата, и таймер, за да проверим дали са достатъчно бързи",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-1": "Нека направим игра за тест за реакция!<br /><br />Ще програмираме Cog да свети на случаен принцип и играчът ще има кратко време, за да натисне бутона и да отбележи точка<br /><br />Ще използваме <i>променлива</i>, за да запазим резултата, и таймер, за да проверим дали са достатъчно бързи",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-2": "Първо се уверете, че сте свързани към зъбно колело.<br /><br />Ако не, добавете такова, както направихте в последния урок, като натиснете бутона Добавяне в панела с устройства и изберете зъбно колело, след което щракнете върху свързване. Ако трябва, прескочете обратно към последния урок, за да видите как",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-3": "Добавете блок <b>При щракване върху флага</b> от категорията <b>Събития</b><br /><br />Това ще бъде началото на нашата програма и ще се стартира, когато натиснете зеления флаг в горната част на екрана",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-4": "<b>Добавете</b> <i>задай [пръстен] светодиоди към [цвят]</i> <b>блок</b> от категорията <b>Външност</b>,<br /><br />Променете го, за да зададете цвета на <i>бутона</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-5": "Добавете блок за <b>изчакване [1] секунди</b> от категорията <b>Контрол</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-6": "Върнете се в категорията <b>Външност</b> и добавете блок <b>Изключване на всички светодиоди</b><br /><br />Добавете го точно след блока за изчакване, така че Cog да изключи светодиода на бутона след 1 секунда",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-7": "<b>Опитайте!</b> Кликнете върху зеления флаг, за да стартирате програмата! Бутонът на Cog ще светне за 1 секунда, след което ще се изключи",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-8": "<b>Проверете дали можете да натиснете бутона навреме!</b> Отидете в категорията <b>Събития</b> и добавете блок <b>При натиснат бутон</b><br /><br />",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-9": "Добавете блок <b>Ако __ тогава</b> под блока <b>При натиснат бутон</b> от категорията <b>Контрол</b><br /><br />Ще използваме този блок if, за да проверим дали играчът е натиснал бутона навреме",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-10": "Плъзнете блок < в блока if от категорията <b>Оператори</b><br /><br />Символът < означава \"по-малко от\" и ще бъде верен само ако числото отляво е по-малко от числото отдясно",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-11": "Плъзнете блока <b>timer</b> от категорията <b>Сетива</b> в първото поле на < блок<br /><br />След това задайте второто поле на 1, така че редът да казва <i>if timer &lt; 1 след това</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-12": "Таймерът е специална променлива, която измерва времето в секунди.<br /><br />Какъвто и код да поставим в блока if, ще се изпълнява само ако променливата на таймера е по-малка от 1 секунда",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-13": "Добавете блок <b>Нулиране на таймера</b> под блока <b>При щракване върху флага</b><br /><br />Това ще нулира променливата на таймера обратно на 0 точно преди светодиодът на бутона да светне",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-14": "Върнете се в категорията <b>Външност</b> и добавете блок <b>Задаване на [пръстен] светодиоди на [цвят]</b> вътре в блока if<br /><br />Променете цвета на какъвто желаете и се уверете, че сте го добавили в if инструкцията!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-15": "Добавете блок <b>Възпроизвеждане на нота [C4] за [1] секунди</b> от категорията <b>Звук</b><br /><br />Поставете го точно след блока <b>Задаване на светодиод</b> и го променете да възпроизвежда <b>C6</b> за <b>0,25 секунди</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-16": "Добавете блок <b>Изключване на всички светодиоди</b> след блока <b>Възпроизвеждане на нота</b><br /><br />Кодът вътре в оператора if ще се изпълнява само (и така Cog ще свети и бипка само), ако бутонът е натиснат в рамките на 1 секунда след нулирането на таймера",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-17": "<b>Опитайте!</b> Натиснете зеления флаг, за да започнете, след това, ако натиснете бутона в рамките на 1 секунда, светлините ще се включат и ще чуете звуковия сигнал!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-18": "Сега нека накараме светлината да светне повече от веднъж!<br /><br />Отидете в категорията <b>Контрол</b> и добавете блок <b>Повтаряне</b> около кода под блока <b>При щракване върху флага</b><br /><br />Това ще накара Cog да свети няколко пъти!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-19": "Добавете друг блок <b>Изчакайте [1] секунди</b> вътре в цикъла за повторение",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-20": "Отидете в категорията <b>Оператори</b> и променете времето на този блок за изчакване на произволно число между 1 и 5 секунди",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-21": "Сега, когато натиснете зеления флаг, ще имате 10 шанса да натиснете бутона, докато свети!<br /><br />Ще има случайна пауза между всяка от тях и при всяка итерация през цикъла таймерът се нулира, така че не е нужно да променяме кода, който реагира на натиска на бутона. <br /><br />Опитайте! Колко от светлините можете да уловите?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-22": "Да следиш резултата наум е малко скучно. Нека добавим код, за да поддържаме резултата автоматично!<br /><br />Отидете в категорията <b>Променливи</b> и създайте променлива, наречена <b>резултат</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-23": "Добавете блок <b>Задай на [моята променлива] [0]</b> веднага след блока <b>При щракнат флаг</b>, преди цикъла повторение ",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-24": "Променете променливата на <b>резултат</b>, така че да казва <i>Задай на резултат 0</i><br /><br />Сега всеки път, когато започнете играта, резултатът ще се нулира на 0",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-25": "В оператора if добавете промяна [моята променлива] с 1 блок и изберете променливата <b>резултат</b> от менюто, така че да пише „промяна на резултата с 1“",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-26": "Опитайте!<br /><br />Сега всеки път, когато натиснете навреме, резултатът ще се увеличи с 1!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-27": "Сега нека го направим малко по-трудно!<br /><br />Какво ще стане, ако светлините започнат да се движат по-бързо, докато напредвате?<br /><br />Направете друга променлива и я наречете <i>забавяне</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-28": "Задайте „забавяне“ на 1 в началото на програмата, веднага след като нулирате резултата",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-29": "Нека намаляме забавянето всеки път през цикъла на повторение!<br /><br />Добавете блок <b>Промени [забавяне] с [1]</b> вътре в цикъла на повторение.<br /><br />Ние не чакаме забавянето да намалее твърде много, така че го настройте да променя 'delay' с -0,05. Това ще го намалява с 1/20 от секундата всеки път",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-30": "През 10-те итерации на повтарящия се цикъл забавянето ще намалее от 1 секунда до 0,5 (или половин секунда)",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-31": "Сега нека използваме променливата за забавяне<br /><br />Едно хубаво нещо при променливите е, че можем да ги използваме на повече от едно място<br /><br />Плъзнете променливата за забавяне в блока „<“, така че да казва <i>if timer &lt; забавяне след това</i><br /><br />Също така го плъзнете в блока „изчакайте [1] секунда“, така че да пише „изчакайте [закъснение] секунди“",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-32": "Опитайте!<br /><br />Забелязвате ли, че играта се ускорява?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-33": "Нека накараме Сog да покаже резултата на играча в края.<br /><br />Можем да направим това, както направихме със заровете в предишната дейност.<br /><br />Първо, направете променлива, наречена <b>ledID</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-34": "След това добавете блок за <b>Задай променлива</b> след цикъл повторение и задайте <b>ledID</b> на 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-35": "След това отидете в категорията <b>Контрол</b> и добавете друг цикъл <b>повторение</b>.<br /><br />Заменете числото в него с променливата 'резултат', така че да пише 'повтори [резултат]'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-36": "Добавете блок <b>Задай LED [1] на [цвят]</b> в този нов цикъл на повторение<br /><br />Заменете числото с променливата 'ledID', така че да пише 'Задай LED [ledID] на [цвят]'<br /><br />След това задайте цвета на какъвто искате!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-37": "И накрая, добавете блок <b>Промени [променлива] с [1]</b> след този зададен светодиоден блок и го накарайте да промени <b>ledID</b> с 1",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-38": "Опитайте!<br /><br />Сега, когато приключите, Cog ще покаже резултата ви!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-39": "Браво – направихте доста напреднало кодиране!<br /><br />Научихте как да използвате променливи, за да следите нещата по време на игра<br /><br />Използвахме таймер и оператор \"по-малко от\", за да направим сравнение, заедно с оператор if, за да решим дали играчът е натиснал бутона навреме.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-40": "Следващи стъпки!<ul><li>Можете ли да направите играта по-трудна? Какво ще кажете за добавянето на още няколко нива, които ще бъдат още по-бързи?</li><li>Използвайки това, което сте научили в урока за зарове, бихте ли могли да накарате Cog да празнува, ако играчът получи перфектен резултат?</li><li>Ако имате приятели или съученици с други зъбни колела, редувайте се да играете игра на whack-a-mole, като използвате повече от един Cog наведнъж! Всеки трябва да натисне зеления флаг едновременно и след това играчите трябва да се редуват, за да се опитат да отбележат възможно най-много точки във всички Cog. Накрая съберете резултата си, като добавите броя на светлините на всeки Cog</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.name": "Реактивно светлинно шоу!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.description": "Нека направим светлинно шоу, което реагира, докато взаимодействате с Cog!</br></br>Ще научим как да правим анимации на светодиодите на Cog, да реагираме на обекти, които се усещат, количеството сила върху бутона и светлината, която се усеща.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-1": "Нека направим светлинно шоу, което реагира, когато взаимодействате с Cog!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-2": "Първо се уверете, че сте свързани към Cog.<br /><br />Ако не, добавете такъв, както направихте в последния урок, като натиснете бутона Добавяне в панела с устройства и изберете Cog, след което щракнете върху свързване. Ако трябва, прескочете обратно към последния урок, за да видите как",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-3": "Отидете в категорията <b>Събития</b> и добавете блок <b>усетен обект [вляво]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-4": "Отидете в категорията <b>Външност</b> и добавете <b>задай светодиоди с помощта на блока за избор на цвят</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-5": "Задайте цветовете каквито желаете.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-6": "Опитайте! Поставете предмет върху левия сензор за препятствия.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-7": "Добавете друг блок <b>на обекта, разпознат</b> от категорията <b>Събития</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-8": "Променете сензора на десен, като използвате падащото меню.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-9": "Върнете се в категорията <b>Външност</b> и добавете още един <b>задай светодиоди с помощта на блока за избор на цвят</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-10": "Опитайте! Поставете предмет върху десния сензор за препятствия.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-11": "Можете да правите анимации на Cog, като използвате множество блокове за избор на цвят, свързани заедно.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-12": "Тази анимация беше съставена от 9 <b>кадъра</b>, всеки един в отделен блок Colorpicker, с блок за изключване на светодиодите в края.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-13": "Ето отделните кадри за тази анимация.<br /><br />Можете ли да планирате своя собствена анимация и тя да се възпроизвежда, когато Cog усети обект?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-14": "Можете ли да направите анимация, която се променя плавно, докато Ког се мести от това да е върху един сензор за обект към това да е върху друг?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-15": "Досега всеки път, когато сме използвали бутона на Cog, той открива дали е натиснат или не.<br /><br />Ние наричаме този тип информация <b>логическа</b> - нещо, което е вярно или невярно.<br /><br />Освен че мислим за бутона като логически вход, можем да го използваме и като <b>аналогов</b> вход - такъв, който може да има много различни стойности.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-16": "Отидете в категорията <b>Сетива</b> и поставете отметка в квадратчето до блока <b>Сила на натискане на бутона %</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-17": "Ще видите да се появява монитор, показващ стойността на сензора за сила на бутона.<br /><br />Ако натиснете бутона, стойността ще се промени.<br /><br />Нека използваме тази стойност, за да накарате светлините на Cog да променят цвета си, докато натискате бутона по-силно.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-18": "Отидете в категорията <b>Събития</b> и добавете блок <b>При щракване върху флага</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-19": "Сега отидете в категорията <b>Контрол</b> и добавете цикъл <b>винаги</b>.<br /><br />За разлика от цикъла <b>повтори</b>, който се повтаря само определен брой пъти, цикълът <b>винаги</b> ще продължи да се повтаря, докато не натиснете червения бутон за спиране.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-20": "Отидете в категорията <b>Външност</b> и добавете блок <b>настройте [пръстени] светодиоди към [цвят]</b> в цикъла завинаги.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-21": "Сега плъзнете блока, който казва <b>нюанс [360] наситеност [100] лекота [100]</b> в мястото за цвета в блока <b>set [ring] LEDs to [color]</b>.<br /><br />Има няколко различни начина за описание на цветовете и Hue, Saturation и Lightness (или стойност) е един от тях.<br /><br />С тези три числа можем опишете всеки цвят.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-22": "<b>Оттенък</b> е число между 0 и 360 (като градусите в кръг), което казва кой основен цвят искаме.<br /><br />Може да се покаже в кръг - и вече сте го видели, когато използвате инструмента за избор на цвят!<br /><br />0 градуса е най-отгоре и представлява червено. 90 градуса е зелено-жълто, 180 градуса е циан синьо, 270 градуса е лилаво, а 360 градуса е обратно към червено!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-23": "<b>Наситеността</b> показва колко ярък искате да бъде цветът.<br /><br />В този пример за оттенък 360 наситеност 100 ще бъде най-червеното червено.<br /><br />Наситеност 0 ще бъде бяло - най-малкото червено.<br /><br />А наситеност 50 ще бъде в средата - розово.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-24": "И накрая, <b>лекота</b> (или яркост, или стойност) казва колко светъл искате да бъде цветът.<br /><br />В този пример, с нюанс 360 и наситеност 100, яркост 100 отново дава най-червеното червено.<br /><br />Яркост 0 изобщо не дава червено - в този случай светодиодът на Cog просто ще бъде изключен!<br /><br />A яркост от 50 ще бъде в средата - тъмно червено.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-25": "Нека използваме <b>силата на бутона</b>, за да зададем едно от тези!<br /><br />Върнете се в категорията <b>Сетива</b> и плъзнете блока <b>стойност на силата на бутона</b> в пространството за осветеност в блока <b>нюанс, наситеност, лекота</b>.<br /><br />Също така добавете <b>изчакайте 0,1 секунди</b> в края на цикъл завинаги, така че че светлините не се сменят твърде бързо.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-26": "Нека включим и светлината в бутона на Cog за забавление!<br /><br />Добавете блок <b>Set [ring] LEDs to [color]</b> преди цикъла винаги и го променете, за да зададете <b>бутона</b>. Изберете всеки цвят, който харесвате.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-27": "Опитайте! Докато натискате бутона, светодиодите ще светват все по-ярко и по-ярко в червено!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-28": "Опитайте със силата на бутона, настройвайки наситеността вместо лекотата.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-29": "Сега светлините ще се променят от бяло на червено, докато натискате бутона!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-30": "Накрая вместо това опитайте да зададете нюанса.<br /><br />Стойността за нюанс трябва да премине от 0 до 360, така че ще трябва да направим някои математически изчисления.<br /><br />Отидете до категорията <b>Оператори</b> и плъзнете <b>множествен</b> блок в стойността на нюанса.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-31": "Настройте го да умножава стойността на силата на бутона по 3,6.<br /><br />Това ще означава, че вместо да даваме числа от 0 до 100, ще получим числа от 0 до 360 (3,6 x 100).<br /><br />Опитайте!<br /><br />Сега, когато натиснете бутона, цветът на светлините ще се промени от червено към зелено към синьо и обратно към червено!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-32": "Вижте дали можете да промените и цвета на бутона!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-33": "След това нека видим дали можем да накараме Cog да реагира на ярки светлини, като свети за малко.<br /><br />Изтрийте кода, който сте направили за промяна на цветовете въз основа на силата на бутона, като го плъзнете в палитрата с блокове.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-34": "Отидете в категорията <b>Сетива</b> и поставете отметка в квадратчето до блока <b>Стойност на околната светлина</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-35": "Отбележете каква е нормалната стойност на околната светлина.<br /><br />След това вземете фенерче и осветете с него Cog, отбележете какви стойности получавате.<br /><br />Вероятно ще можете да достигнете максималната стойност, която сензорът може да даде - 4095!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-36": "Отидете в категорията <b>Контрол</b> и добавете блок <b>изчакайте, докато</b> под блока <b>При щракване върху флага</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-37": "След това отидете на <b>Оператори</b> и добавете блок <b>по-голямо от</b> в блока <b>изчакайте до</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-38": "Върнете се в категорията <b>Сетива</b> и плъзнете блока <b>Стойност на околната светлина</b> в лявата страна на блока <b>&gt;</b>.<br /><br />Променете дясната страна на число, което ще бъде достигнато само когато осветите фенерче върху Cog.<br /><br />Не е необходимо да поставяте максимално число, само по-високо от това, което виждате без фенерче.<br /><br />Тук избрах 1500, така че целият ред гласи <b>изчакайте, докато стойността на околната светлина &gt; 1500</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-39": "Добавете блок <b>задай [пръстен] светодиоди на [цвят]</b> под блока <b>изчакай, докато</b>.<br /><br />Също така добавете блок <b>Изключи всички LEDs</b> в горната част, за да сте сигурни, че нещата са нулирани.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-40": "Изпробвайте!<br /><br />Щракнете върху зеления флаг, за да започнете кода.<br /><br />След това, когато осветите фенерче върху Cog, светлините ще се включат!<br /><br />Блокът <b>изчакай</b> ще спре изпълнението на кода, докато условието, което сте поставили в него, бъде изпълнено.<br /><br />В този случай това е проверка дали стойността на светлинния сензор е достатъчно ярка.<br /><br />След като условието е вярно, блокът <b>изчакай, докато</b> е удовлетворен и изпълнението преминава към блока <b>настройте [пръстен] светодиоди на [цвят]</b>, за да включите светодиодите.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-41": "Нека накараме светлините на Cog да се включват постепенно, когато открие факла.<br /><br />За да направим това, ще използваме отново променлива!<br /><br />Отидете в категорията <b>Променливи</b> и създайте променлива, наречена <b>яркост</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-42": "Добавете блок за <b>задаване на яркост на 0</b> в началото на кода.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-43": "Сега добавете блок <b>повтаряне до</b> под блока <b>изчакайте до</b> и го накарайте да заобикаля блока <b>Задаване на [пръстен] светодиоди на [цвят]</b>.<br /><br />Можете да намерите блока <b>повтаряне до</b> в категорията <b>Контрол</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-44": "Като използвате променливата <b>яркост</b>, която току-що създадохте, променете я така, че редът да гласи <b>повтаряй, докато яркостта &gt; 100</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-45": "Сега добавете блок <b>промяна на яркостта с 10</b> в блока <b>повтаряй до</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-46": "Променете блока <b>задай [пръстен] светодиоди на [цвят]</b>, за да използвате блок <b>нюанс, наситеност, лекота</b>.<br /><br />Използвайте променливата <b>яркост</b> за лекота.<br /><br />Също така променете цвета на хубаво синьо, като зададете нюанса на 180.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-47": "След това добавете блок <b>изчакайте</b> от категорията <b>Контрол</b> и го променете на <b>изчакайте 0,1 секунди</b>.<br /><br />Това ще забави затихването за малко.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-48": "Блокът <b>повтаряй докато</b> е малко като комбинация от блока <b>повтори</b>, който сте използвали преди, който се повтаря определен брой пъти, и блока <b>изчакване</b>, който току-що сте използвали.<br /><br />В този случай той ще продължи да се повтаря, докато условието бъде изпълнено, след което ще спре да се повтаря и изпълнението на кода ще продължи.<br /><br />В този пример ще продължи да повтаря цикъл и постепенно увеличаване на яркостта, докато яркостта достигне максималната стойност от 100.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-49": "Изпробвайте го!<br /><br />Щракнете върху зеления флаг, за да изпълните кода.<br /><br />Сега, когато осветите факла върху Cog, светлините постепенно ще се включват!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-50": "Нека да накараме светлините да изчезнат отново, когато вземете фенерчето!<br /><br />Добавете още един блок <b>изчакайте</b>, но този път го настройте да изчака, докато стойността на околната светлина стане по-ниска от праг.<br /><br />Направете това, като използвате блок <b>&lt;</b> (по-малко от) от категорията <b>Оператори</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-51": "Сега добавете още едно <b>повтаряне до</b> блок и го накарайте да се повтаря, докато яркостта стане по-малка от (<) 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-52": "Дублирайте кода от предишния цикъл <b>повтаряй докато</b>.<br /><br />Можете да направите това, като щракнете с десния бутон (или натиснете и задържите) и след това изберете <b>Дублиране</b>.<br /><br />Поставете новия код в новия цикъл <b>повтаряй докато</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-53": "Този код почти ще работи, но можете ли да забележите грешката?<br /><br />Яркостта ще продължи да се увеличава, вместо да намалява!<br /><br />Променете го така, че вместо това да пише <b>променете яркостта с -5</b>.<br /><br /><b>-5</b> тук ще изважда 5 от променливата за яркост всеки път.<br /><br />Това ще изгаси светлините постепенно с половината от скоростта, с която ги включихме..",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-54": "Опитайте! Сега, когато махнете фенерчето, светлините на Cog отново ще избледнеят!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-55": "Нека направим така, че да не се налага да щраквате върху зеления флаг всеки път, когато искате Cog да реагира.<br /><br />Добавете цикъл <b>завинаги</b>, така че да започва след блока <b>Изключване на всички светодиоди</b> и да заобикаля целия останал код.<br /><br />Сега Cog ще продължи да реагира на ярки светлини, докато не натиснете червения знак стоп!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-56": "Браво - научихте много!<br /><br />Научихте как да правите анимации от много отделни кадри.<br /><br />Научихте как да накарате Cog да реагира на сензорите на обекта.<br /><br />Научихме за аналоговите стойности, които могат да варират, и използвахме светлините на Cog, за да покажем колко силно натиснат бутона.<br /><br />Научихме как да описваме цветове с помощта на оттенък, наситеност и яркост (или стойност).<br /><br />Научихме също как да използваме светлинния сензор на Cog и направихме наистина бърз експеримент, за да вземем някои показания от сензора, за да ни помогне да напишем нашия код.<br /><br />Използвайки блокове <b>изчакай докато</b>, <b>повтаряй докато</b>, променливи и оператори за сравнение, накарахме Cog да свети, за да реагира на ярка светлина!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-57": "Следващи стъпки - ако сте в клас с други хора с Cogs или ако имате повече от един, опитайте да съберете много от тях, докато изпълняват току-що направения от вас код.<br /><br />Можете ли да използвате фенерче, за да пишете неща върху тях и да рисувате със светлина?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.name": "Нивелир",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.description": "Нека направим още едно полезно нещо с Cog! <br /><br />Този път ще използваме сензора за наклон на Cog, за да направим нивелир - нещо, което показва дали нещо е хоризонтално или дали се накланя. <br /><br />Много нивелири работят само в едно измерение, но ние ще накараме нашите да работят в две!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-1": "<b>Нека направим нивелир</b>, който показва дали нещо е хоризонтално или се накланя!<br /><br />Ще използваме сензора за наклон на Cog, за да го накараме да работи в две измерения.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-2": "Първо се уверете, че сте свързани към Cog.<br /><br />Ако не, добавете такъв, както направихте в последния урок, като натиснете бутона Добавяне в панела с устройства и изберете Cog, след което щракнете върху свързване. Ако трябва, прескочете обратно към последния урок, за да видите как",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-3": "Отидете в категорията <b>Събития</b> и добавете блок за събития <b>при наклон [наляво]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-4": "Сега отидете в категорията <b>Външност</b> и добавете <b>набор на светодиоди с помощта на блока за избор на цветове</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-5": "Щракнете върху иконата <b>изключени светлини</b>, за да изключите всички светлини.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-6": "След това настройте само един светодиод отляво да свети.<br /><br />Опитайте! Наклонете Cog наляво.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-7": "Добавете друг блок <b>при накланяне [наляво]</b> от контролната категория и го променете така, че да пише <b>при накланяне [надясно]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-8": "Свържете този блок <b>при накланяне [надясно]</b> към друг <b>настроен светодиод с помощта на блока за избор на цветове</b> и го настройте да включва само светодиода вдясно.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-9": "Опитайте!<br /><br />Наклонете Cog наляво и надясно.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-10": "Добавете друг набор от блокове <b>при накланяне</b> и <b>избор на цветове</b>.<br /><br />Настройте го да реагира при <b>накланяне [назад]</b> и да накара само светодиода в позиция 6 часа да се включи.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-11": "Накрая добавете четвърти набор от блокове и ги настройте на <b>при накланяне [напред]</b> и за включване на светодиода в предната част на Сog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-12": "Опитайте!<br /><br />Наклонете Cog във всичките четири посоки и вижте как светлината се движи!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-13": "Нека да покажем и тази информация на екрана!<br /><br />Отидете в категорията <b>Сетива</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-14": "Поставете отметка в квадратчето до <b>Акселерометър X</b>.<br /><br />След това променете X на Y от падащото меню и поставете отметка в квадратчето до него.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-15": "Наклонете Cog и вижте как се променят числата!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-16": "Нека да разгледаме това малко по-подробно, щракнете върху бутона <b>Sensor Dashboard</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-17": "След това щракнете върху бутона, за да <b>добавите нова графика</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-18": "И изберете своя Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-19": "Ще се появи графика!<br /><br />Трябва да изберем сензорите, които искаме да покажем. Щракнете, за да разгънете категорията <b>Акселерометър</b> и след това поставете отметки в квадратчетата до <b>X</b> и <b>Y</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-20": "Натиснете бутона <b>възпроизвеждане</b>, за да започнете да показвате данните от сензора.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-21": "Наклонете Cog и вижте как се променят стойностите за оста X и оста Y.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-22": "Щракнете върху бутона <b>x</b>, за да затворите таблото за управление на сензора.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-23": "Нека се занимаваме с наука! Ще ви трябва малко хартия, за да си водите бележки.<br /><br />Наклонете Cog надясно и отбележете каква стойност имат осите на акселерометъра и всички сензори на акселерометъра.<br /><br />След това направете същото за накланяне напред, назад и наляво.<br /><br />Ще използваме тези данни след малко!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-24": "Сега отидете в категорията <b>Променливи</b> и създайте две променливи, наречени <b>ax</b> (за акселерометър x) и <b>ay</b> (за акселерометър y).",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-25": "Добавете тези блокове към вашия проект:<br /><br /><ul><li>При щракване върху флага:</li><ul><li>Завинаги:</li><ul><li>Задайте ax на Акселерометър X</li><li>Задайте ay на Акселерометър Y</li></ul></ul></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-26": "Сега отидете в категорията <b>Събития</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-27": "Добавете блок <b>разпространи [съобщение1]</b> вътре в цикъл винаги.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-28": "Нека дадем на съобщението по-добро име, изберете <b>Ново съобщение</b> от падащото меню.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-29": "След това дайте на новото съобщение името <b>актуализиране на позиция</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-30": "Сега щракнете върху раздела <b>Спрайтове</b> в горната част.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-31": "Щракнете върху бутона <b>Добавяне на спрайт</b> и изберете спрайта <b>Топка</b> (или всеки друг спрайт, който желаете).",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-32": "Вашият код ще изчезне! Не се притеснявайте - все още е там, просто е свързано с Cog, а не с този спрайт.<br /><br />Отидете в категорията <b>Събития</b> и добавете блок <b>когато получа [актуализиране на позиция]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-33": "Променете го така, че да пише <b>когато получа [актуализиране на позицията]</b> - това е съобщението, което направихме току-що.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-34": "Сега отидете в категорията <b>Движение</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-35": "Добавете блок <b>отидете на x: [] y: []</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-36": "Средата на екрана има координатите [0,0].<br /><br />Координатите вдясно от средата имат стойности x над 0.<br />Координатите вляво от средата имат стойности x под 0.<br />Координатите над средата имат стойности y над 0.<br />Координатите под средата имат стойности y под 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-37": "Искаме да движим топката наоколо, за да покажем колко е наклонен Cog.<br /><br />Погледнете назад към бележките, които сте направили, за показанията на акселерометъра, които сте получили, когато сте наклонили зъбното колело във всяка от четирите посоки.<br /><br />Искаме топката да се движи наляво и надясно, когато наклоним зъбното колело наляво и надясно. За спрайта ляво и дясно се задават от неговата координата x.<br /><br />Трябва да видите, че когато наклоните Cog надясно, стойността на ay е над 0, докато стойността на ax е почти 0. Когато наклоните наляво, стойността на ay е под 0.<br /><br />Това означава, че трябва да използваме стойността ay, за да зададем координатата x на спрайта.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-38": "Също така ще трябва да направим числото по-голямо, като го умножим.<br /><br />Отидете до категорията <b>Оператори</b> и плъзнете блок за <b>умножение</b> в полето с координати x.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-39": "Отидете в категорията <b>Променливи</b> и добавете променливата <b>ay</b> към блока за умножение.<br /><br />Въведете <b>100</b> от другата страна на блока за умножение.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-40": "Погледнете отново вашите бележки за показанията на акселерометъра.<br /><br />Кое число се промени, когато наклонихте зъбното колело назад и напред?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-41": "Трябва да видите, че <b>ax</b> се промени - така че ще използваме това, за да зададем координатата y.<br /><br />Добавете друг блок за умножение и поставете променливата <b>ax</b> вътре в него.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-42": "Но има проблем! Искаме спрайтът да се движи нагоре, когато наклоните Cog напред, което би означавало, че се нуждае от координата y над 0.<br /><br />Но когато наклонихте зъбното колело напред, стойността на ay беше под 0!<br /><br />За да поправим това, ще трябва да го умножим по <b>-100</b> вместо <b>100</b>. Допълнителният знак минус ще го обърне от под 0 на над 0 и обратно.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-43": "Върнете се към вашия код на Cog, като щракнете върху символа на зъбно колело в панела с устройства.<br /><br />Зъбното колело ще светне и ще издаде звуков сигнал, когато го изберете!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-44": "Сега натиснете <b>зеления флаг</b>, за да изпълните кода си.<br /><br />Трябва да видите топката да се движи, докато накланяте зъбното колело!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-45": "Нека добавим фон зад топката, за да покажем по-добре какво показваме.<br /><br />Изберете <b>Сцената</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-46": "След това изберете раздела <b>Фонове</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-47": "Начертайте няколко кръга около средната точка.<br /><br />Можете да ги направите цветни, ако желаете!<br /><br />Съвет – ако сте на компютър, можете да задържите shift, за да сте сигурни, че получавате кръг вместо елипса.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-48": "Можете да изберете раздела <b>Код</b> в горната част, за да се върнете към екрана за кодиране, и да изберете отново Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-49": "Изпробвайте!<br /><br />Сега, докато накланяте Cog, ще можете да видите ориентир за това колко близо сте до хоризонтално положение!<br /><br />Когато Cog е неподвижен, върху него винаги действа 1G гравитация. Ако наклоните cog много, ще видите, че можете да получите ax или ay да бъдат равни на 1 - това ще се случи, когато индикаторът стигне най-далечната възможна точка от средата.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-50": "Ако наклоните под ъгъл от 45 градуса, индикаторът ще бъде на същото разстояние от средата, но ax и ay сега ще бъдат около 0,7 - сещате ли се защо е така?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-51": "Ако си представим степента на наклон като правоъгълен триъгълник, теоремата на Питагор ни казва, че ако двете страни на триъгълника са около 0,7, хипотенузата ще бъде 1!<br /><br />Това се случва тук, където 1G гравитация при 45 градуса се състои от 0,7G в посока X и 0,7G в посока Y.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-52": "Браво!<br /><br />Научихте как да използвате разпознаването на наклона на Cog, за да направите нивелир - устройство, което показва дали нещо е хоризонтално или наклонено.<br /><br />Научихме за спрайтовете в интерфейса на Blocks и използвахме променливи и съобщение за комуникация между зъбното колело и спрайта.<br /><br />Помислихме как да представим данните - степента на наклон в x и y - по начин, който би бил лесен за разбиране - използване на светлините на зъбното колело и движението на спрайта спрямо фоновата скала.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-53": "Нека накараме Cog също да показва кога е в хоризонтално положение!<br /><br />Върнете се в категорията <b>Сетива</b> и поставете отметка в квадратчето до <b>Посока на накланяне</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-54": "Вижте какво се случва с <b>посоката на наклона</b>, докато движите Cog.<br /><br />Когато е почти в хоризонтално положение, посоката на наклона ще бъде <b>никаква</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-55": "Добавете този код.<br /><br />Той използва няколко нови блока.<br /><br />Блокът <b>if … else</b> работи наистина подобно на блока <b>if</b>, който използвахме преди. Ако условието е вярно, тогава кодът в частта if ще бъде изпълнен, но ако условието е невярно, тогава вместо това ще бъде изпълнен кодът в частта else.<br /><br />С помощта на блока <b>if … else</b> можем да напишем алтернативен код, който се изпълнява само ако условието не е вярно.<br /><br />Другият нов блок е блок <b>=</b>. Това е друг вид сравнителен блок - той сравнява две неща. Тук сравняваме сензора за <b>посока на накланяне</b> и думата <b>няма</b>.<br /><br />Ако посоката на накланяне е точно същата като думата <b>няма</b>, тогава условието ще е вярно и светодиодът на бутона ще бъде настроен на зелено, а светодиодите на пръстена ще бъдат изключени!<br /><br />Ако посоката на наклона е равна на нещо различно от <b>няма</b>, тогава бутонът Светодиодът ще бъде изключен вместо това.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-56": "Опитайте!<br /><br />Сега ще получите сигнал и на Cog, когато е на хоризонтално ниво 🙂",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.name": "Нека направим игра на ски!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.description": "Нека направим игра, в която използваме Cog и Sprites на екрана!<br /><br />Ще направим игра със ски, в която играчът трябва да избягва да се удря в дървета и камъни.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-1": "Нека направим игра, в която използваме Cog и Sprites на екрана!<br /><br />Ще направим игра със ски, в която играчът трябва да избягва да се удря в дървета и камъни.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-1.2": "Първо се уверете, че сте свързани към Cog.<br /><br />Ако не, добавете такъв, както направихте в последния урок, като натиснете бутона Добавяне в панела с устройства и изберете зъбно колело, след което щракнете върху свързване. Ако трябва, прескочете обратно към последния урок, за да видите как",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-2": "Отидете в категорията Събития и добавете блок <b>Върху обект, разпознат [вляво]</b>.<br /><br />Ще използваме това като бутон за стартиране.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-3": "Добавете цикъл <b>винаги</b> от категорията Контрол.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-4": "Отидете в категорията променливи и създайте променлива, наречена <b>ay</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-5": "Добавете блокове, за да <i>зададете [ay] на [акселерометър [Y]]</i> в цикъл винаги.<br /><br />Ще трябва да използвате блок <b>set</b> от категорията Променливи, блок <b>Акселерометър</b> от категорията Сензори и да промените оста на <b>Y</b> с помощта на падащото меню.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-6": "Добавете блок за <b>разпространи [съобщение 1]</b> и го настройте да разпространи <b>Ново съобщение</b>, наречено <i>актуализиране на позицията</i>.<br /><br />Ще използваме това като сигнал за преместване на нашия спрайт.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-7": "Добавете друг блок <b>разпространи [съобщение1]</b> преди цикъл винаги и го настройте да излъчва <b>Ново съобщение</b>, наречено <i>старт</i>.<br /><br />Ще използваме това, за да сме сигурни, че всичко се нулира в началото на играта.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-8": "Щракнете върху бутона, за да изберете спрайт за добавяне.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-9": "Добавете спрайта <b>Пингвин 2</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-10": "С избрания спрайт на пингвин добавете блок <b>когато получа [старт]</b> от категорията Събития.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-11": "Отидете в категорията Външност и добавете <b>задайте размер на [100]%</b> блок.<br /><br />Променете размера на 20%.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-12": "Върнете се в категорията Събития и добавете блок <b>когато получа [актуализация на позицията]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-13": "Отидете в категорията Движение и добавете блок <b>go to x: [] y: []</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-14": "Променете го, за да кажете <b>отидете на x: [[ay] x 200] y:0</b>.<br /><br />Ще трябва да използвате блок <b>умножение (*)</b> от категорията Оператори и променливата <b>ay</b> от категорията Променливи.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-15": "Опитайте!<br /><br />Покрийте левия сензор за обект, за да започнете играта, след това наклонете Cog наляво и надясно, за да преместите пингвина наляво и надясно.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-16": "Нека добавим някои препятствия!<br /><br />Добавете спрайта <b>Дърво 1</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-17": "С избрания спрайт Дърво добавете блок <b>когато получа [старт]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-18": "От категорията Външност добавете <b>задаване на размер на [30]%</b> блок и <b>скриване</b> блок.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-19": "Добавете цикъл <b>винаги</b> от категорията Контрол.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-20": "Вътре в цикъла винаги добавете блок <b>създай клонинг на [себе]</b>.<br /><br />Клонингът е идентично копие на нещо.<br /><br />В този случай блокът за създаване на клонинг ще направи копие на спрайт дърво и целия код, който е свързан с него.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-21": "След този блок добавете блок <b>wait [1] seconds</b>.<br /><br />Това ще означава, че на всяка 1 секунда ще се създава ново дърво.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-22": "Сега добавете блок <b>когато стартирам като клонинг</b>.<br /><br />Всеки код, прикачен към това, ще бъде изпълнен, когато клонингът бъде създаден.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-23": "Добавете блок <b>go to x: [избери произволно [-240] to [240] y: [-200]</b>.<br /><br />Можете да намерите блока <b>pick random</b> в категорията Оператори.<br /><br />Това ще накара новия клонинг на дървото да започне от произволно място в долната част на екрана.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-24": "Добавете <b>плъзгане [1] секунди към: x[] y:[]</b> блок.<br /><br />Плъзгащите блокове извършват плавно движение за определен период от време.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-25": "Променете го, за да кажете <b>плъзгане [2] секунди на x: [позиция x] y: [200]</b>.<br /><br />Можете да намерите блока за позиция x в категорията Движение.<br /><br />Това ще накара дървото да се премести от долната към горната част на екрана за 2 секунди, запазвайки позицията x (лявата и дясната позиция) същата.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-26": "Преди блока за плъзгане добавете блок за <b>показване</b> от категорията Външен вид.<br /><br />Клонингът ще започне скрит, тъй като спрайтът, от който е копиран е скрит и трябва да го покажем, преди да започнем да го местим.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-27": "Искаме всеки клонинг на дървото да изчезне, когато достигне горната част на екрана.<br /><br />За да направите това, добавете блок <b>изтриване на този клонинг</b> от категорията Контрол под блока за плъзгане.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-28": "Опитайте!<br /><br />Всяка секунда ще се появява ново дърво и ще се придвижва нагоре по екрана.<br /><br />За да спрете програмата, натиснете червения знак Stop.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-29": "Нека накараме играта да открие дали пингвинът се блъска в дърво.<br /><br />Към избрания спрайт Дърво, добавете друг блок <b>когато започна като клонинг</b> и цикъл <b>винаги</b> под него.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-30": "Добавете блок <b>if [] then</b> вътре в цикъла винаги.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-31": "Променете го така, че да казва <b>ако [докоснете [Пингвин 2]] тогава</b>.<br /><br />Можете да намерите докосващоя блок в категорията Сетива и можете да изберете Пингвин 2 от падащото меню.<br /><br />Това условие if ще бъде вярно, ако дървото докосва пингвина.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-32": "Вътре в условието if добавете блок <b>стоп [всичко]</b>.<br /><br />Това ще направи играта завършена, ако пингвинът се блъсне в дърво.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-33": "Опитайте!<br /><br />Покрийте левия сензор за обекти, за да започнете играта, и наклонете Cog, за да управлявате пингвина, за да избегнете дърветата.<br /><br />Когато докоснете дърво, играта ще приключи!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-34": "Нека добавим резултат!<br /><br />Направете друга променлива, наречена <b>резултат</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-35": "Докато спрайтът Tree все още е избран, добавете блок <b>set [score] to [0]</b> след блока <b>when I receive [start]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-36": "И добавете блок за <b>промяна на [резултат] с [1]</b> между плъзгането и изтрийте тези блокове за клониране.<br /><br />Това ще увеличи резултата с 1 за всяко дърво, което успешно избягваме.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-37": "Нека да направим играта по-трудна, докато продължава.<br /><br />Добавете друга променлива, наречена <b>закъснение</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-38": "Добавете тези блокове заедно с другите за спрайта на дървото.<br /><br />Когато играта започне, забавянето ще бъде зададено на 1.<br /><br />След това на всеки 5 секунди забавянето ще бъде зададено на ¾ (три четвърти) от това, което е било преди.<br /><br />То ще премине от 1 секунда до 0,75 секунди (три четвърти от секундата), до 0,56 (малко над половин секунда), до 0,42, до 0,3 секунди и т.н.!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-39": "Сега използвайте променливата за забавяне, за да зададете времето между създаването на дървета.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-40": "Опитайте!<br /><br />Ще забележите, че дърветата започват да се появяват много по-бързо колкото по-напред отивате!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-41": "Нека добавим малко светлини в Cog, за да направим нещата по-вълнуващи.<br /><br />Добавете блок <b>разпространи [стоп] и изчакване</b> преди блока <b>стоп [всички]</b>.<br /><br />Ще трябва да създадете ново съобщение, наречено <b>стоп</b>.<br /><br />Блокът <bразпространие [стоп] и изчакване</b> ще гарантира, че какъвто и код да се изпълнява, когато се изпрати съобщението stop, ще завърши, преди кодът да продължи и блокът <b>stop [all]</b> да се изпълни.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-42": "Изберете Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-43": "Добавете <b>задайте [пръстени] светодиоди към [зелен]</b> блок и <b>задайте [пръстени] светодиоди към модел [Spin1]</b> блок, както е показано тук.<br /><br />Това ще започне да се върти светлините на Cog, когато играта започне.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-44": "Добавете блок <b>когато получа [стоп]</b> и блок за <b>задаване на светодиодите [пръстен] на [червено]</b>.<br /><br />Те ще накарат светлините да станат червени, когато играта приключи.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-45": "Браво!<br /><br />Научихте се как да направите игра в Blocks! Използвахме функцията за клониране, за да направим много копия на дървета, които да избягваме, и накарахме Cog да контролира герой на екрана.<br /><br />Следващи стъпки:<ul><li>Можете ли да направите друг тип препятствия, които да избягвате - може би камъни?</li><li>Можете ли да накарате пингвина да скочи, когато натиснете бутона на Cog?</li><li>Можете ли да го направите така, че да можете да прескачате скалните препятствия до получавате бонус точки?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.name": "Музикален инструмент",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.description": "Нека превърнем Cog в музикален инструмент!<br /><br />Ще накараме Cog да свири ноти, които се променят според начина, по който взаимодействате с него, и ще научим за музикалните клавиши.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-1": "Нека превърнем Cog в музикален инструмент!<br /><br />Ще накараме Cog да свири ноти, които се променят според начина, по който взаимодействате с него, и ще научим за музикалните клавиши.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-2": "Първо, нека измерим какво „вижда“ Cog, когато взаимодействате със сензора за обекти.<br /><br />Вземете празен лист хартия и използвайте линийка, за да маркирате всеки сантиметър от 0-5 см. Номерирайте отметките от 0-5.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-3": "Поставете Cog върху знака 0 с десния сензор за обект, сочещ към маркировките за разстояние.<br /><br />Променете блока стойност на инфрачервения сензор [вляво] към <i>десния</i> сензор и поставете отметка в квадратчето до него.<br /><br />Това ще покаже показанията от инфрачервения сензор - друго име за сензора за обект, тъй като той използва инфрачервена светлина, за да работи.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-4": "Запишете стойността на инфрачервения сензор отдясно без нищо пред него.<br /><br />След това поставете ръката си върху знака от 5 см, запишете числото, което сензорът отчита сега.<br /><br />Нормално е стойностите да се движат малко нагоре и надолу - опитайте се да запишете число, което е в средата на тези вариации.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-5": "Повторете това с ръка върху маркировките 4cm, 3cm, 2cm, 1cm и 0cm.<br /><br />В крайна сметка трябва да получите таблица с измервания.<br /><br />Може да забележите, че числата се променят много, когато ръката ви е близо до Cog, но по-малко, колкото повече се отдалечава ръката ви.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-6": "Нека накараме Cog да изсвири нота, когато бутонът е натиснат.<br /><br />Добавете блок <b>при натискане на бутон</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-7": "Ще използваме правилния IR сензор, за да изберем коя нота да изсвирим. Нека запазим текущата стойност, като създадем променлива, наречена <b>reading</b> и я зададем на стойността на десния IR сензор.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-8": "Сега трябва да използваме условни изрази, за да изберем коя нота да изсвирим.<br /><br />Искаме да изсвирим само една нота, така че ще използваме блока <b>if … else</b>.<br /><br />За условието добавете <b>по-малко от</b> (<) сравнение и го задайте на <b>четене &lt; [2100]</b>. Вместо 2100, задайте това число на това, което сте измерили, когато ръката ви е била на линията от 4 см.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-9": "Добавете блок <b>Начална нота [C4]</b> в частта if на блока if … else.<br /><br />Това е най-ниската нота, която ще направим, и ще я направим, когато отчитането от IR сензора е ниско – т.е. ръката ви е далеч от него.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-10": "Опитайте!<br /><br />Натиснете бутона без нищо пред Cog - трябва да чуете нота.<br /><br />Натиснете бутона отново, като държиш ръката си на няколко сантиметра пред Cog. Този път нищо няма да се случи, защото програмата е преминала към частта иначе (else) в условието.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-11": "Нека да кодираме още ноти!<br /><br />Ще добавим още един блок <b>if … else</b> вътре в else частта на първия.<br /><br />Поставянето на условни елементи един в друг по този начин се нарича влагане.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-12": "Задайте условието на втория блок if … else да казва <b>[четене] &lt; 2200</b>, но вместо 2200 използвайте числото, което сте измерили с ръката си на 3-сантиметровата линия.<br /><br />Добавете друг блок <b>Начална нота</b> вътре в частта if на второто условие и го настройте да възпроизвежда нотата <b>D4</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-13": "Направете това още два пъти, така че да получите четири блока if … else.<br /><br />Можете да направите това по-бързо, ако щракнете с десния бутон или натиснете и задържите последния блок if… else и изберете опцията <b>Дублиране</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-14": "За третото условно условие задайте числото на това, което сте измерили на знака 2 cm.<br /><br />За четвъртото условие задайте числото на това, което сте измерили на знака 1 cm.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-15": "Променете третата нота на <b>E4</b>.<br /><br />Променете четвъртата нота на <b>G4</b>.<br /><br />Може да забележите, че сме пропуснали нота! Ще изсвирим само пет ноти и ги избираме от нещо, наречено пентатонична С гама.<br /><br />Пентатонична означава, че има 5 ноти на октава и До е музикалният ключ. Тоналността показва кои диези и бемоли се използват в една песен – това са черните клавиши на пианото.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-16": "Сега е време за петата нота.<br /><br />Няма нужда да използвате друг блок if … else, тъй като това е единствената останала опция!<br /><br />Добавете блок <b>Начална нота [A4]</b> в частта else на последния условен if … else.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-17": "Опитайте!<br /><br />Можете ли да накарате Cog да направи всичките 5 ноти?<br /><br />Можете да промените малко числата, ако искате да направите някакви корекции.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-18": "Нека накараме Cog да спре да възпроизвежда нотата, когато спрете да натискате бутона.<br /><br />След всички блокове if .. else добавете блок <b>изчакай докато [[натиснат бутон] = [False]]</b> и блок <b>Stop звуци</b>.<br /><br />Ще трябва да потърсите в категорията Контрол за блока за изчакване, категорията Oператори за блока =, Категория Сетива за блок с щракнати бутони и категория Звуци за блок за спиране на звуци.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-19": "Опитайте отново!<br /><br />Сега Cog ще спре да свири нотата, когато спрете да натискате бутона.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-20": "Би било забавно, ако можете да промените нотата, докато държите бутона натиснат.<br /><br />Поставете блок за <b>повтаряне докато</b> около целия код, точно след блока при натискане на бутон.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-21": "Задайте условието в блока за повторение до да бъде <b>[[бутонът натиснат] = False]</b>.<br /><br />Преместете блока <b>Спиране на звуци</b> извън цикъла за повторение до и заменете блока <b>изчакайте до</b> с блок <b>изчакайте [0,1] секунди</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-22": "Опитайте!<br /><br />Вземете Cog и движете ръката си напред-назад пред сензора, докато сте натиснали бутона - трябва да чуете нотата да се движи нагоре и надолу!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-23": "Направихме Cog да възпроизвежда ноти в тоналността C, така че би трябвало да можем да свирим заедно с всяка песен, която също е в тоналността C!<br /><br />Например, опитайте да свирите заедно с „Let it Be“ на The Beatles.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-24": "Би било още по-добре, ако можем да променяме нотите по-бързо, но трябва да сме сигурни, че няма да изпратим твърде много команди на Cog и да го претоварим.<br /><br />Нека използваме променливи, за да следим коя нота свирим, и да я променяме само когато имаме нужда.<br /><br />Създайте две нови променливи, наречени <b>нота</b> и <b>последнаНота</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-25": "Заменете всеки от блоковете <b>Начална нота</b> с блок <b>задай [нота] to [нотаc4]</b>.<br /><br />Ще трябва да въведете <b>нотаc4</b> точно по този начин, за да работи. За другите ноти ще използвате <b>нотаd4</b>, <b>нотаe4</b>, <b>нотаg4</b> и <b>нотаa4</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-26": "Заменете блока <b>чакай [0,1] секунди</b> след всички условни изрази с блок <b>if</b> по следния начин:<br /><br />Условието трябва да бъде <b>if [not [[note] = [lastNote]] then</b>.<br /><br />Можете да намерите блока <b>not</b> в категорията Оператори. Както може да се очаква, то е вярно само ако това, което е вътре в него, е невярно. Така че тук условието е вярно само ако стойността на променливата \"нота\" не е равна на стойността на променливата последнаНота.<br /><br />Ако случаят е такъв, има нова нота за възпроизвеждане, така че вътре в блока if добавете блок <b>Начална нота [нота]</b>.<br /><br />Също така добавете <b>задай [последнаНота] към [нота]</b>. Това ще гарантира, че програмата помни коя е била последната нота следващия път в цикъла.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-27": "Можете ли да забележите каква малка грешка би се получила, ако завършим кода тук?<br /><br />Bug e грешка - в този случай има още нещо, което трябва да направим, за да сме сигурни, че винаги свирим нота, когато бутонът е натиснат - и това е да изчистим променливата последнаНота, когато спрем звуците.<br /><br />Направете това, като добавите блок <b>задай [последнаНота] към [0]</b> в края на кода.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-28": "Опитайте!<br /><br />Сега, когато движите ръката си, нотата трябва да се променя по-бързо!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-29": "Браво!<br /><br />Направихте музикален инструмент, който можете да използвате, за да свирите заедно с песни!<br /><br />Използвайки пентатоничната гама за песен, която е в същата тоналност, можете да свирите заедно, докато оставате в тон!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-30": "Как иначе бихте могли да промените нотата?<br /><br />Какво ще кажете за това как Cog е наклонен? След това можете да промените нотата само като въртите Cog наляво и надясно!<br /><br />Можете да промените кода си, за да изпробвате това - ето малък съвет как да направите това:",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-31": "Кое предпочитате - да използвате инфрачервения сензор или наклона, за да зададете нотата?<br /><br />Какви други сензори бихте могли да използвате?<br /><br />Опитайте да свирите заедно с други песни в тоналността C.<br /><br />Можете също да промените нотите, за да изсвирите вместо това пентатоничната гама за различна тоналност. Много песни са в една и съща тоналност, въпреки че някои имат промени в тона - как бихте могли да накарате Cog да промени тоналността, в която свири?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.name": "Часовник",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.description": "Нека превърнем Cog в часовник!<br /><br />Има 12 светодиода в пръстена на Cog, така че можем да ги използваме като стрелки на часовник, за да показваме часове, минути и секунди!<br /><br />Ще помислим малко за необходимата математика и ще проявим творчество с различни начини за показване на времето!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-1": "Нека превърнем Cog в часовник!<br /><br />Има 12 светодиода в пръстена на Cog, така че можем да ги използваме като стрелки на часовник, за да показваме часове, минути и секунди!<br /><br />Ще помислим малко за необходимата математика и ще проявим творчество с различни начини за показване на времето!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-2": "Добавете следните блокове към вашия код:<br /><br /><b>при щракване върху зеления флаг</b><ul><li>изключете всички светодиоди</li><li>задайте LED [1] на [червено]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-3": "Отидете в категорията <i>сетива</i> и плъзнете блока <b>текуща [година]</b> в зоната за кодиране.<br /><br />Променете го, за да кажете <b>текущ [час]</b> и щракнете върху него.<br /><br />Точно както сензорите на Cog променят стойността, този блок ще се промени, за да представя текущото време.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-4": "Интерфейсът Blocks, подобно на повечето компютри, използва 24-часов часовник.<br /><br />Ако е сутрин, текущият час ще бъде между 0 и 11.<br /><br />Ако е следобед, текущият час ще бъде между 12 и 23.<br /><br />Нормалните аналогови часовници използват вместо това 12-часов часовник, където има два 12-часови сегмента (сутрин и следобед) в 24-часов ден.<br /><br />Cog има 12 светодиода в пръстена, така че ще използваме и 12-часов часовник. Как можем да променим числото в интерфейса на Blocks от 24-часов часовник на 12-часов часовник?<br /><br />Можем да проверим дали часът е по-голям от 11 и ако е така, тогава да извадим 12.<br /><br />Или можем да използваме модулния оператор, който ви дава остатъка, след като извършите деление.<br /><br />Така че тук, ако разделим 17 на 12, получаваме отговор от 1 с остатък 5 (или 1r5). 17:00 в 24-часовия часовник е 05:00 следобед в 12-часовия часовник, така че е проверено!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-5": "Поставете <b>[[текущ [час]] mod [12]]</b> като LED id в блока <b>set LED</b>.<br /><br />Опитайте да изпълните кода, като натиснете зеления флаг - Cog ще покаже една червена светлина, която показва къде ще бъде стрелката, показваща часа!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-6": "Вероятно искаме да показваме повече от часа на нашия часовник, така че нека разберем как да показваме и минутите.<br /><br />Блокът <b>текуща [минута]</b> ще ви даде минутата като число между 0 и 59!<br /><br />Плъзнете го в областта с кодове и щракнете върху него, за да видите текущата минута.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-7": "Има обаче друг проблем, трябва да покажем 60 минути само на 12 светодиода!<br /><br />Стрелката на минутите на часовника прави едно завъртане на всеки час, започвайки от позиция 12 часа. 30 минути след часа, минутната стрелка е в позиция 6 часа, наполовина на въртене.<br /><br />Светодиодите на Cog са номерирани като часовете на часовника. Стрелката за минути се движи 5 минути между всяко от числата на часовника. Това има смисъл, защото 60 минути / 12 числа = 5 минути на число.<br /><br />Така че, ако използваме оператора за деление, за да разделим <b>текущата [минута]</b> на 5, ще знаем кой светодиод да включим, за да покаже минутната стрелка на нашия часовник.<br /><br />Има обаче още един проблем - просто разделянето на минутата на 5 обикновено няма да даде цяло число и трябва да посочим LED като цяло число (или цяло число).<br /><br />За да преминем от числото с десетична запетая към цяло число, трябва да го закръглим. Ако просто закръглите, тогава блоковете ще закръглят или нагоре, или надолу, в зависимост от това дали фракцията е под .5, или .5, или по-висока.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-8": "За нашия часовник обаче не искаме стрелката на минутите да се премести на следващата позиция, докато не е напълно там. Например в 17:09 все още бихме искали тя да е на позиция „1“.<br /><br />За да направим това, ще трябва винаги да закръгляме надолу. Има начин да направите това в Blocks - използвайки оператора <b>floor</b>. Можете да намерите това в оператора, който казва <b>[abs]</b> по подразбиране, в падащия списък.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-9": "Добавете блок, за да <b>зададете [[floor] на [[текуща [минута]] / [5]] на [синьо]</b>.<br /><br />Опитайте! Натиснете зеления флаг и сега Cog ще покаже стрелката за минутите като синя светлина, както и стрелката за часа като червена светлина.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-10": "Как бихте показали и секундите?<br /><br />Добавете друг блок <b>Задай LED</b>, но този път го направете да зададе LED <b>[[floor] на [[текуща [секунда]] / [5]] на [зелено]</b>.<br /><br />Не забравяйте, че можете да щракнете с десния бутон или да натиснете и задържите блок, за да получите опцията да го дублирате - това може да спести много време.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-11": "Опитайте!<br /><br />Сега ще получите три „стрелки“ на часовника – червена за часове, синя за минути и зелена за секунди!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-12": "Нека направим така, че времето да се актуализира автоматично. Добавете цикъл <b>винаги</b> и блок <b>изчакайте [5] секунди</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-13": "Опитайте!<br /><br />Сега на всеки 5 секунди времето ще се актуализира и стрелките ще се движат по часовника!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-14": "Малко е объркващо, ако различните стрелки са на едно и също място, опитайте се да добавите малка пауза между всеки светодиод и да промените паузата в края на само 3 секунди.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-15": "Изпробвайте!<br /><br />Сега ще показва часовете, минутите и секундите една по една.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-16": "Би било страхотно да можем да покажем дали е сутрин или следобед.<br /><br />Можем да направим това, като променим цвета на фона на часовника в зависимост от това дали часът е по-малък от 12.<br /><br />Заменете блока <b>Изключване на всички светодиоди</b> с блок <b>ако… иначе</b>, който проверява дали текущият час е < 12.<br /><br />След това изберете два различни цвята, за да настроите светодиодите на пръстена за pm и am. В този пример сме избрали оранжево за сутрин и лилаво за следобед - цветовете трябва да са различни от тези, които използвате, за да покажете стрелките на часовника.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-17": "Опитайте!<br /><br />Сега вашият часовник ще ви покаже дали е сутрин или следобед, като промени цвета си!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-18": "Как по друг начин бихме могли да покажем часа?<br /><br />Този код ще покаже часа чрез включване на всички светодиоди от позицията на 12 часа до текущия час - така че с наближаването на времето повече светодиоди ще се включват.<br /><br />Изтрийте предишния си код на часовника и изпробвайте!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-19": "Ако имате приятели, които също имат Cog, можете ли да използвате трима от тях, за да показват часа - един да показва час, един минути и един секунди, по този начин?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-20": "Можете също да използвате едно зъбно колело, за да показвате по-бавното движение на часовете, като постепенно включвате следващия светодиод с изтичането на минутите.<br /><br />Изтрийте предишния си код на часовника и го изпробвайте!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-21": "Опитайте!<br /><br />Светодиодите ще светнат бавно с течение на времето - например на тази снимка часовникът ни показва 6 и половина!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-22": "Ако имате време, можем да опитаме да направим нашия оригинален часовник по-усъвършенстван.<br /><br />Можем да анимираме стрелката за секунди да мига всяка секунда, ето така - тогава няма да има значение, ако покрива другите стрелки.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-23": "За да направим това, ще използваме списък, за да следим кой цвят трябва да бъде всеки светодиод.<br /><br />Отидете до категорията <b>Променливи</b> и щракнете върху бутона <b>Създаване на списък</b>, за да направите списък, наречен <b>светодиоди</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-24": "Списъците са специални променливи, които могат да съдържат подреден списък от отделни променливи.<br /><br />Изтрийте предишния си код и добавете блоковете, показани на изображението.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-25": "Натиснете зеления флаг, за да стартирате кода, списъкът със <b>светодиоди</b> ще получи 12 цветни кода, поставени в него - по един за всеки светодиод на Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-26": "Създайте две нови променливи, наречени <b>час</b> и <b>минута</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-27": "Добавете блокове, за да зададете тези променливи на позициите на стрелките на часа и минутите, използвайки същата математика, както преди.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-28": "Сега ще променим елементите в списъка, за да зададем цветовете на стрелките за часа и минутите.<br /><br />Блокът <b>замяна на елемент</b> ще промени елемента на посочената позиция в списъка. Тъй като списъкът започва да номерира елементите си от 1, трябва да добавим 1 към променливите час и минута.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-29": "Пробвайте да изпълните кода, като натиснете зеления флаг.<br /><br />Сега списъкът ще се актуализира с различни цветови кодове за часовата и минутната стрелка.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-30": "Да добавим решение, което да работи правилно, когато стрелките за час и минута са на едно и също място.<br /><br />Добавете оператор <b>if</b>, за да проверите дали променливите за час и минута са еднакви (т.е. дали стрелките за час и минута са на едно и също място).<br /><br />Ако е така, променете елемента в списъка с различен цвят - в този случай сме избрали лилаво, като сме задали червено и синьо на 255 и зелено на 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-31": "Добре, сега имаме списък, който представлява цветовете, които искаме да покажем на светодиодите на Cog - време е да ги покажем!<br /><br />Направете друга променлива, наречена <b>ledID</b>, и я използвайте в цикъл, за да зададете 12-те светодиода на Cog.<br /><br />За да зададете различните цветове, ще се позовем на елементите в списъка <b>leds</b> с помощта на Блок <b>item</b> - запомняне за добавяне на 1.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-32": "Опитайте!<br /><br />12-те цветни кода в списъка <b>светодиоди</b> ще бъдат показани като цветове на Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-33": "Нека поставим кода в цикъл, така че да се актуализира автоматично.<br /><br />Добавете блок <b>изчакай докато</b> в края и го настройте да изчака, докато минутната стрелка трябва да се промени, като проверите стойността на мястото, където трябва да бъде минутната стрелка спрямо стойността, съхранена в променливата <b>минута</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-34": "След това поставете кода в цикъл <b>винаги</b>, така че да се изпълнява многократно.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-35": "Сега е време да добавим стрелка за секундите!<br /><br />Ще направим това в паралелен раздел на кода, така че добавете друг блок <b>при щракване върху зеления флаг</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-36": "Направете друга променлива, наречена <b>секунда</b>, и я задайте по същия начин, по който зададохме позицията на секундарника преди.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-37": "Сега добавете блокове, за да настроите втория светодиод на зелено, изчакайте секунда, след което го променете обратно към цвета, който е в списъка <b>светодиоди</b>.<br /><br />По този начин си спомнихме какъв цвят трябва да бъде светодиодът, след като го променим. Списъкът с <b>светодиоди</b> се използва за запомняне на състоянието на часовата и минутната стрелка на нашия часовник.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-38": "Поставете кода на секундната стрелка също в цикъл <b>винаги</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-39": "Вашият код сега трябва да изглежда така - Опитайте!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-40": "Браво!<br /><br />Използва много математика, за да направиш часовник с Cog! Мислили сте за различни начини, по които бихте могли да показвате часа.<br /><br />Ако сте стигнали до края, сте научили и за списъците като начин за съхраняване на подредена информация, като например състоянието на всеки светодиод на Cog.<br /><br />Следващи стъпки:<ul><li>Можете ли да накарате този нов часовник да променя цвета на фона в зависимост от това дали е сутрин или следобед?</li><li>Би ли имало повече смисъл, ако „секундната“ стрелка действително се върти веднъж на всеки 5 минути, за да показва по-точно времето? Какво бихте променили, за да се случи това?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.name": "Подвижно колело",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.description": "Нека направим подвижно колело!<br /><br />Това е специално колело, което ще следи колко далеч се е търкаляло!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-1": "В предишни дейности видяхме как можем да използваме акселерометъра на Cog, за да измерим в коя посока се накланя Cog.<br /><br />Можем също да използваме този сензор, за да разберем ъгъла, под който е Cog.<br /><br />Ще използваме това, за да превърнем Cog в подвижно колело - това е устройство за измерване на разстояния чрез търкаляне на колело по тях.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-2": "Добавете блок <b>при щракване върху зелен флаг</b> и цикъл <b>винаги</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-3": "Създайте променлива, наречена <i>ъгъл</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-4": "<b>Задайте</b> <b>ъгъла</b> на <b>atan2</b> на [Акселерометър [Y]] и [Акселерометър [X]].<br /><br />Можете да намерите блока <b>atan2</b> в категорията на операторите.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-5": "Atan2 е математическа функция, която използва тригонометрия, за да изчисли ъгъла вътре в правоъгълен триъгълник, когато са дадени дължините на прилежащите и срещулежащите катети.<br /><br />Тук въвеждаме ускорението по оста Y и X, които са перпендикулярни една на друга (на 90 градуса), а функцията atan2 ще ни каже ъгъла.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-6": "Опитайте!<br /><br />Натиснете зеления флаг и след това задръжте Cog вертикално с жълтата стрелка, сочеща нагоре, и го завъртете като волан.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-7": "Докато въртите Cog по посока на часовниковата стрелка, ще видите, че ъгълът се променя от 0 градуса, когато зъбното колело сочи нагоре, до 180 градуса, когато зъбното колело сочи надолу.<br /><br />След това ще се промени до -180 градуса, преди да се увеличи обратно до 0 градуса, докато продължавате да въртите по часовниковата стрелка.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-8": "Бихме предпочели нашето подвижно колело да брои от 0 до 360 градуса.<br /><br />Добавете тези блокове вътре в <b>цикъл винаги</b>:<ul><li><b>Ако</b> [[ъгъл] < [0]] тогава</li><ul><li>Променете [angle] с [360]</li></ul></ul><br />Сега вместо -180 градуса, нашият ъгъл ще бъде зададен на +180 градуса.<br /><br />Той ще продължи да се увеличава оттам до 360 и след това ще се върне обратно до 0 градуса.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-9": "Опитайте!<br /><br />Сега, когато завъртите зъбното колело, ъгълът ще се движи от 0-360 и след това ще се връща обратно.<br /><br />Тази математика работи, защото 360 градуса е пълен оборот, така че когато добавим още 360 градуса към ротацията, ще сочим в същата посока, но вече с положителен ъгъл, който ще е по-лесно да използваме, когато броим обороти.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-10": "Нека добавим спрайт на екрана, за да покажем въртенето на Cog.<br /><br />От менюто <i>Изберете спрайт</i> изберете опцията <i>paint</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-11": "Нека нарисуваме спрайт, който да представлява Cog!<br /><br />Започнете с добавяне на кръг и след това използвайте инструмента за линии, за да направите шестоъгълник около него.<br /><br />Кръгът е само ориентир, който ни помага да направим правилния шестоъгълник - не се притеснявайте, ако вашият шестоъгълник не е перфектен!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-12": "Изтрийте кръга и го заменете с по-малък кръг в средата, за да представлява бутона на Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-13": "И накрая начертайте триъгълник с помощта на инструмента Линия и го оцветете в жълто.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-14": "Щракнете върху раздела <i>Код</i>, за да се върнете към екрана за кодиране.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-15": "С избрания спрайт добавете тези блокове:<ul><li>При щракване върху зелен флаг</li><li>Винаги</li><ul><li>Насочи в посока [ъгъл]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-16": "Опитайте!<br /><br />Натиснете зеления флаг и след това завъртете Cog - ще видите, че спрайтът също се завърта!<br /><br />Има обаче проблем - спрайтът е на 90 градуса от Cog - това е така, защото интерфейсът Blocks отчита точката наляво като 0 градуса, докато ние считаме, че насочването нагоре е 0 градуса",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-17": "За да превключите между тези различни начини на измерване, добавете 90 градуса към ъгъла в кода<br /><br />Опитайте отново и движението на спрайта на Cog ще съвпадне с това на вашия реален Cog!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-18": "Изберете Cog отново.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-19": "Нека добавим светодиод към Cog, за да покажем, че сензорът за въртене работи.<br /><br />Добавете 2 нови променливи, наречени <i>LED</i> и <i>lastLED</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-20": "Нашата променлива за ъгъл ни казва въртене от 0 до 360 градуса, но имаме само 12 светодиода около пръстена на Cog.<br /><br />Това означава, че разделителната способност ще бъде 30 градуса за светодиод, тъй като 360 градуса / 12 светодиода = 30 градуса / светодиод.<br /><br />Добавете тези блокове вътре <b>цикъл винаги</b>:<ul><li>Задайте [LED] на [[закръгли [ъгъл]/[30]] mod [12]]</li></ul><br />Ние разделяме ъгъла на 30, за да получим число между 0 и 12, и след това го закръгляме, тъй като имаме нужда от цяло число (или цяло число), за да посочим кой светодиод ще светне.<br /><br />Тогава, тъй като нашите светодиоди са номерирани само от 0 до 11, ние използваме мод блока, както направихме в дейността с часовника. Това е <i>модулният оператор</i> и връща остатъка, когато двете числа са разделени - така че вместо да получим число 12 за идентификатора на светодиода, вместо това ще получим отново 0 - което искаме, защото светодиод 0 е на позиция 12 часа на Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-21": "Сега добавете и тези блокове вътре в <b>цикъл винаги</b>:<ul><li>Ако [не [[LED] = [lastLED]]] тогава</li><ul><li>Задайте LED [LED] на [синьо]</li><li>Задайте LED [lastLED] на [черно]</li><li>Задайте [lastLED] на [LED]</li></ul></ul><br />Можете ли да разберете как тази нова секция на кода работи и какво ще направи?<br /><br />Използваме променливите LED и lastLED, за да следим кой светодиод свети и дали трябва да го променим. Когато стойността на светодиода се промени от една итерация на цикъла към следващата, условието в оператора if ще бъде вярно.<br /><br />Когато това се случи, ние включваме новия светодиод и изключваме стария (като го настроим на черно, което е същото като да бъде изключен за светлина). Накрая актуализираме променливата lastLED, така че да е зададена за следващия път в цикъла.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-22": "Опитайте!<br /><br />Натиснете зеления флаг и след това завъртете зъбното колело.<br /><br />Ще забележите, че се случва нещо смешно! Понякога светодиодът, който свети, е отгоре, а понякога е отдолу!<br /><br />Това е малко объркващо и не е това, което искахме.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-23": "Ако се замислите, това е така, защото светодиодът се върти по посока на часовниковата стрелка в същото време, когато ние въртим Cog също по посока на часовниковата стрелка.<br /><br />За да бъде светодиодът винаги в долната част на Cog, трябва да се върти в посока, обратна на посоката на Cog.<br /><br />Как можем да направим това?<br /><br />Променете кода си така, че да казва <b>задайте [LED] на [[закръгли [[360] - [ъгъл]] / [30]] мод [12]]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-24": "Опитайте!<br /><br />Сега, когато завъртите зъбното колело, светодиодът винаги ще бъде отгоре!<br /><br />Когато извадим променливата [ъгъл] от 360, това, което всъщност правим, е да обърнем посоката, в която се въртим около кръга.<br /><br />Например, ако завъртим 10 градуса по часовниковата стрелка от 0, ще бъдем на 10 градуса. Ако завъртим 10 градуса обратно на часовниковата стрелка от 0, ще бъдем на 350 градуса.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-25": "Това е доста близо, но все още не е точно това, което търсим. Би било по-интуитивно, ако светодиодът е в долната част на зъбното колело, а не в горната част.<br /><br />Как бихме могли да направим това?<br /><br />По принцип трябва да добавим 6 към LED променливата - и точно както добавянето на 6 часа ще завърти часовата стрелка наполовина около циферблата на часовника, добавянето на 6 към LED променливата ще се завърти наполовина около пръстена от 12 светодиода.<br /><br />Ще разчитаме на мод оператора да връща числата от 11->0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-26": "Опитайте!<br /><br />Сега, когато завъртите Cog, светодиодът, който свети, ще бъде отдолу.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-27": "Добре! Сега имаме добра обратна връзка от потребителите, че отчитането на въртене работи, нека накараме Cog да измерва разстоянието!<br /><br />За този следващ момент ще ви трябва кръг от картон - това ще бъде нашето колело.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-28": "Очертайте горната част на зъбното колело и след това изрежете шестоъгълник в средата на кръга.<br /><br />(не е нужно да сте идеално в средата)<br /><br />Измерете диаметъра на вашия кръг.<br /><br />Този тук е с диаметър около 200 мм, което означава, че радиусът е 100 мм.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-29": "Нека включим това число в нашата програма.<br /><br />Създайте две нови променливи, наречени <i>радиус</i> и <i>обиколка на окръжност</i>.<br /><br />Добавете нови блокове, за да ги зададете преди цикъл винаги:<ul><li>Задайте [радиус] на [100]</li><li>Set [обиколка на окръжност] tp [2] * [[3.14] * [радиус]]]</li></ul><br />Там заменете 100 с радиуса на вашето колело.<br /><br />Ще измерваме изминатото разстояние, докато колелото се върти, където всяко завъртане на колелото ще покрива разстояние, равно на обиколката на колелото.<br /><br />Не забравяйте, че обиколката е равна на 2 * pi * радиус. Тук закръгляме pi като 3,14.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-30": "Ще ни трябват още няколко променливи, които да ни помогнат да изчислим изминатото разстояние.<br /><br />Направете тези нови променливи:<ul><li>последенЪгъл - ще използваме това, за да проследим какъв е бил ъгълът последния път около цикъла завинаги, както направихме с променливата lastLED</li><li>обороти - ще използваме това, за да следим колко пълни оборота е имало на колело</li><li>общо завъртане - ще съберем пълните и частичните обороти, за да получим общото завъртане в градуси</li><li>разстояние - ще преобразуваме това общо завъртане в разстояние</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-31": "За да преброим броя на оборотите, ще трябва да следим кога ъгълът се променя от 360 -> 0 и обратно.<br /><br />Ще използваме променливата lastAngle за това. Когато ъгълът премине от 360 на 0 градуса, резултатът от [angle] - [lastAngle] ще бъде -360.<br /><br />На практика нашето измерване вероятно ще скочи от нещо като 355 -> 5 градуса.<br /><br />Добавете тези блокове вътре в <b>цикъл винаги</b>:<ul><li>Ако [[angle] - [lastAngle] < [-180]] след това</li><ul><li>Променете [оборотите] с [1]</li></ul></ul><br />Така че, ако ъгълът внезапно намалее с много (180 градуса или повече), ще знаем, че трябва да добавим 1 към броя на оборотите.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-32": "Трябва също така да проследим оборотите в обратната посока. Когато това се случи, ъгълът ще скочи от 0 -> 360 градуса.<br /><br />Добавете тези блокове вътре в <b>цикъл винаги</b>:<ul><li>Ако [[ъгъл] - [последенЪгъл]] > [180]] тогава</li><ul><li>Променете [оборотите] с [-1]</li></ul></ul><br />Това означава, че ако ъгълът скача много внезапно, ще намалим броя на оборотите с 1.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-33": "Добавете блок <b>задай [последенЪгъл] към [ъгъл]</b> вътре в <b>цикъл винаги</b>.<br /><br />Това ще подготви променливата последенЪгъл за следващия път в цикъла.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-34": "Сега е време да изчислите разстоянието, което колелото е извъртяло!<br /><br />Добавете този блок вътре в <b>цикъл винаги</b>:<ul><li>Задайте [общоЗавъртане] на [[[обороти] * [360]] + [[ъгъл]]]</li></ul><br />Това ще добави 360 градуса за всяко завъртане към текущото измерване на ъгъла, за да получите общото завъртане.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-35": "Сега добавете този блок:<ul><li>Задайте [разстояние] на [[[общоЗавъртане] / [360]] * [обиколка на окръжност]]</li></ul><br />Променливата общоЗавъртане дава общата ротация в градуси, така че като я разделим на 360, получаваме броя на оборотите като рационално число - такова, което може да има неща след десетичната запетая, а не само цели числа.<br /><br />Умножаването на това по обиколката ни казва общото разстояние, което колелото е извъртяло!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-36": "Опитайте!<br /><br />Поставете Cog в картоненото колело и се опитайте да го завъртите!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-37": "Би било чудесно да имате начин за лесно нулиране на брояча на разстоянието.<br /><br />Добавете тези блокове:<ul><li>При натискане на бутон</li><li>Задайте [разстояние] на [0]</li><li>Задайте [обороти] на [0]</li><li>Задайте [началенЪгъл] на [ъгъл]</li><li>Задайте [последенЪгъл] на [ъгъл]</li></ul><br />Ще ви трябва за да направим нова променлива, наречена <i>началенЪгъл</i>.<br /><br />Ще използваме това, за да сме сигурни, че можем да започнем да броим от какъвто и ъгъл да се намира Cog, когато натиснем бутона, а не само когато зъбното колело сочи нагоре.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-38": "Ще трябва да включим началния ъгъл в нашето изчисление на общата ротация, като го извадим от текущия ъгъл.<br /><br />Променете блока, който задава променливата общоЗавъртане на:<ul><li>Задайте [общоЗавъртане] на [[[обороти] * [360]] + [[ъгъл] - [началенЪгъл]]]</li></ul><br />Това ще извади началния ъгъл от текущия ъгъл, така че да можем да започнем да броим от какъвто и ъгъл да е зъбното колело, когато натиснем бутона.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-39": "Опитайте!<br /><br />Вземете линийка и поставете вашия Cog  до нея на знака 0.<br /><br />Натиснете бутона, за да нулирате зъбното колело, и след това завъртете колелото по линийката - трябва да откриете, че променливата за разстояние следи колко далеч сте се претърколили.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-40": "Може би сте забелязали, че в последния видеоклип имаше списък с разстояния.<br /><br />За да направите това, щракнете върху бутона <b>Създаване на списък</b> и направете списък, наречен <i>разстояния</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-41": "След това добавете блок <b>добавяне на [разстояние] към [разстояния]</b> точно след блока за натискане на бутона за включване.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-42": "Опитайте!<br /><br />Можете да измервате разстояния и да натиснете бутона, за да ги запишете в списъка, който да гледате, когато се върнете към екрана.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-43": "Браво!<br /><br />Научихте как да превърнете зъбното колело в устройство за измерване на разстояния! В реалния живот подвижните колела се използват за измерване на дълги разстояния и са с дръжки, за да могат да се търкалят.<br /><br />Използвахте математика, за да преобразувате измерения диаметър в радиус и след това в обиколка, и го използвахте заедно с измерването на ъгъла, за да изчислите разстоянието.<br /><br />Мислихте много за ъглите и използвахте променлива, за да следите как се променя ъгълът на зъбното колело, и условни изрази, за да запишете как се е променил броят на общите обороти.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.name": "Игра Летящ прилеп",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.description": "Нека направим още една игра!<br /><br />Този път ще направим игра за прилеп, който яде плодове и е доста претенциозен към храната си.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-1": "Нека направим още една игра!<br /><br />Този път ще направим игра за прилеп, който яде плодове и е доста претенциозен към храната си.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-2": "Ще накараме бухалката да лети наляво и надясно, като отново използваме отчитането на наклона на зъбното колело.<br /><br />Както направихте преди, създайте променлива, наречена <b>ay</b>.<br /><br />Ние също ще поддържаме резултат в тази игра, така че създайте и променлива, наречена <b>score</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-3": "Добавете тези блокове:<ul><li>Когато се щракне върху зелен флаг</li><ul><li>Задайте резултат на [0]</li><li>Завинаги</li><ul><li>Задайте [ay] на [Акселерометър [Y]]</li><li>Излъчване [актуализирайте позиция]</li></ul></ul></ul><br />Те ще:<ul><li>Оставят потребителя да започне играта, като натисне зеления флаг</li><li>Нулирайте резултата, когато играта започне</li><li>Актуализирайте променливата ay до стойността на оста Y на акселерометъра в цикъл и излъчете съобщението за актуализиране на позицията</li></ul><br />Ще използваме променливата <b>ay</b> и съобщението <b>актуализация на позиция</b>, за да променим позицията на нашия спрайт.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-4": "Нека добавим спрайта сега.<br /><br />Натиснете бутона <b>Избор на спрайт</b> и след това изберете спрайта на прилепа.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-5": "С избрания спрайт на прилеп добавете тези блокове:<ul><li>Когато получа [актуализира позиция]</li><ul><li>Задайте x на [[ay] * 200]</li></ul></ul><br />Това означава, че всеки път, когато променливата <b>ay</b> се актуализира, ние също ще преместим позицията на прилепа.<br /><br />Променливата ay ще варира предимно между -1 и 1, така че чрез умножаване по 200 ще зададем позицията x да бъде между -200 и 200.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-6": "Опитайте!<br /><br />Натиснете зеления флаг и след това наклонете зъбното колело от едната на другата страна, прилепът също ще се движи!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-7": "Нека направим нашия прилеп малко по-малък и го накараме да пада надолу по екрана по подразбиране.<br /><br />Добавете тези блокове:<ul><li>При щракване върху зеления флаг</li><li>Задайте размера на [50]%</li><li>Винаги</li><ul><li>Променете y с [-10]</li><li>Изчакайте [0,1] секунди</li></ul></ul></ul><br />Сега, когато натиснете зеления флаг и стартирате програмата, прилепът бавно ще падне надолу по екрана!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-8": "Нека направим така, че прилепът да размаха крилата си и да се изкачи отново.<br /><br />Изберете отново Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-9": "Добавете тези блокове:<ul><li>При усетен обект [вдясно]</li><li>Разпространи [размахай криле]</li></ul><br />Ще използваме десния инфрачервен сензор за обект да бъде бутонът, за да накараме прилепа да размаха крилата си, и ще използваме ново съобщение, наречено <b>размахай криле</b>, за да изпратим тази инструкция до спрайта на прилепа.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-10": "Изберете спрайта на прилепа.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-11": "Намерете следващия блок с костюм в категорията Външност.<br /><br />Опитайте да щракнете върху него - трябва да видите, че спрайтът на прилепа се променя на такъв в различна поза!<br /><br />Щракнете върху него няколко пъти - спрайтът на прилепа има четири различни пози, които се наричат ​​костюми в интерфейса на блоковете.<br /><br />Можем да използваме тези костюми, за да анимираме движенията на прилепа.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-12": "Добавете тези блокове:<ul><li>Когато получа размахай криле</li><li>Повторете [4]</li><ul><li>Следващ костюм</li><li>Променете y с [10]</li></ul></ul><br />Тъй като прилепът има четири костюма, ще направим този цикъл 4 пъти, за да преминем през всички тях.<br /><br />В същото време ще преместим прилепа нагоре екрана, така че да мести нагоре, докато маха с крила.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-13": "Трябва също да се уверим, че костюмът винаги започва с правилния в началото на играта.<br /><br />Добавете превключващ костюм към [bat-a] блок точно след зададения размер на [50]% блок.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-14": "Изпробвайте!<br /><br />Натиснете зеления флаг, за да стартирате кода, и след това опитайте да докоснете десния IR сензор за обект с пръст - прилепът ще излети нагоре по екрана!<br /><br />Все още можете да накланяте наляво и надясно, за да управлявате.<br /><br />Натиснете червения знак за спиране, за да спрете изпълнението на кода.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-15": "Нека добавим и по-забавен фон – прилепите често живеят в гората и харесват нощта, така че нека добавим горски фон.<br /><br />Щракнете върху бутона <b>Избор на фон</b>.<br /><br />След това изберете фона на Гората.<br /><br />Сега можете да летите с прилепа си през гората!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-16": "Добре – време е да превърнем това повече в игра!<br /><br />Нека започнем, като направим списък за пазаруване за нашия прилеп.<br /><br />Отидете в категорията <i>Променливи</i> и щракнете върху бутона <b>Създаване на списък</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-17": "Нашият прилеп е плодов прилеп и обича да яде плодове!<br /><br />Направете списък, наречен <b>плодове</b>.<br /><br />На екрана ще се появи празен списък.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-18": "Можем да добавяме неща към списъка, като използваме новите блокове, които са се появили в секцията с променливи.<br /><br />Първо, трябва да се уверим, че прилепът има празен списък, когато играта започне.<br /><br />Добавяне на тези блокове:<ul><li>Когато се щракне върху зеления флаг</li><li>Изтриване на всички от [плодове]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-19": "След това ще добавим плодове към списъка за пазаруване на нашия прилеп.<br /><br />Добавете блок <b>добавете [нещо] към [плод]</b> и го променете да казва <b>добавете [банан] към [плод]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-20": "Направете същото отново, за да добавите <b>ябълка</b> към списъка.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-21": "Натиснете зеления флаг, сега ще видите, че бананите и ябълките са добавени към списъка с плодове!<br /><br />В долната част също ви казва, че дължината на списъка е 2 елемента.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-22": "Нека накараме прилепа да избере нещо, което иска от списъка за пазаруване.<br /><br />Направете нова променлива, наречена <b>плодове</b>.<br /><br />Ще забележите, че можете да имате променлива, наречена плод и списък, наречен плодове.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-23": "Намерете <b>елемент [1] от [плодове]</b> блок и го плъзнете в областта за кодиране.<br /><br />Ако го натиснете, ще видите, че той връща (извежда) елемента, който е на посочената позиция в списъка - в този случай банан.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-24": "Намерете <b>дължината на блока [плодове]</b> и го плъзнете в областта за кодиране.<br /><br />Ако го натиснете, ще видите, че връща броя на елементите в списъка - в този случай 2.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-25": "Ако комбинирате тези два блока заедно, така че те казват <b>елемент [дължина на [плодове]] от [плодове]</b>, той ще намери последния елемент в списъка.<br /><br />Това е така, защото блокът <b>дължина на [плодове]</b> се оценява първи и връща стойност 2, както видяхте преди. Блокът <b>елемент</b> се оценява след това и приема това число 2 като вход и след това връща втория елемент в списъка.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-26": "Как бихме могли да накараме кода да избира произволен елемент от списъка?<br /><br />Използвайте блока <b>избери произволно</b> от категорията Oператори и го настройте да избира произволно число между 1 и <b>дължина на [плодове]</b>. След това поставете целия произволен блок в блока <b>елемент</b> по следния начин:<br /><br />Когато натиснете това, ще видите, че произволно избира банан или ябълка.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-27": "Добавете тези блокове под блока <b>добавете [ябълка] към [плодове]</b>:<ul><li>Повторете [10]</li><ul><li>Задайте [плодове] на [елемент [изберете произволно [1] до [дължина на [плодове]]] от [плодове]]</li><li>Излъчване [покажете плодове]</li><li>Помислете [плодове] за [5] секунди</li></ul></ul><br />Можете да намерите блока за мислене в раздела Изгледи и можете да добавите променливата fruit към него.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-28": "Изпробвайте!<br /><br />Сега на всеки 5 секунди прилепът ще избира произволен плод, за който да мисли!<br /><br />Кодът също така ще изпрати съобщението <b>покажи плодове</b>, което ще използваме скоро.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-29": "Нека добавим тези плодове в нашата игра.<br /><br />Щракнете върху бутона <b>Избор на спрайт</b> и изберете спрайта с банани.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-30": "Плъзнете бананите на по-добро място на екрана.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-31": "С избраните банани добавете тези блокове:<ul><li>При щракване върху зеления флаг</li><li>Винаги</li><ul><li>Ако [докоснете [Прилеп]] тогава</li></ul></ul><br />Този код също ще се изпълнява при стартиране на играта и ще проверява дали прилепът докосва бананите.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-32": "Ако прилепът е достигнал бананите, искаме да проверим дали това е плодът, който е искал да получи.<br /><br />Добавете условие <b>if … else</b>, вложено в блока if, и задайте условието на <b>[плод] = [банан]</b>, където плодът е променливата, която сте създали преди.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-33": "Ако плодът е правилен, ще увеличим резултата с 1 и ще изпратим правилното съобщение.<br /><br />В противен случай ще намалим резултата с 1 и ще изпратим неправилното съобщение.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-34": "За да избегнем отбелязването (или загубата!) на точки повече от веднъж, ще накараме бананите да се скрият, след като прилепът ги достигне.<br /><br />Добавете блок <b>скрий</b> след блока if… else - това означава, че бананите винаги ще се скрият, когато прилепът ги докосне.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-35": "Тъй като крием бананите, трябва да имаме начин да ги покажем отново.<br /><br />По-рано добавихме код за изпращане на съобщение за <b>покажи плодове</b> всеки път, когато прилепът откъсне нов плод. Ще използваме това като сигнал, за да покажем плода.<br /><br />Добавете тези блокове:<ul><li>Когато получа [покажи плод]</li><li>Покажи</li></ul><br />Сега, когато прилепът избере нов плод, бананите ще се покажат отново.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-36": "Добавете още един спрайт - този път спрайтът на Ябълка.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-37": "Преместете спрайта на ябълката, за да бъдете от другата страна на сцената.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-38": "Копирайте кода от бананите в спрайта на ябълката, като го плъзнете към спрайта на ябълката.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-39": "С избрания спрайт Ябълка, променете кода, така че да проверява дали променливата плод е равна на <b>ябълка</b> вместо това.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-40": "Опитайте!<br /><br />Натиснете зеления флаг, за да започнете, след това опитайте да съберете плода, за който прилепът си мисли!<br /><br />Натиснете червения знак за спиране, за да спрете кода, когато сте готови.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-41": "Нека добавим малко обратна връзка относно това дали получавате правилния плод.<br /><br />Изберете отново Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-42": "Добавете тези блокове:<ul><li>Когато получа [правилно]</li><li>Настройте [пръстените] светодиоди на [зелено]</li><li>Пуснете нота [C6] за [0,5] секунди</li><li>Изключете всички светодиоди</li></ul><br />И<br /><br /><ul><li>Настройте [пръстените] светодиоди на [червено]</li><li>Когато получа [неправилно]</li><li>Възпроизвеждане на нота [C4] за [0,5] секунди</li><li>Изключване на всички светодиоди</li></ul><br />Те ще използват правилните и неправилните съобщения, които сте кодирали преди за плодовете, и ще карат Cog да светва и да възпроизвежда звук, когато вземете плод.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-43": "Опитайте!<br /><br />Сега ще получавате обратна връзка от Cog, докато събирате плодове.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-44": "Браво!<br /><br />Научихте как да използвате костюми в Blocks за анимиране на спрайтове.<br /><br />Също така научихте как да съставите списък и да изберете елементи от него и да ги използвате като част от игра.<br /><br />Следващи стъпки:<ul><li>Можете ли да добавите още плодове?</li><li>Можете ли да добавите нещо, което прилепът никога не иска да яде?</li><li>Може ли правите играта да става по-трудна с течение на времето?</li><li>Можете ли да накарате Cog да покаже резултата в края?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.name": "Хронометър с интервален таймер",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.description": "Нека направим хронометър с таймер за обиколки!<br /><br />Това е специален хронометър, който ще следи толкова времена за обиколки, колкото искаме<br />Ще използваме списък, за да ги съхраняваме.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-1": "Нека направим хронометър с таймер за обиколки!<br /><br />Това е специален хронометър, който ще следи толкова времена за обиколки, колкото искаме<br />Ще използваме списък, за да ги съхраняваме.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-2": "Започнете, като направите списък, наречен <b>времена</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-3": "Добавете тези блокове:<br /><ul><li>Натискане на бутон</li><li>Добавяне на <b>таймер</b> към <b>времена</b></li><li>Нулиране на таймера</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-4": "Натиснете бутона на зъбното колело - всеки път, когато го натиснете, към списъка ще се добавя ново време!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-5": "Има обаче няколко проблема, първият път, когато добавихме, беше малко случаен, тъй като не бяхме настроили първо таймера.<br /><br />Също така нямаме начин да спрем таймера и да изчистим списъка с времена за обиколки.<br /><br />Нека поправим това!<br /><br />Добавете променлива, наречена <b>стартиран</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-6": "Ще накараме разклащането на Сog да спре работата на таймера.<br /><br />Добавете тези блокове:<br /><ul><li>При разклащане</li><li>Задайте <b>стартиран</b> на <b>невярно</b></li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-7": "Сега нека променим какво прави бутонът въз основа на състоянието на хронометъра - т.е. в зависимост от това дали е стартиран или не.<br /><br />Променете кода под блока <b>при натискане на бутон</b> да бъде:<br /><ul><li>При натискане на бутон</li><li>Ако <b>started</b> = <b>true</b> тогава</li><ul><li>Добавяне на <b>таймер</b> към <b>времена</b></li></ul><li>Иначе</li><ul><li>Изтриване на всички <b>времена</b></li></ul><li>Нулиране на таймера</li></ul><br />Така че, ако хронометърът е бил стартиран, времето за обиколка ще бъде добавено към списъка. Ако не, списъкът със стари времена ще бъде изчистен, готов за стартиране на нов списък.<br /><br />И в двата случая таймерът ще бъде нулиран, готов да запише следващото време за обиколка.<br /><br />Можете ли да забележите какво липсва в този код?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-8": "Браво, ако сте забелязали, че също трябва да настроим променливата <b>стартиран</b> на <b>вярно</b>, след като хронометърът е стартиран!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-9": "Разклатете Сog, за да нулирате всичко, след това натиснете бутона, за да стартирате таймера - това ще изчисти старите времена от списъка и ще нулира таймера.<br /><br />Всеки път, когато натиснете бутона след това, към списъка ще бъде добавено ново време!<br /><br />Ако разклатите Сog отново, след като последното време е било записано, ще го нулирате, така че следващото натискане на бутон да започне нов набор от времена.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-10": "Това работи добре като хронометър!<br /><br />Но за нашите потребители е малко трудно да разберат в какво състояние е хронометърът - стартиран ли е или е спрял?<br /><br />Нека добавим малко обратна връзка за това.<br /><br />В блоковете <b>при разклащане</b>, под блока <b>задаване стартиран на невярно</b>, добавете тези блокове:<br /><ul><li>Изключване всички светодиоди</li><li>Настройте светодиодите на <b>бутона</b> на <b>червено</b></li></ul><br />Сега всеки път, когато разклатите Сog, за да го нулирате, той ще спре каквото и да са правили светодиодите и просто ще освети бутона, показвайки, че е спрян и готов за стартиране.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-11": "Също така трябва да добавим обратна връзка, за да показваме кога бутонът е натиснат успешно и кога хронометърът работи.<br /><br />В края на блоковете за <b>натискане на бутон</b> добавете тези блокове:<br /><ul><li>Настройте светодиодите <b>ring</b> на <b>зелено</b></li><li>Пуснете нота <b>C6</b> за <b>0,5</b> секунди</li><li>Настройте <b>пръстен</b> светодиоди на <b>сини</b></li><li>Настройте <b>пръстен</b> светодиоди на шаблон <b>Завъртане1</b></li></ul><br />Сега всеки път, когато натиснете бутона, ще получавате потвърждаващ шум и светлината ще мига в зелено, преди да започнат да се въртят в синьо, за да покажат, че хронометърът работи.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-12": "Опитайте!<br /><br />Вече е много по-лесно да видите дали хронометърът е спрян или стартиран.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-13": "Можете ли обаче да забележите грешката в нашия код?<br /><br />Какво ще се случи, ако се опитате да запишете времена, по-малки от 0,5 секунди?<br /><br />Няма да можете - защото кодът от предишното натискане на бутон все още ще се изпълнява и ще възпроизвежда нотата.<br /><br />Как можем да поправим това, докато все още свирим нотата за 0,5 секунди?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-14": "Един от начините за коригиране на това е да използвате блока разпространи, за да изпратите съобщение за задействане на светлините и звука вместо това.<br /><br />Спомняте ли си как блокът разпространи и изчакай нямаше да завърши изпълнението си, докато целият код, който е задействал, не приключи? Блокът разпространи не прави това, така че веднага щом изпрати съобщението за натискане на бутона, ще завърши изпълнението.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-15": "Опитайте!<br /><br />Вече е много по-лесно да видите дали хронометърът е спрян или стартиран.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-16": "Страхотно, сега нашият хронометър работи доста добре!<br /><br />Често, когато правим обиколки, искаме да знаем средното си време. Нека накараме нашия хронометър да изчисли и това!<br /><br />Добавете две променливи, едната наречена <b>средна стойност</b> и една наречена <b>брояч</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-17": "Ще изчислим средната стойност, след като спрем хронометъра чрез разклащане на зъбно колело.<br /><br />Добавете тези блокове под блока <b>Задаване на светодиодите на бутоните в червено</b>:<br /><ul><li>Задаване на <b>средна стойност</b> на 0</li><li>Задаване на <b>брояч</b> на 0</li></ul><br />Това ще подготви променливите ни за изчисляване на средна стойност.<br /><br />Помислете ли сега как бихте изчислили средната стойност на списък с числа?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-18": "За да получите средната стойност, съберете всички числа в списъка и след това разделете на броя на елементите.<br /><br />Ще преминем през списъка с помощта на цикъл за повторение и ще съберем всички елементи.<br /><br />Добавете блок за повторение и задайте броя на повторенията на <b>дължина пъти</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-19": "Ще използваме променливата на брояча, за да следим къде се намираме в списъка, докато събираме всички времена.<br /><br />Вътре в цикъла за повторение добавете блок за <b>промяна на брояча с 1</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-20": "В блоковете първият елемент в списъка е елемент 1, така че при първия път през повторения цикъл променливата на брояча ще бъде променена от 0 на 1. При втория път през цикъла ще бъде променена на 2 и т.н.<br /><br />След това ще използваме този брояч, за да увеличим средната променлива със следващото число в списъка.<br /><br />Добавете блока <b>промени средната стойност с брояча на елементи на времената</b>.<br /><br />Когато цикълът на повторение приключи, той ще премине през всеки елемент в списъка и ще добави всяко число към средната променлива.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-21": "Добре, върви добре, но сега средната променлива всъщност съхранява сумата от всички наши времена.<br /><br />За да получим средната стойност, ще трябва да я разделим на броя на елементите в списъка.<br /><br />Добавете <b>зададена средна стойност към [средна стойност / брояч]</b> блок.<br /><br />Променливата на брояча в момента е настроена да преброи колко елемента са били в списъка, така че можем да я използваме като делителя, за да получите средната стойност.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-22": "Опитайте!<br /><br />Сега, когато разклатите Сog, променливата средна стойност ще бъде зададена на средната стойност от всички времена, които сте записали!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-23": "Браво!<br /><br />Направихте много изискан хронометър, който може да записва много времена на обиколки, да ви казва колко времена на обиколки е записал и дори да изчислява средната стойност за вас!<br /><br />За какво бихте могли да използвате таймера за обиколка?<br /><br />Можете ли да използвате светлините на зъбчатото колело, за да дадете повече обратна връзка, когато хронометърът работи? Може би показване на изминаващите секунди чрез включване на светодиодите на Cog?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.name": "Игра Викторина",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.description": "Нека направим игра викторина!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-1": "Нека направим игра викторина! <br/><br/>Ще поставим списък с въпроси и отговори и ще използваме зъбни колела като звуков сигнал за състезателите. <br/><br/>Тази дейност използва много Cogs, свързани към една програма. Ако е възможно, редувайте се, за да споделяте Cogs между малки групи и да стартирате програмата. <br/><br/>Ако имате достъп само до един Cog, помислете как бихте могли да промените кода, за да използвате инфрачервените сензори като звукови сигнали, за да позволите на трима души да играят на едно зъбно колело.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-2": "Нека започнем, като подготвим нещата за викторината. <br/><br/>Ще ни трябва спрайт, който да действа като хост - изберете любимия си от опциите, този пример ще използва рак, но можете да използвате всеки спрайт или да нарисувате свой собствен.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-3": "Ще трябва да направим три списъка - един за <i>въпроси</i>, един за <i>отговори</i> и един за проследяване на <i>резултатите</i> на състезателите. <br/><br/>Добавете три списъка, наречени въпроси, отговори и резултати.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-4": "Добавете тези блокове, за да попълните списъка с въпроси. <br/><ul><li>При щракване върху зеления флаг</li><li>Изтриване на всички от [въпроси]</li><li>Добавяне на [Какво е 2+2?] към [въпроси]</li></ul>Поставете толкова въпроси, колкото искате, като добавите още блокове <i>добавете [] към [въпроси]</i>. <br/><br/>След това направете същото с отговорите, като се уверите, че вашите въпроси съвпадат с вашите отговори.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-5": "Изпробвайте, като натиснете зеления флаг. <br/><br/>Списъците с въпроси и отговори ще се попълнят - отделете малко време, за да проверите дали всички отговори отговарят на правилните въпроси. <br/><br/>След като сте доволни, щракнете върху квадратчетата за отметка до списъците с отговори и въпроси, за да ги скриете.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-6": "Сега нека подготвим таблото с резултати. <br/><br/>Направете нова променлива, наречена <i>брой играчи</i>, и добавете тези блокове: <ul><li>При щракване върху зеления флаг</li><li>Задайте [брой играчи] на [2]</li><li>Изтрийте всички [резултати]</li><li>Повторете [брой играчи]</li><ul><li>Добавете [0] към резултатите</li></ul>Променете настройка за брой играчи на броя, който възнамерявате да имате - винаги можете да го промените отново по-късно.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-7": "Ще преминем през списъка с въпроси и ще накараме спрайта да зададе всеки от тях. <br/><br/>За да направим това, ще използваме повтарящ се цикъл. Добавете тези блокове: <ul><li>При щракване върху зеления флаг</li><li>Повтаряне [дължина на [въпроси]]</li></ul>Въпреки това има малък проблем - какво ще стане, ако кодът, който току-що изпълнихме, се изпълни, преди другият код да попълни списъка с въпроси? <br/><br/>Малко не е сигурно какво точно ще се случи - това е друг вид грешка и можем да кодираме нещата малко по-различно, за да гарантираме, че кодът работи в реда, който искаме.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-8": "Можем просто да добавим блок за изчакване преди повторения цикъл, но това не е много добре. <br/><br/>Можем също така да добавим целия код в една голяма дълга последователност, но това ще стане доста трудно за управление. <br/><br/>Алтернативно, можем да направим свои собствени блокове и да се уверим, че ги изпълняваме в реда, който желаем. <br/><br/>Щракнете върху бутона Създаване на блок.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-9": "Дайте заглавие на блока <i>Попълване на въпроси</i> и щракнете върху OK.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-10": "Нов блок ще се появи в блоковата палитра и в областта за кодиране ще видите шапка, озаглавена <i>дефиниране [попълване на въпроси]</i>. <br/><br/>Какъвто и код да поставим под този блок, ще се изпълнява всеки път, когато извикаме блока <i>Попълване на въпроси</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-11": "Заменете блока <i>При щракване върху зеления флаг</i> с новия блок <i>дефиниране [Попълване на въпроси]</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-12": "Поставете новия блок <i>Попълване на въпроси</i> преди цикъл повторение. <br/><br/>Сега знаем със сигурност, че списъкът с въпроси ще бъде попълнен, преди да оценим дължината му и да започнем да го преглеждаме.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-13": "Вътре в цикъла за повторение добавете тези блокове: <ul><li>Изречете [елемент [1] от [въпроси]] за [2] секунди</li><li>Разпространи [отговор сега]</li><li>Изтриване на [1] от [въпроси]</li><li>Изтриване на [1] от [отговори]</li></ul>След като всеки въпрос бъде зададен, той и отговорът му ще бъдат премахнати от техните списъци.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-14": "Опитайте - спрайтът ще прочете въпросите един по един. <br/><br/>Може да се наложи да преместите спрайта в долния ляв ъгъл на екрана, за да оставите повече място за въпросите.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-15": "Нека добавим начин да се включите и да отговорите на въпроса. <br/><br/>Изберете Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-16": "Създайте нова променлива, наречена <i>номер на играч</i>. <br/><br/>Този път не забравяйте да изберете опцията <i>Само за този спрайт</i>. <br/><br/>Тази нова променлива ще бъде това, което наричаме <b>локална променлива</b>, тя е достъпна само за този спрайт (или това зъбно колело, в този случай). <br/><br/>Ако се върнете към спрайта, променливата ще изчезне от списъка с променливи в блоковата палитра и ще се появи отново, когато изберете cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-17": "Добавете тези блокове: <ul><li>При щракване върху зеления флаг</li><li>Задайте [номер на играч] на [1]</li></ul>По-късно ще добавим още зъбни колела и ще зададем номерата на играчите им по различен начин.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-18": "Искаме да активираме звуковите сигнали само когато е зададен въпрос, така че ще използваме съобщението <i>отговори сега</i>, което беше излъчено, когато спрайтът зададе въпрос. <br/><br/>Добавете тези блокове: <ul><li>Когато получа [отговорете сега]</li><li>Задайте [пръстен] светодиоди на [синьо]</li><li>Настройте [пръстен] светодиоди на шаблон [Завъртане1]</li><li>Изчакайте, докато [[[бутон е щракнат] = [вярно]] или [[звънец] > [0]]]]</li></ul>Ще трябва да направите нова променлива наречена <b>звънец</b> - ще използваме това, за да проследим кой е натиснат първи. <br/><br/>Можете да намерите блока <i>или</i> в категорията Оператори. <br/><br/>Условието в блока за изчакване е или да се щракне върху бутона, или променливата на звънеца да е по-голяма от 0. <br/><br/>По този начин можем да изчакаме, докато се натисне бутонът на това зъбно колело или се натисне друг звънец и променливата на звънеца е зададена другаде.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-19": "Добавете тези блокове: <ul><li>Ако [[натиснат бутон] = [вярно]] тогава</li><ul><li>Задай [звънец] на [номер на играч]</li><li>Задай [пръстен] LEDs на [зелено]</li></ul>Иначе</li><ul><li>Изключи LEDs</li></ul></ul>С този код, ако бутонът на това зъбно колело е бил натиснат първи, ще зададем променливата <i>звънец</i> на този <i>номер на играч</i> и ще включим светлините в зелено. <br/><br/>В противен случай това ще означава, че някой друг е първи или времето ни е изтекло и вместо това просто ще изключим светлините.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-20": "Върнете се към спрайта, който сте добавили преди.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-21": "Променете кода, така че вътре в цикъла за повторение за въпросите да казва: <ul><li>Задайте [звънец] на [0]</li><li>Нулирайте таймера</li><li>Кажете [елемент [1] от [въпроси]</li><li>Разпространи [отговорете сега]</li><li>Изчакайте [[[звънец] > [0]] или [[таймер] > [10]]]</li><li>Изтрийте [1] от [въпроси]</li><li>Изтриване на [1] от [отговори]</li></ul>Използвахме друго <i>изчакайте до</i> с условие <i>или</i>. <br/><br/>Сега, всеки път след задаване на въпрос кодът ще изчака или да бъде зададена променливата на звънеца, или да изтекат 10 секунди.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-22": "Сега всеки път, когато бъде зададен въпрос, той ще премине към следващия или след 10 секунди, или веднага щом бъде натиснат звънец (бутона на зъбното колело). <br/><br/>Все още трябва да дадем шанс на нашия състезател действително да отговори на въпроса, преди да преминем към следващия. <br/><br/>Направете нов блок, наречен <i>проверете отговор</i> и го поставете след блока <i>изчакайте, докато</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-23": "Под блока <i>дефинирай [провери отговор]</i> добавете блок <i>ако… иначе</i> с условието <i>[звънец] > [0]</i>. <br/><br/>Това ще провери дали звънецът е бил натиснат навреме или не.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-24": "Ако звънецът бъде натиснат, ще дадем няколко секунди на човека, който го е натиснал, за да отговори на въпроса. <br/><br/>Добавете тези блокове в условието if: <ul><li>Разпространи [звън]</li><li>Кажете [присъединяване [Да, номер на играч] [звънец]] за [6] секунди</li></ul>Блокът <i>присъединяване</i> може да бъде намерен в категорията Оператори, той обединява две части текст.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-25": "Добавете и тези блокове: <ul><li>Кажете [присъединете се [присъединете се [Казахте ли] [елемент [1] от [отговори]] [? Натиснете зелено за да и червено за не]]</li><li>Излъчване [потвърдете отговора] и изчакайте</li></ul>Спомнете си как преди <i>вложихме ако</i> условия, можете също да <i>вложите оператори за присъединяване</i>, ако искате да обедините повече от два текстови низа. <br/><br/>И така, след като дадете 6 секунди на играча да каже отговора си, за да го чуят останалите състезатели, спрайтът ще ги попита дали са казали правилния отговор, взет от списъка с отговори. След това ще ги помоли да натиснат зелено за да и червено за не, да изпратят съобщението за <i>потвърждение на отговор</i> и да изчакат, преди да продължат.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-26": "Нека направим нещо със съобщението <i>потвърдете отговор</i>. <br/><br/>Изберете Cog отново.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-27": "Добавете тези блокове: <ul><li>Когато получа [потвърдете отговор]</li><li>Ако [[звънец] = [номер на играч] тогава</li></ul>. <br/><br/>По-късно ще имаме повече свързани Cog, които ще изпълняват този код. Това условие if ще провери дали това зъбно колело е било успешният звънец.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-28": "Добавете <i>задаване на светодиоди</i> с помощта на блока ColorPicker вътре в условието if и го настройте да показва червен светодиод до левия IR сензор за обект и зелен до десния IR сензор за обект.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-29": "Добавете тези блокове: <ul><li>Изчакайте, докато [[[усетено препятствие [вляво]] = [вярно]] или [[усетено препятствие [вдясно]] = [вярно]]]</li><li>Ако [[усетено препятствие [вдясно]] = [вярно]] тогава</li></ul>Заменете елемент [номер на играч] от [резултати] с [[елемент [1] от [резултати]] + [1]]<br/><br/>Иначе<br/><ul><li>Заменете елемент [номер на играч] от [резултати] с [[елемент [1] от [резултати]] - [1]]</li></ul>Изключете всички светодиоди. <br/><br/>Блокът <i>изчакайте</i> ще изчака, докато левият или десният IR сензор усетят обект - това е мястото, където чакаме играчът да избере дали е получил правилен или грешен отговор. <br/><br/>Ако са го направили правилно, ще са покрили правилния IR сензор, тъй като там поставихме зелена светлина. <br/><br/>Ако е така, ще заменим резултата им на таблото със същото число плюс 1. <br/><br/>Ако не, ще заменим резултата им на таблото със същото число минус 1. <br/><br/>По този начин ще увеличим техния резултат, ако отговорят правилно на въпроса, и ще го намалим, ако сбъркат. <br/><br/>Така че бъдете внимателни - ако звъннете, но не знаете отговора, ще загубите точки!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-30": "Трябва също да добавим обратно броене, така че играчът да знае колко време трябва да отговори. <br/><br/>Ще използваме съобщението <i>извънредно</i>, което настроихме преди, за да направим това. <br/><br/>Направете друга променлива, наречена <i>ledID</i>, и отново я направете <i>Само за този спрайт</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-31": "Добавете тези блокове: <ul><li>Когато получа [звънене]</li><li>Ако [[звънец] = [номер на играч]] тогава</li><ul><li>Задай [ledID] на [0]</li><li>Повтори [6]</li><ul><li>Задай LED [ledID] на [лилаво]</li><li>Задй LED [[ledID] + [1]] на [лилаво]</li><li>Изчакай [1] секунди</li><li>Промени [ledID] с [2]</li></ul></ul></ul>Сега по време на 6-те секунди, дадени на играча да отговори на въпроса, той ще види обратно броене на светодиодите на Сog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-32": "Опитайте! <br/><br/>Въпросите ще бъдат задавани един след друг. Ако звъннете, ще получите 6 секунди за отговор, докато Cog показва обратно броене, след което ще бъдете помолени да изберете червено или зелено в зависимост от това дали сте отговорили грешно или правилно.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-33": "Все още трябва да направим нещо, ако никой не иззвъни навреме за въпрос, и трябва да кажем кой е победителят в края. <br/><br/>Върнете се към спрайта.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-34": "В празното условие <i>иначе</i> в дефиницията <i>провери отговор</i> добавете тези блокове: <ul><li>Кажете [Твърде бавно!] за [2] секунди</li><li>Кажете [присъединете се [Отговорът беше] [елемент [1] от [отговори]] за [5] секунди</li></ul>По този начин, ако никой не иззвъни навреме, спрайтът ще прочете правилния отговор за всички.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-35": "Време е да добавим още зъбни колела, за да можем да имаме повече играчи!<br/><br/>Щракнете с десния бутон върху зъбното колело и изберете <i>дублиране</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-36": "Добавен е нов Cog (зъбно колело) със същия код като първия!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-37": "Освен кода, който ще бъде дублиран, <i>локалните</i> променливи, които направихме, също ще бъдат дублирани. <br/><br/>С избраното ново зъбно колело променете номера на играча на 2.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-38": "Свържете второ зъбно колело и го изпробвайте!<br/><br/>Зъбното колело, което избръмчи първо след зададен въпрос, ще има възможност да отговори<br/><br/>Можете да добавите повече играчи, като дублирате зъбното колело повече пъти!<br/><br/>Не забравяйте да актуализирате променливата <i>номер на играча</i> на всяко зъбно колело<br/><br/>Ще трябва също да зададете променливата за броя на играчите, за да съответства на <i>брой</i> играчи",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-39": "Добре!<br/><br/>Сега трябва да разберем кой е победителят в края на играта. <br/><br/>Върнете се към кода на спрайта <br/><br/>Направете друг блок, наречен <i>обявяване на победители</i>, и го извикайте след основния цикъл с въпроси",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-40": "Първо, ще разберем какъв е най-високият резултат. <br/><br/>Направете друг блок, наречен <i>намиране на максимален резултат</i>. <br/><br/> Под блока <i>дефинирай [намиране на максимален резултат]</i> добавете тези блокове:<ul><li>задайте [maxScore] на [елемент [1] от [резултати]]</li><li>задайте [playerID] на [1]</li><li>повторете [дължина на [резултати]]</li><ul>ако [[item [playerID] от [резултати]] > [maxScore]] след това</li><ul><li>задайте [maxScore] на [item [playerID] от [резултати]]</li><ul><li>променете [playerID] с [1]</li></ul></li></ul></li></ul><br/><br/> Ще трябва да направите променливите <i>maxScore</i> и <i>playerID</i>. <br/><br/>Този код ще <li>превърта</li> през таблото с резултати - преминава през него един по един запис - и ще зададе променливата <i>maxScore</i> на най-високия резултат, който намери по пътя.<br/><br/>Щракнете върху тази част от кода, за да го изпълните - променливата <i>maxScore</i> трябва да се окаже зададена на най-високата стойност в списъка с резултати",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-41": "След като знаем какъв е най-високият резултат, трябва да знаем колко играчи са получили този резултат. <br/><br/>Направете друг нов блок, наречен <i>колко играчи с резултат [резултат]</i> - можете да направите това, като натиснете бутона <i>Добавяне на входно число или текст</i> в прозореца Създаване на блок.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-42": "Добавете тези блокове към блока <i>дефинирайте [колко играчи с резултат [резултат]]</i>:<ul><li>задайте [резултат] на [0]</li><li>задайте [playerID] на [0]</li><li>повторете [дължина на [резултати]]</li><ul><li>променете [playerID] с [1]</li><li>ако [[елемент [playerID] от [резултати]] = [резултат]] след това</li><ul><li>промяна на [резултат] с [1]</li></ul></ul></ul>Този нов блок (или функция) е малко по-различен от тези, които направихме преди, защото приема параметър - резултата, който искаме да търсим. <br/><br/>Можете да плъзнете този параметър <i>резултат</i> надолу от дефиниращия блок, за да го използвате във вашия код. Това е като променлива, но може да се използва само в тази функция.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-43": "За да изпробвате това, опитайте да изпълните блока колко играчи с резултат [] с параметър за резултат, зададен на число, което е във вашия списък с резултати. Променливата за резултат ще бъде зададена на броя на играчите с този резултат.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-44": "Нека започнем да изграждаме функцията <i>обявяване на победители</i>, която създадохме по-рано. Добавете тези блокове към блока <i>дефиниране [обявяване на победители]</i>:<ul><li>Намерете максимален резултат</li><li>Колко играчи с резултат [maxScore]</li><li>Ако [[резултат] = [1] тогава</li><ul><li>Кажете [ присъединете се [Победителят, с резултат ] [maxScore]] за [5] секунди</li><li>Кажете [присъединете се [е играч ] [артикул # от [maxScore] в [резултати]]</li></ul></ul>Сега, когато това се изпълни, променливата <i>maxScore</i> ще бъде зададена на най-високия резултат от функцията <i>find max score</i>. След това променливата <i>result</i> ще бъде зададена на броя играчи с този резултат от блока <i>колко играчи с резултат [maxScore]</i>. Ако има само един победител, е много лесно да кажем кой е той - и можем да използваме <i>артикул # от [maxScore] в блока [резултати]</i>, за да търсим къде е този резултат в таблото с резултати. Но ако има равенство и има повече от един победител, нещата са малко по-сложни.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-45": "В частта <i>иначе</i> на блока <i>ако … иначе</i> добавете тези блокове<ul><li>Кажете [присъединете се [присъединете се [Има ] [резултат]] [ победители!]] за [5] секунди</li><li>Кажете [присъединете се [с резултат ] [максимален резултат]] за [5] секунди</li><li>Задайте [победители] на [присъединете се [Играч] [елемент # от [максимален резултат] в [резултати]]</li><li>Задайте [номер на играча] на [елемент # от [максимален резултат] в [резултати]</li><li>Повтаряйте, докато [[номер на играча] = [дължина на [резултати]]</li><li>Променете [номер на играча] с [1]</li><li>Ако [[елемент [номер на играча] от [резултати] = [максимален резултат]] след това</li><li>Задайте [победители] на [присъединете се [присъединете се към [победители] [ и играч]] [playerID]</li><li>Кажете [победители]</li></ul>Сега, ако има повече от един победител, спрайтът ще каже колко са и след това ще ги изброи. Променливите могат да съхраняват повече от просто числа - тук променливата <i>победители</i> е използва се за изграждане на текст, който изброява всички победители</br></br>Цикълът <i>повтаряй докато</i> преминава от първия резултат в списъка, който съответства на променливата <i>максимален резултат</i> до края. Всеки път, когато намери друг съвпадащ резултат, той добавя този играч към променливата <i>победители</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-46": "Опитайте! <br/> Сега в края на теста победителите ще бъдат изброени, дори ако има равенство!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-47": "Браво! Кодирахте игра, използвайки зъбните колела като звънци на състезателите!<br/><br/>Използвахте <b>списъци</b> за съхраняване на въпросите, отговорите и таблата с резултати<br/><br/>Използвахте <b>локални променливи</b>, така че всеки Cog да може да следи номера на своя играч поотделно.<br/><br/>Научихме как да използваме <b>функции</b> (правим свои собствени блокове), за да запазим нашия код чист и по-лесен за четене. Лесният за четене код е по-лесен за отстраняване на грешки – и разделянето на дълги сложни участъци от код на по-малки части се нарича <b>Функционално разлагане</b><br/><br/>Функциите също са супер полезни, когато може да искате да стартирате код повече от веднъж и не искате да го копирате и поставяте отново и отново<br/><br/>Също така научихте как функциите могат да имат параметри. Колко играчи с функция за резултат отнема резултат, за да се търси<br/><br/>Следващи стъпки<ul><li>Можете ли да добавите още въпроси и отговори (и може би още зъбни колела) към вашата викторина?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.name": "Проследяване на движение",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.description": "Нека направим инструмент за проследяване на движение!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-1": "Нека изградим инструмент за проследяване на движение с Cog!<br/><br/>Ще използваме акселерометъра, за да събираме данни за движението и след това ще го използваме, за да класифицираме всяка изминала минута като активна или не.<br/><br/>След това можем да покажем табло за физическа активност и да подканим потребителя да се движи, ако не е бил много активен.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-2": "Направете списък, наречен <i>ax</i><br/><br/>Ще използваме това, за да съхраняваме последните показания от оста x на акселерометъра",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-3": "Добавете тези блокове:<ul><li>При щракване върху зеления флаг</li><li>Задайте [numSamples] на [10]</li><li>Изтрийте всички от [ax]</li><li>Повторете [numSamples]</li><ul><li>Добавете [Акселерометър [X]] към [ax]</li></ul><li>Завинаги</li><ul><li>Задайте [sampleCounter] на [[[sampleCounter] mod [numSamples]] + [1]]</li><li>Заменете елемент [sampleCounter] от [ax] с [Aкселерометър [X]]</li><li>Изчакайте [0,1] секунди</li></ul></ul><br/>Ще трябва да създадете <i>numSamples</i> и <i>sampleCounter</i> променливи.<br/><br/>Какво мислите, че ще направи този код?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-4": "Изпробвайте!<br/><br/>Натиснете зеления флаг, за да изпълните кода, и след това преместете зъбното колело<br/><br/>Ще видите списъка ах да се актуализира на всеки 0,1 секунди с най-новото показание (или <i>проба</i>) от оста x на акселерометъра.<br/><br/>Всяка нова проба в списъка с ах замества най-старата и ние използваме <i>mod</i> оператор, за да гарантира, че променливата <i>sampleCounter</i> се върти от края на списъка обратно до началото му.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-5": "Нуждаем се от начин да определим дали данните, които сме събрали, показват дали зъбното колело се движи или не.<br/><br/>Един лесен начин да направим това е да видим колко се променя - движението трябва да означава ускорение, което акселерометърът ще измерва.<br/><br/>Ще направим нов блок, наречен <i>get range</i>, който ще разбере колко варират данните в списъка ах.<br/><br/>Добавете тези блокове:<ul><li>Дефинирайте [get range]</li><li>Set [rangeCounter] на [0]</li><li>Set [min] на [item [1] of [ax]]</li><li>Set [max] на [item [1] of [ax]]</li><li>Повторете [length of [ax]]</li><ul><li>Променете [rangeCounter] с [1]</li><li>Задайте [sample] на [item [rangeCounter] от [ax]]</li><li>Ако [[sample] < [min]] тогава</li><ul><li>Задайте [min] на [sample]</li></ul><li>Ако [[sample] > [max]] тогава</li><ul><li>Задайте [max] на [sample]</li></ul><li>Задайте [резултат] до [[max] - [min]]</li></ul></ul><br/>Тази функция вече ще обхожда целия списък с оси една извадка наведнъж и ще избира минималните и максималните стойности.<br/>Накрая ще зададе резултатната променлива на разликата между двете.<br/>Повече движение ще означава, че се записва по-голям диапазон от стойности.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-6": "Нека добавим блокове, за да интерпретираме този диапазон и да го класифицираме като движение или не.<br/><br/>Добавете тези блокове:<ul><li>При щракване върху зеления флаг</li><li>Задайте [движениеПраг] на [0,2]</li><li>Винаги</li><ul><li>Изчакайте [1] секунди</li><li>Получаване на диапазон</li><li>Ако [[резултат] > [движениеПраг]] след това</li><ul><li>Задайте [движениеЗасечено] на true</li></ul><li>Иначе</li><ul><li>Задайте [движениеЗасечено] на невярно</li></ul></ul></ul><br/>Тук сме дефинирали праг - стойност, с която сравняваме диапазона от проби на акселерометъра. Ако обхватът е по-висок от този праг, ще кажем, че сме открили движение, а ако не, тогава ще кажем, че не сме.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-7": "Изпробвайте!<br/>Сега веднъж на всяка секунда програмата ще преглежда списъка с проби от акселерометъра и ще определя дали смята, че е имало движение или не.<br/><br/>Тя взема 10-те отделни показания на акселерометъра (или проби) и изработва едно вярно или невярно откриване на движение.<br/><br/>Можем да променим променливите, които сме задали, за да коригираме това поведение.<br/><br/>Например, можем да променим <i>движениеПраг</i>, за да направим програмата повече или по-малко чувствителна към движенията.<br/><br/>Можем също така да променим <i>numSamples</i>, за да променяме колко дълго гледаме моментна снимка на движение всеки път. С 10 проби, взети на интервали от 0,1 секунди, търсим да видим дали е имало движение през последната 1 секунда, но ако увеличите <i>numSamples</i>, ще се провери за движение през по-дълъг прозорец.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-8": "Добре, създадохме програма, която ще се опита да определи, секунда по секунда, дали зъбното колело изобщо е било преместено.<br/><br/>Нека направим повече с тези данни!<br/><br/>Би било добре да определим дали смятаме, че една минута е била активна или не като цяло.<br/><br/>За да направите това, нека преброим броя на активните секунди във всяка минута.<br/><br/>Добавете нова променлива, наречена <i>активниСекундиПраг</i> и блок <i>set [активниСекундиПраг] на [30]</i> точно след блока <i>set [движениеПраг]</i> и преди вечния цикъл.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-9": "Добавете друга променлива, наречена активниСекунди<br/>Точно вътре в този цикъл <i>винаги</i> добавете блок <i>задай [активниСекунди] to [0]</i> и след това блок <i>повтаряй [60]</i>, който обгражда останалата част от кода в цикъла винаги.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-10": "Вътре в условния <i>if [[резултат] > [праг на движение] then</i> добавете блок <i>промени [активниСекунди] с [1]</i><br/>С този код ще броим колко секунди от всеки 60 смятаме за активни.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-11": "Направете нов списък, наречен активниМинути<br/>Точно след цикъла <i>повтаряй [60]</i> (но все още вътре в цикъла завинаги), добавете тези блокове:<ul><li>Ако [[активниСекунди] > [активниСекундиПраг]] тогава</li><ul><li>Добавете [вярно] към [активниМинути]</li></ul><li>Иначе</li><ul><li>Добавете [невярно] към [активниМинути]</li></ul></ul><br/>Сега, след всеки 60 секунди - т.е. веднъж на минута - ще сравняваме общия брой активни секунди в тази минута с променливата <i>активниСекундиПраг</i>, за да класифицираме дали смятаме, че тази минута като цяло е била активна или не.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-12": "Нека не забравяме да изчистим списъка <i>активниМинути</i> в началото на програмата!<br/>Добавете блок за <i>изтриване на всички [активниМинути]</i> след блока <i>задай [активниМинутиПраг]</i><br/>Винаги трябва да помните да нулирате всичките си променливи и списъци в началото на програмата - това се нарича инициализиране на вашите променливи и ако забравите да го направите, това е друго място, където могат да се появят грешки!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-13": "Изпробвайте!<br/><br/>Всеки път, когато се открие движение за повече от 30 секунди по време на всеки 60-секунден прозорец, тази минута ще бъде записана като вярна в списъка <i>активниМинути</i>.<br/><br/>В противен случай ще бъде записан <i>невярно</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-14": "Нека получим друга полезна информация, която да покажем на потребителя<br/>Създайте две нови променливи, наречени <i>общоАктивниСекунди</i> и <i>общоСекунди</i><br/>Инициализирайте и двете, като ги зададете на 0 в началото на програмата",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-15": "Мислите ли къде трябва да добавите блокове, за да увеличите тези нови променливи?<br/><br/>Едно потенциално място е както е показано тук, където <i>общоАктивниСекунди</i> се увеличава всеки път, когато <i>активниСекунди</i> се увеличава, а <i>общоСекунди</i> се увеличава при всяка итерация на цикъла <i>повтори [60]</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-16": "Опитайте!<br/>Сега програмата ще записва и дела на активните секунди.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-17": "Нека докладваме част от тази информация по по-удобен за потребителя начин.<br/><br/>Добавете блок <i>разпространи [статистически данни за доклада]</i> точно преди края на цикъла <i>винаги</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-18": "Добавете нов спрайт — можете да изберете всеки, който харесвате. В този пример сме избрали робот.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-19": "Добавете тези блокове:<ul><li>Когато получа [статистически данни за доклада]</li><li>Кажете [присъединете се [присъединете се [присъединете се [присъединете се [Били сте активни от ] [общоАктивниСекунди]] [ от ]] [общоСекунди]] [ секунди]] за [5] секунди</li><li>Кажете [присъединете се [присъединете се [Това е [кръг [[[общоАктивниСекунди]] / [общоСекунди]] * 100]]] [% от времето]] за [5] секунди</li></ul><br/>Веднъж в минута спрайтът ще казва на потребителя колко активен е бил и какво е това като процент от изминалото време.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-20": "Опитайте!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-21": "Добавете тези блокове:<ul><li>Задайте [минутиБрояч] на [0]</li><li>Задайте [общоАктивниМинути] на [0]</li><li>Повторете [дължина на [активниМинути]]</li><ul><li>Променете [минутиБрояч] с [1]</li><li>Ако [[елемент [минутиБрояч] от [активниМинути]] = [вярно]] тогава</li><ul><li>Променете [общоАктивниМинути] с [1]</li></ul></ul><li>Кажете [активниМинути [съедини [съедини [съедини [И] [общоАктивниМинути]] [ out of ]] [дължина на [активниМинути]]] [ минути]] за [5] секунди</li><li>Кажете [съедини [съедини [Това са] [[закръгли [[[общоАктивниМинути] / [дължина на [активниМинути]] * 100]]] [% от минутите]] за [5] секунди</li></ul><br/>Сега спрайтът също ще каже колко от минутите сме класифицирали като активни.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-22": "Опитайте!<br/><br/>Вероятно ще откриете, че двата отчетени процента се различават един от друг — това се дължи на двата различни начина, по които сме групирали и класифицирали данните.<br/><br/>Всеки път, когато някой програмира система за преобразуване на много индивидуални показания в по-опростени статистики, той трябва да вземе решения как да го направи — нашата работа като програмисти е да се опитаме да гарантираме, че обобщението е възможно най-точно и неподвеждащо.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-23": "Процентът активни секунди определено изглежда като по-точно обобщение на това колко активен е бил нашият потребител като цяло, но това не означава, че списъкът с активни минути не е полезен. Това е по-песимистична оценка на активността, но показва дали някой не се движи много.<br/><br/>Нека добавим нещо, което да подкани потребителя да се упражнява, ако не се е движил много през последните 5 минути.<br/><br/>Добавете тези блокове:<ul><li>Ако [[дължина на [activeMinutes]] > [4]], тогава</li><ul><li>Задайте [totalActiveMinutes] до [0]</li><li>Повторете [5]</li><ul><li>Ако [[item [minuteCounter] от [activeMinutes]] = [true]] тогава</li><ul><li>Променете [totalActiveMinutes] с [1]</li></ul><li>Променете [minuteCounter] с [-1]</li></ul><li>Ако [[totalActiveMinutes] = [0]] тогава</li><ul><li>Излъчване [signal user]</li><li>Кажете [Не сте се движили много през последните 5 минути]</li></ul></ul></ul><br/>След като прочете основните статистики, кодът ще провери дали има записани поне 5 минути в списъка с <i>активни минути</i>.<br/>Ако има са, ще се върне назад през 5-те най-скорошни минути в списъка и ще преброи колко от тях са били активни минути.<br/>Ако нито една от тях не е била, тогава ще бъде изпратено съобщението <i>signal user</i> и спрайтът ще уведоми потребителя, че не се е движил много.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-24": "Променете обратно към Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-25": "Добавете тези блокове:<ul><li>Когато получа [сигнал към потребителя]</li><li>Повторете [3]</li><ul><li>Задайте [пръстен] светодиоди на [червено]</li><li>Възпроизвеждане на нота [A5] за [0,5] секунди</li><li>Настройте [пръстен] светодиоди на [бял]</li><li>Изчакайте [0,5] секунди</li></ul><li>Изключете всички Светодиоди</li></ul><br/>Сега Cog също ще издава звуков сигнал и ще светва, за да уведоми потребителя, че трябва да се движи повече.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-26": "Изпробвайте!<br/>Сложете Cog в джоба си и оставете кода да работи, докато вършите друга работа или играете — вижте какво отчита.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-27": "Браво!<br/>Превърнахте зъбното колело във фитнес тракер!<br/>Той ще измерва колко сте активни и ще ви напомня да се движите, ако сте неподвижни твърде дълго.<br/><br/>В реалния живот да седите неподвижно за 5 минути e OK, но е важно да останете активни и да се движите редовно.<br/><br/>Колко време от деня според вас трябва да сте активни? И колко често?<br/><br/>Научихте как да събирате и анализирате данни и да ги класифицирате от голям набор от проби в просто вярно или невярно измерване на дейността. За всяка минута бяха направени 600 измервания от акселерометъра и ние намалихме всичко до една нота за това, дали тази минута е била активна или не.<br/><br/>Помислете за другия софтуер и системи, които вземат решения и класификации. Какви решения е трябвало да вземат програмистите, когато са ги проектирали, и какво може потенциално да се обърка?<br/><br/><b>Следващи стъпки<ul><li>Помислете дали бихте променили някои от различните прагове и други променливи, които контролират поведението на нашия инструмент за проследяване на фитнес.</li><li>Помислете какви други обобщени статистически данни бихте искали да докладва вашето устройство за проследяване на фитнес и как можете да изчислите тях.</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.name": "ML разпознаване на жестове",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.description": "Нека направим модел за разпознаване на жестове!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-1": "Нека използваме машинно обучение, за да разпознаваме конкретни движения с Cog!<br/><br/>Ще обучим модел, който разпознава жестове, и ще ги използваме в игра за памет, базирана на изучаване на магически заклинания!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-2": "Кликнете върху раздела <i>Машинно обучение</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-3": "Изберете иконата <i>+</i> и щракнете върху опцията <i>Нов модел на акселерометър</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-4": "Натиснете <i>Продължи</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-5": "Данните, които ще използваме, за да обучим този модел, ще бъдат трите оси на акселерометъра. <br/><br/> Можете да видите тези данни в реално време на този екран, точно както в таблото на сензора",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-6": "Въведете име на модел на <i>жест</i> и след това поставете думата <i>нищо</i> в полето Създай Нов Клас<br/>Натиснете бутона +, за да създадете този нов клас",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-7": "Това ще създаде клас, наречен <i>нищо</i>. <br/>Ще имаме един клас за всеки тип движение, което искаме да открием - и това също означава да имаме основен случай на липса на движение.<br/><br/>Сега трябва да съберем данни за обучение за класа <i>нищо</i>. Можете да събирате проби от данни за модели на акселерометри като този, като задържите бутона на Cog.<br/><br/>Вземете Cog, задръжте го стабилно и след това натиснете бутона за няколко секунди.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-8": "Завъртете зъбното колело в различна позиция, задръжте го стабилно и след това натиснете бутона отново за няколко секунди, за да вземете нова проба<br/>Повторете това с различни позиции, докато получите 10-20 проби",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-9": "Сега създайте друг клас, наречен <i>плавно замахване</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-10": "Този път искате да запишете примери за бавно странично движение – наляво и надясно<br/>Местете зъбното колело внимателно напред-назад и задръжте бутона натиснат за всяко отделно движение – пускайте, след като движението приключи.<br/>Надяваме се движението, което записвате тук, да бъде разпознато по-късно и класифицирано като плавно замахване.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-11": "Отново се уверете, че имате поне 10 проби",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-12": "Сега създайте друг клас, наречен <i>рязко замахване</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-13": "Това ще бъде кратко, рязко движение.<br/>Отново записвайте проби, като натискате бутона достатъчно дълго, за да заснемете едно движение.<br/>Опитайте се да получите примери за различни завършващи позиции, за да сте сигурни, че е представително за движенията, които искате да откриете по-късно",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-14": "Уверете се, че отново имате поне 10 проби.<br/>Вероятно ще видите, че за класа <i>нищо</i> линиите на отделните проби са доста равни. В <i>плавно замахване</i> има една, която прави голяма крива надолу и нагоре.<br/>И линиите за <i>рязко замахване</i> са много по-назъбени - ако видите тези проби, вероятно ще можете да ги класифицирате в един от нашите три етикета - <i>нищо</i>, <i>плавно замахване</i> и <i>рязко замахване</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-15": "Добре, да видим дали можем да накараме компютъра да направи това!<br/>Щракнете върху бутона <i>Трениране</i>. Това ще разгледа всички етикетирани данни за обучение и ще се опита да изгради модел, който може да класифицира новите данни, когато постъпват",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-16": "Ще видите известие за графика на загубата при зареждане и след това ще се появи графика.<br/>Графиката на загубата показва колко добре се справя моделът от стъпка на стъпка, докато многократно се опитва да класифицира данните за обучение. Всяка итерация на обучение се нарича <i>епоха</i> - това е, което е на оста x на диаграмата на загубите.<br/>Стръмен градиент надолу в диаграмата на загубите означава, че моделът се променя много всяка епоха и става по-добър в класифицирането на данните.<br/>Обучението ще приключи, когато нивото на загуба вече не се променя много.<br/>Ниска загуба означава, че е успял да класифицира точно повечето от данните за обучението, които сме му предоставили - така че искаме крайната сума на загубата да е ниска",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-17": "Сега натиснете бутона <i>Изпълни</i>, за да опитате да стартирате модела върху нови данни.<br/>След това преместете Cog наоколо - опитайте да направите двете движения, на които сте го обучили, и вижте дали може да ги разпознае.<br/>Трите процентни ленти представляват нивото на увереност на модела в неговата класификация",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-18": "Може да откриете, че понякога движенията се класифицират погрешно - или например, че е лесно <i>плавно замахване</i> да бъде разпознат неправилно точно преди <i>рязко замахване</i>.<br/>За да поправим това, можем да опитаме да добавим още данни за обучение.<br/>Щракнете върху класа, към който искате да добавите проби, и след това запишете още.<br/>Ако има такива, които смятате, че сте объркали, щракнете върху индивидуалните проби, за да ги изтриете",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-19": "След като сте доволни, натиснете <i>Обучение</i>, за да обучите модела отново.<br/>След това <i>Стартирайте</i> и вижте дали сте доволни от представянето.<br/>Все още има проблеми с модела, който открива <i>плавно замахване</i> преди всяко <i>рязко замахване</i>, когато няма такова. За да се опитаме да поправим това, ще добавим някои примери към класа <i>нищо</i> за въртене на Cog от хоризонтално към вертикално вид движение, преди движение, което е погрешно категоризирано като плавно замахване",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-20": "Вашият модел ще бъде добре обучен, когато всяко засичане е отчетливо и ясно – като тук, където преминава направо от <i>нищо → плавно замахване</i> и обратно, и същото за <i>нищо → рязко замахване</i> и обратно.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-21": "След като сте доволни, щракнете върху бутона <i>Запазване</i>.<br/><b>Няма да можете да правите промени или да добавяте повече проби към този модел, след като щракнете върху запазване.</b><br/>Това е така, защото оригиналните данни за обучение вече не са необходими и затова се изтриват",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-22": "Добре, след като вашият модел е запазен, вие сте готови да го използвате в програма!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-23": "Върнете се в раздела <i>Код</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-24": "Отидете в категорията <i>ML</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-25": "Поставете отметка в квадратчето до блока <i>етикет на акселерометър</i>.<br/>След като започнем класификацията, тя ще ни покаже какво открива моделът",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-26": "Добавете тези блокове:<ul><li>При щракване върху зеления флаг</li><li>Зареждане на модела на машинно обучение [жест]</li><li>Етикет веднъж на всеки [1] секунди</li><li>Задаване на праг на достоверност [0,5]</li></ul><br/>Това ще стартира модела на <i>жест</i>, който обучихме. Той ще актуализира своята класификация за това какво движение смята, че се случва на всяка 1 секунда.<br/><br/>Спомняте ли си преди, когато тествахме модела, видяхме процентни ленти за това колко уверен е той в откриванията? <i>Прагът на достоверност</i> задава праг за това колко сигурен трябва да бъде моделът, преди да даде класификация.<br/>Засега ще го оставим на 0,5 (или 50%), но може да се наложи да го увеличим по-късно, ако моделът дава фалшиви класификации",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-27": "Изпробвайте!<br/>Натиснете зеления флаг и моделът ще започне да работи и класифицира движението.<br/>Изпробвайте вашите <i>махване</i> и <i>щракване</i> движения и трябва да видите, че са засечени!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-28": "Добавете тези блокове:<ul><li>При получаване на етикета на акселерометъра [махване]</li><li>Задай [пръстен] светодиодите на [зелено]</li><li>Разпространи [махване] и изчакай</li><li>Изчакай [1] секунди</li><li>Изключи всички светодиоди</li></ul><p>И</p><ul><li>Когато получите етикета на акселерометъра [щракване]</li><li>Задай [пръстен] светодиоди на [червено]</li><li>Разпространи [щракване] и изчакай</li><li>Изчакай [1] секунди</li><li>Изключи всички светодиоди</li></ul><br/>Сега Cog ще реагира, като покаже светлини, и ще разпространим съобщение, когато бъде открито плавно замахване или рязко замахване.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-29": "Опитайте!<br/>Сега, когато правите движенията, Cog ще светне",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-30": "Добре, нека направим игра на памет с помощта на детектора за движение!<br/>Добавете спрайт <i>Вещица</i> и го преместете в долния ляв ъгъл",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-31": "Сега изберете <i>Сцена</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-32": "И отидете в раздела <i>Костюми</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-33": "Добавете текст, който казва „Научете се да правите заклинания“.<br/>Това ще бъде заглавният екран за играта.<br/>Можете също да добавите друга украса, ако желаете - като тук, където добавихме лилав трапец и бяло очертание около текста",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-34": "Ще добавим още няколко фона, които да използваме в играта.<br/>Натиснете бутона <i>Избор на фон</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-35": "Изберете фона на <i>Замък 3</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-36": "Добавете също <i>Замък 2</i> и <i>Къща на вещица</i>, така че да имате общо четири фона.<br/>Преименувайте първия на <i>заглавен екран</i>, за да можем лесно да го идентифицираме",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-37": "Върнете се в раздела с кода, докато сцената е все още избрана.<br/><br/>Добавете тези блокове:<ul><li>При щракване върху зеления флаг</li><li>Превключване на фона към [заглавен екран]</li><li>Изчакайте [2] секунди</li><li>Превключване на фона към [Замък 3]</li></ul><br/>Сега, когато играта започне, играчът ще покаже заглавния екран за 2 секунди, преди да превключи на Замък 3 - вътрешността на замъка",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-38": "Ще добавим кратък урок към играта и ще накараме играча да потвърди, че може да прави движенията плавно замахване и рязко замахване.<br/>Ще направим тези движения необходими за напредване през фоновете.<br/><br/>Добавете тези блокове:<ul><li>Когато получа [плавно замахване]</li><li>Ако [[фон [име]] = [Замък 3]] след това<ul><li>Повторете [50]<ul><li>Променете ефекта [рибешко око] с [10]</li><li>Променете ефекта [вихър] с [-10]</li></ul></li><li>Превключете фона към [Замък 2]</li><li>Повторете [50]<ul><li>Променете ефекта [рибешко око] с [-10]</li><li>Променете [вихър] ефект от [10]</li></ul></li></ul></li></ul><br/>Така че сега, когато играчът направи въртящо се движение, докато вещицата е вътре в замъка, това ще направи фантастичен преход към фона на Castle 2",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-39": "Имаме нужда от един и за движението рязко замахване.<br/><br/>Добавете тези блокове:<ul><li>Когато получа [рязко замахване]</li><li>Ако [[фон [име]] = [Замък 2]] тогава<ul><li>Повторете [50]<ul><li>Променете ефекта [рибешко око] с [10]</li><li>Променете ефекта [вихър] с [-10]</li></ul></li><li>Превключване на фона към [Къща на вещица]</li><li>Повторение [50]<ul><li>Промяна на ефекта [рибешко око] с [-10]</li><li>Промяна на ефекта [вихър] с [10]</li></ul></li><li>Разпространи [старт на играта]</li></ul></li></ul><br/>По-бързо е да щракнете с десния бутон и да дублирате този код, просто внимавайте да го промените на правилните места и да добавите блока разпространи!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-40": "Сега изберете спрайта <i>Вещица</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-41": "Трябва да добавим някои инструкции към стъпките на урока.<br/><br/>Добавете тези блокове:<ul><li>Когато фонът превключи на [Замък 3]</li><li>Изчакайте [2] секунди</li><li>Кажете [Време е да напуснем замъка] за [2] секунди</li><li>Кажете [Плавно замахване с вълшебната пръчица, за да се пренесем отвън]</li></ul><p>И</p><ul><li>Когато фонът превключи на [Замък 2]</li><li>Изчакайте [2] секунди</li><li>Кажете [Да отидем в дома ми за практика на заклинания] за [2] секунди</li><li>Кажете [Рязко замахване с вълшебната пръчица, за да се пренесем там]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-42": "Добре, нека да го изпробваме!<br/>За да стартирате ML модела, ще трябва да изберете отново Cog и да стартирате програмата с избран Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-43": "Когато сте избрали Cog, натиснете зеления флаг, за да изпълните кода!<br/>Ще трябва да направите <i>плавно замахване</i> и <i>рязко замахване</i>, за да помогнете на вещицата да пътува магически от замъка до гората и след това от гората до къщата си",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-44": "С вещицата в нейната къща, нека да започнем играта правилно.<br/>Това ще бъде игра за памет, при която вещицата ще прочете поредица от жестове и играчът ще трябва да ги запомни и да ги направи в правилен ред.<br/>Изберете отново спрайта <i>Вещица</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-45": "Добавете тези блокове:<ul><li>Когато получа [старт игра]</li><li>Изтриване на всички [жестове]</li><li>Add [плавно замахване] към [жестове]</li><li>Add [рязко замахване] към [жестове]</li><li>Задай [животи] to [3]</li><li>Задай [поредицаДължина] to [2]</li></ul><br/>Ще трябва да направете списък, наречен <i>жестове</i>, и променливи, наречени <i>животи</i> и <i>поредицаДължина</i>.<br/>Списъкът с жестове ще изброява всички възможни движения, които можем да направим - ако искате да разширите играта с повече движения, можете да ги добавите и тук, след като сте обучили модел върху тях.<br/>Ще дадем на нашия играч 3 живота като начало и те ще губят по един всеки път, когато получат нещо не е наред.<br/>И ще започнем с поредица от 2 движения",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-46": "Създайте нов блок, наречен <i>направете поредица от [дължина] жестове</i>.<br/>Ще трябва да използвате и двете опции <i>Добавяне на входно число или текст</i> и <i>Добавяне на етикет</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-47": "Добавете тези блокове:<ul><li>Дефинирайте [направете последователност от [дължина] жестове]<ul><li>Изтрийте всички от [последователност]</li><li>Повторете [дължина]<ul><li>Добавете [елемент [изберете произволно [1] към [дължина на [жестове]]] от [жестове]] към [последователност]</li></ul></li></ul></li></ul><br/>Ще трябва да направите друг списък, наречен <i>последователност</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-48": "Сега добавете блока <i>направете последователност от [последователностДължина] жестове</i>.<br/>Функцията за създаване на последователност ще приеме стойността на променливата <i>последователностДължина</i> като аргумент за своя параметър <i>дължина</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-49": "Добавете тези блокове:<ul><li>Когато получа [рязко замахване]</li><li>Добавяне на [рязко замахване] към [въвеждане от потребител]</li></ul><p>И</p><ul><li>Когато получа [плавно замахване]</li><li>Добавяне на [плавно замахване] към [въвеждане от потребител]</li></ul><br/>Ще трябва да направите друг списък, наречен <i>въвеждане от потребител</i>.<br/>Това е мястото, където ще следим движенията, които играчът е направил, за да можем да ги сравним с тези, които е трябвало да направи",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-50": "Добавете тези блокове след блока <i>направете поредица от [дължина на последователност] жестове</i>:<ul><li>Кажете [Ще прочета някои жестове] за [2] секунди</li><li>Кажете [Трябва да ги направите в същия ред] за [2] секунди</li><li>Кажете [Готови?!] за [2] секунди</li><li>Повторете [10]<ul><li>Кажете [последователност] за [2] секунди</li></ul></li><li>Изтриване на всички [въведени от потребителя]</li><li>Изчакайте, докато [[дължина на [въведена от потребителя]] = [дължина на [последователност]]]</li><li>Ако [[въведена от потребителя] = [последователност]] тогава<ul><li>Кажете [Браво!] за [2] секунди</li><li>Кажете [Нека го направим по-сложно] за [2] секунди</li><li>Променете [дължина на последователност] с [1]</li><li>Направете поредица от [дължина на последователност] жестове</li></ul></li><li>Иначе<ul><li>Ако [[животи] > [0]] тогава<ul><li>Кажете [Oops! Не съвсем] за [2] секунди</li><li>Кажете [Опитайте отново…] за [2] секунди</li><li>Промяна на [животи] с [-1]</li></ul></li><li>Иначе<ul><li>Завършете играта</li></ul></li></ul></li></ul><br/>Ще трябва да направите нов блок, наречен <i>завършете играта</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-51": "Добавете тези блокове, за да дефинирате функцията за финал на играта:<ul><li>Дефинирайте [финал на играта]<ul><li>Кажете [Това е достатъчно засега. Браво!] за [2] секунди</li><li>Кажете [присъединете се [присъединете се [Научихте заклинание с] [[дължина на последователност] - [1]]] [жестове]] за [10] секунди</li><li>Спрете [всички]</li></ul></li></ul><br/>Сега, когато играчът изчерпи животите си, ще му бъде съобщен резултатът - колко дълга последователност от движения е успял да запамети и изпълни",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-52": "Изберете Cog отново и го изпробвайте!<br/>Все още можете да направите играта на цял екран, преди да я стартирате, за да можете по-лесно да видите какво казва Вещицата",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-53": "Браво!<br/>Научихте за машинното обучение и <b>обучихте</b> модел да <b>класифицира</b> жестове от данни за движение.<br/>Успяхте да съберете много <b>проби</b> за обучение на модела и да го тествате, преди да го запазите и използвате в кода си.<br/>След това използвахте функции и списъци, за да направите игра за памет!<br/><br/><b>Следващи стъпки</b><br/>• Бихте ли добавили трети жест в играта?<br/>• Експериментирайте с коригиране на параметрите на машинното обучение - прага на доверие и честотата на етикетиране.<br/>• Направете по-добър край на играта, ако играчът е в състояние да запомни наистина много дълги поредици от ходове",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.description": "Научете как програмистите използват променливи и цикли, за да обогатят своя код!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-1": "В този урок ще научим как програмистите използват <b/>променливи</b>, за да заредят своя код!<br /><br />Променливите са наистина важни в програмирането. Те помагат на компютрите да <b/>запомнят и манипулират</b> данните, така че да можем да изпълняваме по-сложни задачи с по-малко редове код.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-2": "Представете си променливата като етикетирана кутия за съхранение. Променливата има три части: име, тип и стойност.<br /><br /> <b/>Име</b> ни казва <i/>\"как да наречем тази кутия?\"</i> <br /> <b/>тип</b> ни казва <i/>\"какво нещо съхраняваме в тази кутия?\"</i><br /> <b/>Стойността</b> ни казва <i/>\"какво точно съхраняваме в момента в кутията?\"</i> <br /><br /> В това упражнение ще създадем и използваме променлива, наречена <b/>моят брояч</b>, за да помогнем на Марти да брои до десет!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-3": "Първо нека направим нашата променлива <b/>моят брояч</b>.<br /><br />Изберете „Създаване на променлива“ и я наречете <b/>моят брояч</b>. Щракнете върху „ok“ и вижте как променливата ни изскача в горния ляв ъгъл с текуща стойност 0",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-4": "За да кодираме с нашата променлива <b/>моят брояч</b>, можем да я плъзнем от категорията Променливи в областта за скриптове.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-5": "Нека накараме Марти да прочете нашата променлива!<br /><br />Изберете блока „Марти говори“ и заменете „здравей“ с променливата <b/>моят брояч</b>, както по-долу. Кликнете върху този блок и трябва да чуете вашия Марти да казва „нула“.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-6": "Ако искаме Марти да брои от 0 до 10, трябва да поставим +1 на <b/>моят брояч</b>, преди всеки път да кажем на Марти да каже число.<br /><br />В променливите можем да изберем блока <b/>промени моя брояч с 1</b>, който ще постави +1 на <b/>моя брояч</b>.<br /><br />Поставете това преди „Марти говори“, както е показано по-долу. Кликнете върху тези блокове и чуйте Марти да казва \"едно\"!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-7": "Щракнете отново върху кодовия блок и Марти казва „две“. <br/><br/>Щракнете върху кодовия блок, докато Марти преброи от 1 до 10!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-8": "Хм... Ами ако искаме да броим отново до десет? Трябва да нулираме <b/>моя брояч</b> на нула!  <br /><br />Изберете „задаване на моя брояч на 0“ в областта за скриптове, щракнете върху него и <b/>моят брояч</b> трябва да се нулира на 0.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-9": "Нека опитаме допълнително предизвикателство - какво ще стане, ако искаме да накараме Марти да брои от 0 до 10 само като щракне върху бутона със зелен флаг?<br /><br /> Ще трябва Марти да повтори нашия код много пъти, докато стигне до десет.\n<br /><br /> Можем да контролираме това с помощта на блок <b/>повтаряй докато</b> - поставете нашия съществуващ код вътре в него по следния начин:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-10": "Искаме да повторим този процес, докато <b/>моят брояч</b> стане по-голям от 10.<br /><br /> Изберете блока повече от. Поставете го в диаманта на <b/>повтаряй докато</b> и променете 50 на 10.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-11": "Нека завършим оператора<b/>повтаряй докато</b>.<br /><br /> Искаме да продължим цикъла, докато моят брояч стане по-голям от десет.<br /><br /> Придвижете се до Променливи и попълнете повтори с <b/>моят брояч</b> точно така:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-12": "Върнете се към стъпка 8, искаме да настроим <b/>моя брояч</b> на нула, всеки път, когато започваме да броим. <br /><br /> Плъзнете блока <b/>задай моят брояч на 0</b> и го поставете преди блока повтори по този начин.<br /><br /> Сега Марти винаги ще започва от 0.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-13": "Страхотна работа! Почти сте готови!<br/><br/>Накрая добавете блок <b/>при щракване върху зеления флаг</b> в горната част на кода, за да го завършите.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-14": "Успяхте! Вече знаете как да използвате променливи, да ги манипулирате и да направите <b/> ​​итеративен цикъл </b>, за да помогнете на Марти да брои до десет!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.description": "Научете как компютрите контролират кода, който се случва едновременно!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-1": "В този урок ще научим как програмистите използват <b/>паралелни програми, състезателно състояние и взаимно изключване</b>, за да контролират реда, в който се изпълняват части от код!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-2": "Паралелните програми са отделни части от код, които искаме от компютъра да изпълнява едновременно.<br/><br/>Точно като хората, има някои неща, които компютрите и Marty не могат да правят едновременно.<br/><br/>Например, <b/>хората не могат да вървят напред и назад едновременно – както и Марти!</b><br/><br/>Опитвайки се да направим това, създаваме това, което наричаме <b/>състезателно състояние</b>, при което нашата програма всъщност не може да изпълни целия ни паралелен код наведнъж.<br/><br/>Това може да причини непредсказуемо поведение - лоша новина за програмистите!<br/><br/><br/><i/>Щракнете върху изображението, за да разширите диаграмата.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-3": "И така, как програмистите си връщат контрола, когато се появи състезателно състояние? <br/><br/> Те използват <b/>взаимно изключване</b>, за да кажат неща като <i/>не върви назад, докато не тръгна напред.</i> <br/><br/> Взаимното изключване може да се приложи с помощта на много различни методи, като оператори if, блокове за изчакване, контрол на променливи и много други!<br/><br/><br/><i/>Щракнете върху изображението, за да разширите диаграмата.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-4": "За да демонстрираме състезателно състояние, ще помолим Марти да върви напред и назад едновременно.<br/><br/>Първо ще напишем нашия код за „ходене напред“.<br/><br/> Изберете блок <b/>при щракване върху зеления флаг</b> и го плъзнете в областта за скриптове.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-5": "Поставете блок <b/>ходете 2 стъпки напред</b> след блока със зелен флаг.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-6": "Изберете втори блок <b/>при щракване върху зеления флаг</b> и го плъзнете в областта за скриптове, за да създадете паралелен код за ходене назад.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-7": "Накрая добавете блок <b/>ходи назад</b>, за да завършите паралелния код.<br/><br/>Сега, може ли Марти да върви напред и назад едновременно? <b/>Не!</b> Създадохме състезателно състояние.<br/><br/><i/>Щракнете върху зеления флаг и вижте какво ще направи Марти първо...</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-8": "Забелязахте ли, че Марти тръгна <b/>първо напред, а след това назад?</b> Нека проучим защо.<br/><br/>Първо изтрийте целия си код, за да имаме празен лист.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-9": "Сега ще пресъздадем нашия паралелен код, но първо направете <b/>ходи назад</b> код.<br/><br/> Създайте отново кода, показан на изображението по-долу.<br/><br/><i/>Ако имате нужда от помощ, просто прескочете обратно към стъпки 6 и 7!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-10": "Сега нека пресъздадем и нашия <b/>ходи напред</b> код. Вашият паралелен код трябва да изглежда така: <br/><br/><i/>Ако имате нужда от помощ, просто прескочете обратно към стъпки 4 и 5!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-11": "Щракнете върху зеления флаг и вижте какво прави Марти сега... <b/>той ходи първо назад!</b><br/><br/> Това е така, защото софтуерът на Марти обработва състезателното състояние, като осъществява достъп и първо изпълнява <b/>най-стария</b> код.<br/><br/>Проблемът е, че не можем просто като гледаме да разберем кой код е създаден първи, а когато пишем по-сложен код, нещата могат да се объркат!<br/><br/>Нека проучим как можем да използваме <b/>изчакващи функции и променливи</b>, за да контролираме нашия паралелен код!<br/><br/><br/><i/>Щракнете върху изображението, за да разгънете диаграмата.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-12": "Както научихме преди, програмистите заобикалят състезателното състояние, като използват взаимно изключване.   <br/><br/>Това означава, че можем да натиснем \"go\" и на двата фрагмента код едновременно, но можем да контролираме какво действие <b/>всъщност</b> да се случи първо.   <br/><br/>Първо, ще използваме блок за изчакване, за да изключим взаимно нашия код.   <br/><br/><br/><i/>Щракнете върху изображението, за да разгънете диаграмата.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-13": "Нека кажем на Марти да върви напред, после назад.   <br/><br/>На Марти са необходими около 3 секунди, за да върви напред, така че ще поставим блок за изчакване преди „ходене назад“ и ще променим параметъра на 3 секунди, съответстващ на примерния код по-долу.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-14": "Щракнете върху зеления флаг и вижте как Марти върви първо напред, точно както искахме!   <br/><br/>Знаем, че използването на блокове за изчакване може да ни помогне с взаимното изключване, но за по-дълъг и по-сложен код те не са толкова добри.   <br/><br/>Продължителността на изпълнението на кода може да бъде различна и сложна, което затруднява точното прогнозиране на времето за изчакване.   <br/><br/>Нека да разгледаме използването на <b/>контрол на променливи</b> за по-точен метод за взаимно изключване.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-15": "Ще използваме променлива, наречена „следващ ход“, за да изключим взаимно нашия код „ходене назад“ и „ходене напред“.  <br/><br/>Въпреки че и двата блока код ще се изпълняват, когато щракнем върху зеления флаг, можем да кажем: <br/><br/>Всъщност <i/>не</i> правете крачка напред<b/> до следващото движение = напред.</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-16": "Създайте променлива, наречена следващ ход. Ще използваме това, за да контролираме следващия ход на Марти.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-17": "Премахнете блока за изчакване, който добавихме по-рано, така че вашият код да съответства на примера по-долу. <br/><br/>Сега сте готови да приложите управление чрез променливи!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-18": "Вместо да чака няколко секунди, преди да тръгне, искаме Марти да <b/>изчака, докато</b> следващият ход бъде зададен на правилната стойност: напред или назад.   <br/><br/>Добавете блок за изчакване преди всеки блок за ходене, както е показано тук:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-19": "Искаме Марти да <b/>изчака до</b> следващия ход=напред или следващия ход=назад, за да направи съответното движение.   <br/><br/>Изберете два <b/>оператора за равенство</b> и ги попълнете, както е показано по-долу.   <br/><br/>Можете да получите два блока за следващ ход от оранжевия раздел Променливи.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-20": "Сега използвайте зелените блокове за равенство, за да попълните празните блокове <b/>изчакай докато</b>, така че да съответстват на примерния код по-долу:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-21": "Ако искаме Марти да върви първо напред, той трябва след това да върви назад и обратно.<br/><br/>Така че искаме да използваме зададения блок <b/>следващ ход</b>, за да променим следващия ход, след като вървим.<br/><br/>Поставете два от тези блокове в края на всяка част от кода и въведете „напред“ или „назад“ във всеки един, за да съответства на примерния код по-долу:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-22": "Накрая изберете <b/>задаване на следващ ход към</b> блок, за да зададете дали искаме Марти да върви първо напред или назад.<br/><br/> Да кажем, че искаме Марти да върви първо назад – въведете „назад“ в пространството за параметри и щракнете върху блока, така че следващият ход да е зададен на назад.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-23": "Успяхте! Вече можете да използвате <b/>контрол на променливи</b> и функции за изчакване, за да изключите взаимно паралелния код!<br/> Щракнете върху зеления флаг и гледайте как вашият паралелен код работи заедно.<br/><br/>И двата кодови блока се изпълняват едновременно, но вашата променлива „следващ ход“ гарантира, че винаги знаете какво следва!<br/><br/><i/>За допълнително предизвикателство, защо не опитате да промените следващия ход на „напред“ (или дори нещо произволно като \"банан\") и вижте как Марти ходи сега...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.description": "Нека използваме паралелно програмиране с управление чрез променливи, за да помогнем на Марти да покаже всичките си смешни лица!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-1": "Сега, след като сме експерти в управление чрез променливи на паралелни програми, нека приложим наученото на практика, като помогнем на Марти да покаже всичките си смешни лица!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-2": "Изберете два блока със зелен флаг.<br/><br/>Когато се щракне върху зеления флаг, и двата блока ще се активират и ще изпълнят целия код под тях едновременно, паралелно.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-3": "Сега нека добавим някои от изразителните звуци на Марти, един след друг, под блок със зелено знаме.<br/><br/> Искаме да напишем код, който казва: <br/><i/> При щракване върху зеления флаг <br/> Възпроизвеждане на звук: Недоверие до края<br/> Възпроизвеждане на звук: Не! до края <br/> Възпроизвеждане на звук: Развълнуван до края</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-4": "Нека поставим първия си звуков блок под един от блоковете със зелен флаг.<br/><br/>Използвайте падащото меню, за да изберете „Недоверие“, за да си похожда с изненаданото лице на Марти!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-5": "Сега нека поставим втория звуков блок.     <br/><br/>Използвайте падащото меню, за да изберете „Не!“, за да се съчетаете със сърдитото лице на Марти!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-6": "Сега нека поставим последния звуков блок.     <br/><br/>Използвайте падащото меню, за да изберете „Развълнуван“, за да съчетаете с развълнуваното лице на Марти!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-7": "Сега нека напишем код за контролиране на израженията на Марти под втория блок със зелен флаг. Искаме кодът ни да казва: <br/><br/><i/>При щракване върху зелен флаг <br/>Очи широко отворени <br/>Очи ядосани <br/>Очи развълнувани</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-8": "Нека поставим нашия първи блок <b/>очи</b> под втория блок със зелен флаг, както е показано.     <br/><br/>Използвайте падащото меню, за да изберете „Широк“, за да покажете изненаданото лице на Марти!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-9": "Сега нека поставим втория блок очи.     <br/><br/>Използвайте падащото меню, за да изберете \"ядосан\", за да покажете гневното лице на Марти!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-10": "Сега нека поставим последния блок очи.     <br/><br/>Използвайте падащото меню, за да изберете „Развълнуван“, за да покажете развълнуваното лице на Марти!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-11": "Нека тестваме нашия код.     <br/><br/>Натиснете блока със зелен флаг и вижте дали изражението на Марти съвпада с правилния звук... <br/><br/>Съвпадат ли? <b/>не!</b> <br/><br/>Това е така, защото звуците и изразите отнемат <b/>различно време.</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-12": "В последния урок използвахме променливи за <b/>взаимно изключване</b>, за да сме сигурни, че две неща <b/>не</b> се случват едновременно.     <br/><br/>В този урок ще използваме променливи, за да <b/>синхронизираме</b> нашия паралелен код, като гарантираме, че правилните неща <b/> ​​се случват по едно и също време</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-13": "Отидете до раздела Променливи и направете променлива, наречена <b/>Марти се чуства</b> <br/><br/>Ще използваме това, за да сме сигурни, че Марти прави правилния израз и звук едновременно.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-14": "В Променливи изберете <b/>задай Марти се чувства на 0</b> блок и го поставете преди първия звуков блок, както е показано.    <br/><br/>Попълнете 0 с \"изненадан\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-15": "Изберете друг <b/>задай Марти се чувства на 0</b> блок и го поставете преди втория звуков блок, както е показано.    <br/><br/>Попълнете 0 с \"ядосан\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-16": "Изберете последен <b/>задай Марти се чувства на 0</b> блок и го поставете преди последния звуков блок, както е показано.    <br/><br/>Попълнете 0 с \"развълнуван\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-17": "За да накараме нашите променливи да синхронизират изразите и звуците на Марти, ще поставим блок <b/>изчакай</b> преди всеки израз <br/><br/>Поставете три блока <b/>изчакай</b>, както е показано по-долу:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-18": "Искаме Марти да <b/>изчака, докато</b> Марти се чувства = изненадан да отвори очи, например <br/><br/>Изберете три оператора за равенство и ги попълнете, както е показано по-долу.     <br/>Можете да получите блокове <b/>Марти се чувства</b> от оранжевия раздел Променливи.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-19": "И накрая, ще влезем в блоковете за изчакване със съответните блокове за равно, както е показано по-долу:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-20": "Направихте го - страхотно!<br/>Сега щракнете върху зеления флаг и гледайте как кодът ви работи паралелно!<br/><br/>Всяко изражение и звук съвпадат, докато използваме <b/>контрол на променливи за синхронизиране</b> на смешните лица на Марти!.   <br/><i/>Марти е изненадан!    <br/>Марти е ядосан!    <br/>Марти е развълнуван! </i> <br/><br/>Допълнително предизвикателство - колко смешни лица можете да накарате Марти да покаже с помощта на контрол на променливи?",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.description": "Нека пресъздадем изключен режим, като използваме всичко, което научихме досега! If-оператори, цикли, паралелен код, операторни блокове и още...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-1": "В този урок ще пресъздадем изключен режим, като използваме всичко, което сме научили досега!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-2": "Преди да започнете този урок, поиграйте с режим на изключване, за да запомните как работи. <br/><br/>Изключете вашия Марти от приложението и щракнете върху „mode“ на гърба на вашия Marty, за да превключите към изключен режим.<br/><br/>Вземете по една от всяка цветна плочка, за да изпробвате цветния сензор на вашия Марти, вижте как работи изключен режим, след това свържете отново вашия Marty и се върнете към този урок!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-3": "Да започваме!<br/><br/>Ще направим 5 паралелни програми за управление на всеки цвят в изключен режим:<br/><b/>зелено</b> означава ходене <b/>напред</b>, <br/><b/>жълто</b> означава ходене <b/>назад</b>, <br/><b/>лилаво</b> означава плъзгане <b/>надясно</b>, <br/><b/>синьо</b> означава плъзгане <b/>наляво</b>, <br/><b/>червено</b> означава <b/>спри и празнувай!</b>,",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-4": "Първо поставете 5 блока със зелен флаг в зоната за скриптове, по един за всяка цветна плочка в изключен режим.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-5": "Не искаме Марти да проверява цветния си сензор само веднъж, искаме той да продължава да проверява отново и отново, за да направи правилното действие. <br/><br/>И така, нека поставим цикъл винаги под всеки блок със зелен флаг.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-6": "За всеки блок от код искаме да кажем:<br/><br/><i/><b/>Ако</b> Марти усеща цвета зелен/син/червен/лилав/жълт, <b/>тогава</b> извърши съответното действие.</i><br/><br/>Така че нека поставим оператор if във всеки цикъл завинаги.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-7": "Във всеки блок от код искаме да проверим дали например <b/>сензор за цвят = зелено</b>, преди да кажем на Марти да върви напред. <br/><br/> За да направим това, ще поставим оператор за равенство във всеки израз if и ще ги попълним с един невключен цвят всеки. <br/><br/>Вашият код трябва да изглежда така:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-8": "За да завършите всеки оператор if, поставете блок за усещане на цвят във всеки оператор за равенство, както е показано. <br/><br/>Уверете се, че използвате падащото меню, за да изберете <i/>ляв сензор за цвят</i>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-9": "Страхотно! Сега искаме Марти да <b/>повтаря</b> правилното действие, <b/>докато</b> не е на друга карта. <br/><br/>За да направим това, ще използваме блок <b/>повтаряй докато</b>.<br/><br/>Поставете по един във всеки оператор if, както е показано тук:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-10": "За да попълним блока за повторение, искаме да кажем: <br/><br/><i/>повтаряй докато <b/>Не</b> цветен сензор = зелен</i>, например. <br/><br/>Добавете оператор not във всеки кодов блок, както е показано по-долу:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-11": "За да попълним всеки оператор not, искаме да копираме това, което е в израза if, както е показано по-долу. <br/><br/>Завършваме с код, който казва <i/>повтаряй докато <b/>Не</b> цветен сензор = зелен</i> и така нататък. <br/><br/>Можете да направите това бързо, като щракнете с левия бутон върху зеления блок за равно в израза if, щракнете върху дублиране и го плъзнете надолу в оператора <b/>not</b>. <br/><br/><br/><i/>Алтернативно, върнете се към стъпки 7 и 8, за да ви подскажем как да ги попълните правилно!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-12": "Страхотна работа! Сега нека поставим правилното действие във всеки блок от код. <br/><br/>Вътре в кодовия блок, който открива зелено, поставете <b/>върви напред с две стъпки</b> в блока за повтаряне, както е показано тук:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-13": "В кодовия блок, който разпознава лилаво, поставете <b/>плъзни се 1 път надясно</b> в блока повтаряй докато, както е показано тук. <br/><br/><br/><i/>Не забравяйте да използвате падащото меню, за да промените ляво на дясно!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-14": "В кодовия блок, който разпознава синьо, поставете <b/>плъзнете 1 път наляво</b> в блока повтаряй докато, както е показано тук.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-15": "В кодовия блок, който разпознава жълто, поставете <b/>върви две стъпки назад</b> в блока повтаряй докато, както е показано тук:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-16": "Почти е готово!<br/><br/>В кодовия блок, който разпознава червено, поставете <b/>пауза на движение</b> и <b/>танц</b> блок в блока повтаряй докато, както е показано тук:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-17": "Но изчакайте – Марти не може да танцува без музика!<br/><br/>Между блоковете за пауза и танц, поставете <b/>начален звук</b> и използвайте падащото поле, за да изберете </b>празнуване</b>!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-18": "И накрая, искаме Марти да спре целия код, след като приключи с празнуването.<br/><br/>Поставете блок <b/>спиране на всички</b> след блока танц.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-19": "Има още две неща, които трябва да направим, ако искаме правилно да пресъздадем изключен режим. <br/><br/>Когато Марти усети нов цвят, той променя светодиодите на очите си към този цвят и издава \"бип бип!\" шум. <br/><br/>Нека поставим това в нашия код!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-20": "Поставете <b/>задай LED очи за избор на</b> блок <b/>вътре в оператора if, но над блока повтаряй докато</b> във всяка част от кода. <br/><br/>Променете цвета на светодиода на съответния цвят за този блок и се уверете, че използвате падащото меню, за да изберете <b/>и двете очи</b>. <br/><br/>Вашият код трябва да изглежда така:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-21": "Можем да намерим \"бип бийп!\" шум в звуковата библиотека, наречена <b/>Arcade Beep</b>.<br/><br/>Копирайте клипа по-долу, за да намерите функцията <b/>Arcade Beep</b> в Звуци.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-22": "Поставете блок <b/>Стартов звук: Arcade Beep</b> след всеки блок за LED очи и преди всеки блок за повторение. <br/><br/>Вашият код трябва да изглежда така:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-23": "Успяхте! Невероятно!<br/><br/>Използвахте паралелни програми, променливи, оператори, сензори, цикли и други, за да пресъздадете сами режим „изключен“!<br/><br/><i/>За допълнително предизвикателство – какво друго можете да накарате Марти да направи, когато види всеки цвят?",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.description": "Нека научим как програмистите използват списъци, за да правят толкова страхотни неща!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-1": "В този урок ще научим всичко за списъците!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-2": "И така, когато става дума за програмиране, <b/>какво е списък?</b> <br/><br/>Програмистите използват списъци, понякога наричани масиви, за да съхраняват данни в определен ред.  <br/><br/>Програмистите могат да контролират как данните се добавят, премахват и съхраняват в списъка, както и да говорят за данните чрез техния номер в списъка (наречен индекс).",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-3": "Например в този списък бихме могли да кажем: <br/><br/><i/>премахнете лице номер 2</i>, вместо <i/>премахнете Марти</i>. <br/><br/><i/>разменете лице номер 3 и номер 4</i>, вместо <i/>разменете Сам и Кърсти</i>. <br/><br/>Списъците помагат на програмистите да контролират и съхраняват информация лесно, дори когато тя се променя.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-4": "В този урок ще използваме списък, за да помогнем на Марти да запомни линия от цветни плочки, по които той върви.<br/><br/>Преди да започнем да кодираме, ще ви трябват 4 плочки в изключен режим, подредени в линия като тази:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-5": "Отидете до раздела Променливи и щракнете върху „Създаване на списък“ <br/><br/>Наречете списъка „цветове“ и щракнете върху „ОК“",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-6": "Всеки път, когато Марти премине към нова плочка, ние ще добавим цвета от неговия сензор за цветове към нашия списък с „цветове“.<br/><br/>Изберете блока <b/>добавяне на нещо към цветовете</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-7": "Изберете блок сензор за цвят и го поставете в блока <b/>добавяне на нещо към цветове</b>. <br/><br/> Сега нашият код казва, <i/>какъвто и цвят да усеща Марти, добавете го към списъка „цветове“.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-8": "След като добавим цвят към нашия списък с цветове, искаме Марти да направи достатъчно стъпки, за да стигне до следващата плочка. <br/><br/>Поставете блок <b/>ходене напред</b>, както е показано, и променете <b/>2</b> на <b/>7</b>. <br/><br/></i>Смятаме, че 7 стъпки са достатъчни, за да преминете от една изключена плочка към следващата, но можете да изпробвате и да промените, ако е необходимо!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-9": "Преди Марти да провери своя сензор за цвят, трябва да му кажем да направи пауза, за да получи точно отчитане. Добавете блок за <b/>пауза на движение</b>, както е показано по-долу:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-10": "Тъй като искаме да повторим този код за всяка от нашите 4 цветни плочки, нека добавим цикъл <b/>повтори</b> около кода. <br/><br/>Променете <b/>10</b> на <b/>4</b>, за да повторите кода 4 пъти.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-11": "Сега нека накараме Марти да използва своите LED очи, за да ни каже кои цветове е видял. <br/><br/>Изберете 4 <b/>Задай избрани LED очи на</b> блокове и ги поставете след цикъла повторение. <br/><br/>Използвайте падащото меню, за да изберете <b/>двете очи</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-12": "Страхотна работа! Сега нека накараме светодиодите на Марти да се променят на всички цветове в нашия списък. <br/><br/>Отворете раздела Променливи и изберете блока <b/>елемент 1 от цветове</b>. <br/><br/>Заменете цветния кръг с <b/>елемент 1 от цветове</b> и променете числото на 1,2,3 и 4, както е показано тук:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-13": "Почти е готово! <br/><br/>Добавете блок <b/>изчакай 1 секунди</b> преди всеки светодиоден блок, както е показано по-долу, за да дадете достатъчно време за всяка промяна на цвета.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-14": "Успяхте!  <br/><br/>Сега поставете вашия Марти в началото на вашата линия от плочки, както е показано тук, и гледайте как Марти запомня всеки цвят!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.description": "Нека научим как програмистите използват списъци, за да правят толкова страхотни неща!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-1": "В този урок ще използваме <b/>списък</b>, за да напишем списъка за пазаруване на Марти.<br/><br/>След това ще напишем код в <b/>итеративен цикъл</b>, за да накараме Марти да прочете списъка си за пазаруване на глас!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-2": "Първо, нека създадем нашия списък. <br/><br/> Придвижете се до раздела Променливи и щракнете върху „Създаване на списък“ <br/><br/>Наречете списъка „цветове“ и щракнете върху „ОК“",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-3": "Първото нещо, което Марти трябва да купи, са батериите. <br/><br/>Изберете блока <b/>добавяне на нещо към списъка за пазаруване на Марти</b>. <br/><br/>Вместо <b/>нещо</b>, напишете <b/>батерии</b>. Кликнете върху блока и вижте как батериите се появяват в списъка",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-4": "Следващото нещо, от което Марти се нуждае, са кабели!<br/><br/>Запазвайки същия блок като преди, сменете <b/>батерии</b> на <b/>кабели</b> и кликнете върху блока.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-5": "Марти също има нужда от гайки и болтове! <br/><br/>Използвайте същия блок, за да добавите гайки и болтове към списъка.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-6": "Марти казва, че най-важното нещо, което трябва да купи, са бонбони!<br/><br/>Изберете <b/>вмъкнете нещо на 1 от блока Списък за пазаруване на Марти</b>.<br/><br/>Вместо <b/>нещо</b>, напишете <b/>бонбони</b>, щракнете върху блока и вижте как бонбоните се появяват на номер 1 в списъка!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-7": "Готиното при списъците е, че те правят супер лесно писането на код! <br/><br/>И двата блока кодове разчитат покупките на Марти. <br/><br/>Въпреки това, ако не използваме списък, както вляво, ще трябва да променяме този код всеки път, когато пазаруването на Марти се промени. <br/><br/>Ако използваме списък, както вдясно, можем да напишем код, който работи през цялото време - без значение колко дълъг е списъкът или какво се добавя/премахва!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-8": "Ще напишем този код, който можем да използваме за всеки списък! <br/><br/>Без значение как променяме списъка, Марти пак може да прочете списъка на глас с този код! <br/><br/>Този повтарящ се цикъл е специален - програмистите ги наричат ​​<b/>итеративни цикли</b> <br/><br/>Итерация означава да повтаряте една и съща задача, променяйки нещо всеки път, докато не бъде изпълнено условие. <br/><br/>Тук можете да видите <b/>повтарящата се задача</b>, <b/>условието</b> и <b/>повтарящата се промяна</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-9": "За да стартирате нашия итеративен цикъл, изберете повторение до блокиране.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-10": "Нека направим променливата <b/>номер на артикул</b>, която ще използваме, за да преминем през списъка за пазаруване на Марти. <br/><br/>Отворете раздела с променливи, изберете Създаване на променлива, наречете го <b/>номер на артикул</b> и щракнете върху „ОК“.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-11": "Нека настроим повтарящата се задача в нашия итеративен цикъл: Марти чете артикули от своя списък. <br/><br/>Придвижете се до раздела Говорене, изберете блок <b/>Марти говори</b> и го поставете в цикъла за повторение.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-12": "Не искаме Марти да поздравява, искаме той да прочете артикул от списъка. <br/><br/>Придвижете се до раздела Променливи и изберете <b/>артикул 1 от блока Списък за пазаруване на Марти</b> и го поставете, както е показано <br/><br/>Заменете числото 1 с променливата <b/>номер на артикул</b>. <br/><br/>Страхотна работа! Сега, ако номерът на артикула е 3, Марти ще каже \"кабели\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-13": "Сега нека добавим повтарящата се промяна в нашия цикъл.<br/><br/>Всеки цикъл искаме да добавим по едно към променливата <b/>номер на артикул</b>.<br/><br/>Поставете блока <b/>промяна на артикул с 1</b> след блока за изговаряне, както е показано:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-14": "Накрая ще настроим условието на нашия итеративен цикъл - <i/>повтаряй докато: номерът на артикула е по-голям от списъка за пазаруване на Марти</i> <br/><br/>Поставете оператор по-голямо от в оператора за повтаряй докато, както е показано.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-15": "Отидете до раздела Променливи и попълнете блока по-голямо от, както е показано, така че да показва: <br/><br/><i/>повтаряй докато: номерът на артикула е по-голям от списъка за пазаруване на Марти</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-16": "Успяхте! <br/><br/>Преди да тестваме нашия код, уверете се, че променливата за номер на артикул е зададена на нула - ако не е, можете да я нулирате с помощта на този блок.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-17": "Страхотно, сега щракнете върху вашия код и чуйте как Марти ни казва своя списък за пазаруване! <br/><br/>Научихте всичко за списъците, добавянето и премахването на елементи, използването на техните номера на артикули в кода и дори как да преминавате през тях!",
  "gui.menuBar.sensorsDashboard": "Табло за сензори",
  "gui.menuBar.showCode": "Показване на кода",
  "gui.gui.toggleMartyMachineTab": "Машинно обучение",
  "gui.gui.toggleSaveLoadTab": "Запазване/Зареждане",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.name": "Взаимодействие на Ког и Марти",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.description": "Научете как <b>Cog</b> и <b>Marty</b> могат да взаимодействат един с друг",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1": "В този урок ще научим как <b>Cog</b> и <b>Marty</b> могат да си взаимодействат един с друг. Натиснете \"Напред\", за да започнете!",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1": "Първо, нека се свържем с Cog. Кликнете върху бутона „Свързване на устройство“ и след това изберете Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1.1": "Страхотно! Сега щракнете върху бутона „свързване“, за да се свържете с Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2": "След това нека се свържем с Марти. Кликнете върху бутона „Свързване на устройство“ и след това изберете Марти",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2.1": "Страхотно! Сега щракнете върху бутона „свързване“, за да се свържете с Марти",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-2": "Сега, след като сме свързани с роботите, нека започнем да кодираме! За да видите блоковете на Cog, щракнете върху бутона Cog устройство",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3": "След като сте избрали блоковете Cog, плъзнете блока за събитието „при натискане на бутон“ в областта на скрипта. Този блок ще следи, когато се щракне върху бутона на Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3.hint": "Блокът за събития „при щракане cog“ е в категорията Събития. Плъзнете го в областта на скрипта, за да започнете да кодирате",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5": "Сега плъзнете блока „разпространи съобщение“ от категорията „Събития“ в областта на скрипта. Този блок ще прати съобщение при натискане на бутона на Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5.hint": "Блокът „разпространи съобщение“ е в категорията Събития. Плъзнете го в областта на скрипта, за да започнете да кодирате",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-6": "Сега да преминем към Марти. Трябва да изберем Марти, за да видим блоковете на Марти. Кликнете върху бутона на устройството Marty",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7": "Веднъж в режим Марти, плъзнете блока „Когато получа съобщение“ от категорията „Събития“ в областта на скрипта. Този блок ще слуша за разпространени съобщения",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7.hint": "Блокът „при съобщение“ е в категорията „Събития“. Плъзнете го в областта на скрипта, за да започнете да кодирате",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-9": "Почти стигнахме! Плъзнете блок „Танцувай!“ в областта на скрипта. Този блок ще накара Марти да танцува, когато съобщението бъде получено",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-10": "Страхотна работа! Успешно кодирахте Cog и Marty да взаимодействат помежду си. Сега щракнете върху бутона на Cog, за да видите как Марти танцува!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.name": "Въведение в светлините и звуците на Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.description": "Научете как да програмирате Cog с блокове, да правите звуци и светлини, задействани чрез взаимодействие с Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-1": "Нека се научим как да програмираме Cog с блокове! <br /><br />Ще се свържем с Cog и ще го накараме да свети и да издава звуци, когато бутонът бъде натиснат!<br /><br />Ще научим и за <b>сериен</b> код, който се изпълнява като последователност, и <b>паралелен</b> код, който се изпълнява по едно и също време",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-2": "Първо, нека се свържем с Cog. Кликнете върху бутона „Свързване на устройство“ и след това изберете Cog. <br /><br /> Можете да пропуснете тази стъпка, ако Cog вече е свързан",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-3": "Страхотно! Сега щракнете върху бутона „свързване“, за да се свържете с Cog<br /><br>Отново можете да пропуснете това, ако вече сте свързани с Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-4": "Страхотно! Сега трябва да имате добавен един Cog и той трябва да е свързан с вашия cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-5": "Изберете категория Събития",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6": "Добавете блок <b>При натискане на бутон</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6.hint": "Блокът за събитие „при натискане на бутон“ е в категорията „Събитие“. Плъзнете го в областта на скрипта, за да започнете да кодирате",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-7": "Изберете категорията Външност",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8": "Добавете блок <b>задаване на [пръстен] светодиоди на [цвят]</b>, като го плъзнете, за да се свържете с блока При натиснат бутон",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8.hint": "Блокът „задаване на [пръстен] светодиоди на [цвят]“ е в категорията Външност. Плъзнете го в областта на скрипта и го свържете към блока При натиснат бутон",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-9": "Опитайте! <br /><br />Натисни бутона на Cog и светлините трябва да светнат!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-10": "Променете цвета на светодиодите, като щракнете или натиснете върху цветното петно, след което плъзнете цветната лента. <br /><br />Можете също да промените наситеността (колко ярък е даден цвят) и яркостта - ако зададете това на 0, светодиодите ще бъдат изключени",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-11": "Опитайте! <br /><br />Натиснете бутона на Cog и светлините трябва да се сменят на новия цвят, който сте избрали!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12": "Добавете блок <b>При разклащане</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12.hint": "Блокът за събития „при разклащане“ е в категорията „Събития“. Плъзнете го в областта на скрипта далеч от кода, който вече е там",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13": "Добавете блок <b>Изключване на светодиодите</b> под блока При разклащане",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13.hint": "Блокът „Изключване на светодиодите“ е в категорията Външност. Плъзнете го в областта на скрипта и го свържете към блока При разклащане",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-14": "Опитайте! <br /><br />Разклатете Cog и светлините трябва да изгаснат!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-15": "Променете блока <b>задаване на [пръстен] светодиоди на [цвят]</b>, за да управлявате светодиода на бутона вместо това, като изберете „бутон“ от падащото меню",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-16": "Опитайте! <br /><br />Натисни бутона на Cog и сега светлината в бутона трябва да светне!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-17": "Разклатете Cog, за да изключите светодиодите<br /><br />Сега променете същото падащо меню, за да изберете вместо това „всички“.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-18": "Опитайте! <br /><br />Натисни бутона на Cog и всички светлини трябва да светнат!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19": "Добавете блок <b>Задай [пръстен] светодиоди към шаблон [мигане]</b> под блока Задай LED цвят",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19.hint": "Блокът „Задай [пръстен] светодиоди към шаблон [мигане]“ е в категорията Външен вид. Плъзнете го в областта на скрипта и го свържете към блока, който задава цветовете на светодиода",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-20": "Опитайте! <br /><br />Натиснете бутона на Cog и пръстенът от светодиоди трябва да започне да мига!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-21": "Променете шаблона на „Въртене1“ и го изпробвайте!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-22": "Изпробвайте другите модели в списъка",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23": "Добавете друг блок <b>Задай [пръстен] светодиоди към шаблон [мигане]</b> блок под предишния и го променете така, че да настрои бутона да мига.<br /><br />Изпробвайте го, като натиснете бутона на Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23.hint": "Блокът „Задай [пръстен] светодиоди към шаблон [мигане]“ е в категорията Външност. Плъзнете го в областта на скрипта и го свържете към блока, който задава цветовете на светодиода",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-24": "Изтрийте кода под блока При натиснат бутон, като го плъзнете обратно в палитрата с блокове",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25": "Добавете <b>Задай светодиоди с помощта на блока Избор на цвят</b>, свързан с блока При натиснат бутон",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25.hint": "Блокът Задаване на светодиоди с помощта на Избор на цвят е в категорията „Външност\". Плъзнете го в областта на скрипта и го свържете към събитието При натиснат бутон",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-26": "Променете отделните светодиодни цветове с помощта на инструмента за избор на цвят.<br /><br />Първо изберете цвят с помощта на цветното колело и плъзгачите за наситеност и яркост, след което изберете светодиодите, които искате да зададете на този цвят",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27": "Задайте и цвета на бутона, като добавите блок <b>Set [ring] LEDs to [color]</b> и го промените, за да настроите бутона на любимия си цвят",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27.hint": "Блокът „Задай [пръстен] светодиоди на [цвят]“ е в категорията Външност. Плъзнете го в областта на скрипта и го свържете към Задай LEDs с помощта на блока ColorPicker",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-28": "Опитайте! Натиснете бутона и светлините ще се променят в цветовете, които сте избрали",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-29": "Изберете категорията Контрол",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30": "Добавете блок <b>изчакай [1] секунди</b> под светодиодните блокове",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30.hint": "Блокът 'wait [1] seconds' е в категорията Control. Плъзнете го в областта на скрипта и го свържете под двата блока, които задават цветовете на светодиода",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31": "Добавете друг <b>Задай светодиоди с помощта на ColorPicker</b> блок под блока за изчакване, след което променете цветовете на каквито изберете",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31.hint": "Блокът „Задай светодиоди с помощта на ColorPicker“ е в категорията „Външност“. Плъзнете го в областта на скрипта и го свържете към блока за изчакване, който току-що добавихте, след което променете цветовете",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32": "Променете и цвета на бутона, като добавите блок <b>Set [ring] LEDs to [color]</b> и го промените, за да настроите бутона на любимия си цвят",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32.hint": "Блокът „Задай [пръстен] светодиоди на [цвят]“ е в категорията Външност. Плъзнете го в областта на скрипта и го свържете към последния Set LED с помощта на блока ColorPicker, след което изберете „бутон“ от падащото меню",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-33": "Опитайте! Натиснете бутона и светлините ще светнат, след което ще се сменят след 1 секунда!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34": "Добавете друг блок <b>При натискане на бутон</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34.hint": "Блокът за събитие „при натискане на бутон“ е в категорията „Събитие“. Плъзнете го в областта на скрипта, за да започнете да кодирате",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-35": "Изберете категорията Звук",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36": "Добавете блок <b>Възпроизвеждане на нота [C4] за [1] секунди</b> под блока При натискане на бутон, който току-що добавихте",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36.hint": "Блокът „Възпроизвеждане на нота [C4] за [1] секунди“ е в категорията Звук. Плъзнете го в областта на скрипта и го свържете към новия блок При натискане на бутон, който добавихте в последната стъпка",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-37": "Променете нотата на C5 и я изпробвайте, като натиснете бутона на Cog!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38": "Добавете блок <b>Възпроизвеждане от [200] до [300] Hz за [3] секунди</b> между блока On Button Push и блока Възпроизвеждане на нота.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38.hint": "Блокът „Възпроизвеждане на тон от [200] до [300]Hz за [3] секунди“ е в категорията Звук. Плъзнете го в областта на скрипта и го свържете между блока On Button Press и нотата за възпроизвеждане, която добавихте в последната стъпка",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-39": "Променете числата в блока за възпроизвеждане на тонове, за да преминете от 260 на 523 Hz за 1 секунда.<br /><br />Всяка музикална нота има честота, а 523Hz е честотата на C5 - C в петата октава.<br /><br />Изпробвайте, като натиснете бутона на Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-40": "Когато натиснете бутона, звуците и светлините се появяват едновременно - казваме, че те работят <b>паралелно</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-41": "Отделните звуци и светлини се появяват един след друг - казваме, че се изпълняват в <b>серия</b> или в последователност",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-42": "Страхотна работа! Научихте как да програмирате Cog, за да го накарате да реагира на натискане и разклащане на бутони и да издава звуци и светлини!'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.name": "Направете 13-странен зар!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.description": "Ще превърнем Cog в зар, показващ различен брой светлини всеки път, когато го разклатите!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-1": "Нека програмираме Cog да бъде нещо полезно - зар!<br /><br />Ще накараме Cog да реагира на разклащане, като покаже произволен брой светлини и издаде същия брой звукови сигнали<br /><br />За да направим това, ще научим за <b>променливите</b> - специални блокове, които могат да <i>варират</i> или променят стойността си, и <b>условните</b> - блокове, които взимат решение!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-2": "Първо се уверете, че сте свързани към зъбно колело.<br /><br />Ако не, добавете такова, както направихте в последния урок, като натиснете бутона Добавяне в панела с устройства и изберете Cog, след което щракнете върху свързване. Ако трябва, прескочете обратно към последния урок, за да видите как",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-3": "Добавете блок за събития <b>При разклащане</b> от категорията <b>Събития</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-4": "Изберете категорията <b>Променливи</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-5": "Щракнете върху бутона <b>Създаване на променлива</b><br /><br />Задайте името на новата променлива на <b>ledID</b> и натиснете OK",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-6": "Изберете категорията <b>Контрол</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7": "Добавете блок <b>повтори</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7.hint": "Блокът „повтори“ е в категорията „Контрол“. Плъзнете го в областта на скрипта и го свържете към блока При разклащане",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8": "Отидете в категорията <b>Външност</b> и добавете блок <b>Задай LED [1] на [цвят]</b> вътре в блока за повторение<br /><br />Променете цвета на любимия си цвят :-)",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8.hint": "Блокът „задай LED [1] на [цвят]“ е в категорията Външност. Плъзнете го в областта на скрипта и го поставете така, че да щракне вътре в блока за повторение",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-9": "Опитайте! <br /><br />Какво се случва, ако разклатите Cog?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10": "Върнете се в категорията <b>Променливи</b> и добавете блок <b>Промяна на [ledID] от [1]</b> точно след светодиодния блок",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10.hint": "Блокът „Промяна на [ledID] от [1]“ е в категорията Променливи. Плъзнете го в областта на скрипта и го поставете така, че да щракне вътре в блока за повторение, точно след блока Set LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-11": "Плъзнете променливата <b>ledID</b> в блока <b>Задай LED</b>, така че да се чете <b>Задай LED <i>ledID</i> на [цвят]</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-12": "Опитайте!<br /><br />Какво се случва, ако разклатите Cog?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-13": "Опитайте отново - ще светнат още светодиоди!<br /><br />Но ако разклатите Cog <i>отново</i> след това, нищо ново не се случва. Нека променим това!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14": "Добавете блок <b>Задай [ledID] на [0]</b> веднага след блока <b>При разклащане</b>, преди блока за повторение",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14.hint": "Блокът „Задай [ledID] на [0]“ е в категорията Променливи. Плъзнете го в областта на скрипта и го поставете така, че да щракне точно след блока „При разклащане“, преди блока за повторение",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15": "Също така добавете блок <b>Изключване на всички светодиоди</b> от категорията <b>Външност</b><br /><br />Добавете го точно преди блока за повторение, след блока <i>задай [ledID] на [0]</i>, който току-що добавихте",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15.hint": "Блокът „Изключване на всички светодиоди“ е в категорията „Външност“.<br /><Br />Уверете се, че сте го добавили между блока „set [ledID] to [0]“ и блока „повтаряне“",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-16": "Сега опитайте отново! <br /><br />Сега, когато разклатите cog, той ще нулира както светлините, така и <i>стойността</i> на <b>променливата</b> <i>ledID</i>, така че да брои от 1 до 10",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-17": "Отидете в категорията <b>Оператори</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-18": "Плъзнете блока <b>случайно избиране [1] до [10]</b>, за да замените числото в блока за повторение<br /><br />Сега блокът за повторение ще повтори произволен брой пъти от 1 до 10, променяйки се всеки път!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-19": "Cog има 13 програмируеми светодиода - 12 в пръстена и един в бутона<br /><br />Променете блока за <b>произволен избор</b>, за да изберете вместо това число между 1 и <b>13</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-20": "Опитайте! <br /><br />Сега всеки път, когато разклатите Cog, ще получавате различен брой светлини<br /><Br />Вие сте програмирали Cog да бъде зар!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-21": "<i>ledID</i> е <b>променлива</b> - има стойност, която може да бъде променена или <i>варирана</i><br /><br />В този код се брои до включването на различен светодиод всеки път през цикъла!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22": "Нека добавим и звукова обратна връзка.<br /><Br />Отидете в категорията <b>Звук</b> и добавете блок <b>Възпроизвеждане на нота [C4] за [1] секунди</b><br /><br />Променете го, за да възпроизвеждате нотата за <b>0,1 секунди</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22.hint": "Блокът „Възпроизвеждане на нота [C4] за [1] секунди“ е в категорията Звук.<br /><Br />Уверете се, че сте го добавили в цикъла за повторение!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23": "Също така добавете кратка пауза, като добавите блок <b>Изчакайте [1] секунди</b> от категорията <b>Контрол</b><br /><br />Променете и дължината на паузата да бъде <b>0,1 секунди</b><br /><br />Ако не добавим пауза, тогава няма да можем да кажем колко бипкания има, тъй като всички те ще се слеят в едно дълго бипкане!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23.hint": "Блокът „Изчакайте [1] секунди“ е в категорията Контрол. Добавете го към кода, като го плъзнете вътре в повторения цикъл",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-24": "Опитайте!<br /><Br />Сега ще чуете и брой звукови сигнали, които съответстват на броя на светлините!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25": "Нека направим нещо специално да се случи, <b>ако</b> хвърлите най-добрия резултат - 13<br /><br />Отидете в категорията <b>Контрол</b> и добавете блок <b>Ако __ тогава</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25.hint": "Блокът „if __ then“ е в категорията Control. Добавете го към кода, като го плъзнете, така че да се свърже след повторения цикъл",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-26": "Отидете в категорията <b>Оператори</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27": "Плъзнете блока <b>=</b> <b>в блока <i>if</i></b><br /><br />Тук ще зададем <b>условието</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27.hint": "Блокът '=' е под категорията Оператори. Плъзнете го до съответстващата форма в блока if",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-28": "Върнете се в категорията <b>Променливи</b> и плъзнете <b>променливата ledID</b> в <b>първото поле на блока за равенство</b><br /><br />След това <b>задайте второто поле на 13</b>, така че целият ред да се чете <b>ако ledID = 13 тогава</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-29": "Кодът вътре в този блок <b>if</b> ще се изпълнява само <b>ако</b> <b>променливата</b> ledID е <b>равна</b> на 13<br /><br />Той ще провери това, след като блокът <b>повтори</b> приключи с повторението, докато кодът продължава надолу по последователността<br /><br />Ако <b>променливата</b> ledID е нещо друго освен 13, тогава цялото Блок <b>if</b> и всеки код в него ще бъде пропуснат<br /><br />Блокът <b>if</b> е тип <b>условен</b> - кодът в него ще се изпълнява само ако зададеното от вас <b>условие</b> е вярно",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30": "Нека добавим нещо в блока <b>if</b>!<br /><br />Отидете до категорията <b>звук</b> и добавете блок <b>Пусни мелодия</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30.hint": "Блокът „Възпроизвеждане на мелодия“ е в категорията „Звук“. Добавете го към кода, като го плъзнете, така че да се свърже вътре в условието if",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-31": "Променете мелодията на <b>подсвиркване</b> от падащото меню",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32": "Добавете и някои светлинни ефекти от менюто за външен вид<br /><br />Например можем да накараме светодиодите на пръстените и бутоните да показват модел",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32.hint": "Блокът „Задаване на [пръстен] светодиод към модел [мигане]“ е в категорията Външност. Добавете два от тях вътре в условието if и променете един, за да зададете модела на бутона",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-33": "Опитайте!<br /><br />Вижте дали можете да хвърлите 13 на зара, като разклатите Cog!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-42": "Браво!<br /><br />Научихте, че <b>променлива</b> е нещо, което може да променя <b>стойността</b>. Можем да ги използваме, за да накараме нашия код да прави различни неща, без да е необходимо да променяме кода<br /><br />Научихме за блоковете <b>if</b> - те могат да се използват, за да накарат кода да се изпълнява само ако е изпълнено определено <b>условие</b><br /><br />И научихме как да използваме повтарящ се <b>цикъл</b>, за да правим нещо много пъти - в този случай всеки път включваме различен светодиод",
  "gui.spriteSelector.sprites": "СПРАЙТОВЕ",
  "gui.deviceSelector.devices": "УСТРОЙСТВА",
  "gui.spriteSelector.addSpriteFromLibrary": "Изберете спрайт",
  "gui.spriteSelector.addSpriteFromPaint": "Рисувам",
  "gui.spriteSelector.addSpriteFromSurprise": "Изненада",
  "gui.spriteSelector.addSpriteFromFile": "Качване на спрайт",
  "gui.deviceSelector.addDeviceByConnecting": "Свържете се с устройство",
  "gui.deviceSelector.addDeviceFromLibrary": "Изберете устройство",
  "gui.spriteSelector.noSpritesInUse": "Няма използвани спрайтове",
  "gui.deviceSelector.noDevicesInUse": "Добавяне на устройство",
  "gui.saveLoad.localStorageTitle": "В приложението",
  "gui.saveLoad.localStorageSubtitle": "Локално съхранение",
  "gui.saveLoad.cloudStorageTitle": "В облака",
  "gui.saveLoad.cloudStorageSubtitle": "Съхранение в облака",
  "gui.saveLoad.portableFileStorageTitle": "Преносим",
  "gui.saveLoad.portableFileStorageSubtitle": "Съхранение на файлове",
  "gui.saveLoad.createNewSaveFile": "Създайте нов файл за запис:",
  "gui.saveLoad.savedFilesTitle": "Вашите запазени файлове:",
  "gui.saveLoad.deleteFile": "Изтриване",
  "gui.saveLoad.loadFile": "Заредете",
  "gui.saveLoad.saveFile": "Запазване",
  "gui.saveLoad.saveFileNamePlaceholder": "Въведете име за файла, който ще запишете...",
  "gui.saveLoad.fileLoadError": "Неуспешно зареждане на проекта.",
  "gui.saveLoad.fileSaveError": "Неуспешно запазване на проекта.",
  "gui.saveLoad.overwriteFile": "Сигурни ли сте, че искате да презапишете този файл?",
  "gui.saveLoad.copyToClipboard": "Копиране в клипборда",
  "gui.saveLoad.copied": "Копирано!",
  "gui.saveLoad.saveProject": "Запазете проекта",
  "gui.saveLoad.projectSaved": "Проектът е запазен успешно!",
  "gui.saveLoad.projectSaveFailed": "Неуспешно запазване на проекта",
  "gui.saveLoad.projectLoaded": "Проектът е зареден успешно!",
  "gui.saveLoad.projectLoadFailed": "Неуспешно зареждане на проекта",
  "gui.saveLoad.loadProjectPlaceholder": "Въведете името на файла за запис в облака, който искате да заредите тук...",
  "gui.saveLoad.createNewCloudSave": "Създайте нов файл за запис в облака:",
  "gui.saveLoad.saveFileCode": "Вашият автоматично генериран код за запазване на файл е:",
  "gui.saveLoad.saveFilePlaceholder": "Вашият автоматично генериран код за запазване на файл е:",
  "gui.saveLoad.loadProjectTitle": "Зареждане на проекта",
  "gui.saveLoad.tipsTitle": "Съвети за запис в облака:",
  "gui.saveLoad.tips1": "Не забравяйте да запишете или запишете автоматично генерирания код, който се предоставя всеки път, когато записвате нов файл. Това ще ви трябва, за да го заредите в бъдеще.",
  "gui.saveLoad.tips2": "Въпреки че приложението Marty the Robot ще продължи автоматично да записва файлове в локалното пространство за съхранение, няма функция за автоматично запазване на файлове за запис в облак. Моля, запазвайте ръчно отново файла си всеки път, ако желаете те да бъдат достъпни за изтегляне в облачно хранилище.",
  "gui.saveLoad.tips3": "Всеки път, когато запишете отново файл в облачно хранилище, ще ви бъде предоставен НОВ КОД ЗА ЗАПИСАНЕ НА ФАЙЛ. Моля, обърнете внимание на това.",
  "gui.saveLoad.saveToFile": "Запазване във файл",
  "gui.saveLoad.loadFromFile": "Зареждане от файл",
  "gui.saveLoad.fileSaved": "Файлът е запазен!",
  "gui.martyMachineModelEditor.model": "Име на модела",
  "gui.martyMachineModelEditor.className": "Съберете данни за",
  "gui.martyMachineModelEditor.createNewClass": "Създайте клас",
  "gui.martyMachineModelEditor.samples": "Проби",
  "gui.MartyMachineModelEditor.record": "Запис на данни",
  "gui.MartyMachineModelEditor.stop": "Спри",
  "gui.MartyMachineModelEditor.train": "Тренирай",
  "gui.MartyMachineModelEditor.run": "Стартирай ",
  "gui.MartyMachineModelEditor.save": "Запазване",
  "gui.MartyMachineModelEditor.saving": "Запазва се...",
  "gui.martyMachineTab.addNew": "Добавете нов модел",
  "gui.martyMachineTab.newImageModelMarty": "Нов модел на изображения (Марти)",
  "gui.martyMachineTab.newImageModelDevice": "Нов модел на изображението (устройство)",
  "gui.martyMachineTab.newAccelerometerModel": "Нов модел акселерометър",
  "gui.martyMachineTab.newAudioModel": "Нов аудио модел",
  "gui.martyMachineTab.loadTMModel": "Заредете TM модел",
  "gui.martyMachineTab.tutorials": "Уроци",
  "gui.martyMachineTab.alertSelectDevice": "Опа! Моля, изберете устройство Marty или Cog, за да използвате модела на акселерометъра.",
  "gui.martyMachineTab.alertConnectDevice": "Опа! Моля, свържете устройството, за да използвате модела на акселерометъра.",
  "gui.martyMachineTab.alertModelNameExists": "Името на модела вече съществува, моля изберете друго име.",
  "martyMachine.modelNameExists": "Опа! Името на модела вече съществува, моля, изберете друго име.",
  "martyMachine.backgroundNoiseClassNeedsSamples": "Опа! Класът на фонов шум се нуждае от поне 10 проби, за да бъде обучен. Моля, добавете още проби към класа на фоновия шум.",
  "martyMachine.classNameExists": "Опа! Името на класа вече съществува, моля изберете друго име.",
  "martyMachine.selectClassAlert": "Моля, добавете или изберете съществуващ клас, преди да записвате проби.",
  "gui.MartyMachineNewModelConfirmationModal.label": "Незапазените промени ще бъдат загубени.",
  "gui.MartyMachineNewModelConfirmationModal.headsUp": "Предварително предупреждение! Ако сте направили промени в текущия модел, те няма да бъдат запазени. Искате ли да продължите?“",
  "gui.MartyMachineNewModelConfirmationModal.close": "затвори",
  "gui.MartyMachineNewModelConfirmationModal.continue": "Продължи",
  "gui.TfVisChart.loadingTitle": "Зареждане на графиката на загубите",
  "gui.TfVisChart.loadingSubtitle": "Това може да отнеме известно време, моля изчакайте...",
  "gui.MartyMachineModelEditor.requiresAtLeast10Samples": "Изисква поне 10 проби",
  "gui.MartyMachineModelEditor.createNewClass": "Създаване на нов клас",
  "gui.howtos.marty-machine-create-model.name": "Създайте AI модел",
  "gui.howtos.marty-machine-create-model.step_create-model": "Създаване на нов модел",
  "gui.howtos.marty-machine-create-audio-model.step_visit-user-guide": "Посетете нашето ръководство за потребителя за повече информация",
  "gui.howtos.marty-machine-create-image-model.name": "Създаване на модел на изображение",
  "gui.howtos.marty-machine-create-image-model.step_create-image-model": "Създаване на нов модел на изображение",
  "gui.howtos.marty-machine-create-image-model.step_change-model-name": "Промяна на името на модела",
  "gui.howtos.marty-machine-create-image-model.step_collect-data": "Събиране на данни",
  "gui.howtos.marty-machine-create-image-model.step_train-model": "Обучаване на модел",
  "gui.howtos.marty-machine-create-image-model.step_run-model": "Стартирайте модела",
  "gui.howtos.marty-machine-create-image-model.step_save-model": "Запазване на модела",
  "gui.howtos.marty-machine-create-audio-model.name": "Създайте аудио модел",
  "gui.howtos.marty-machine-create-audio-model.step_create-audio-model": "Създайте нов аудио модел",
  "gui.howtos.marty-machine-create-audio-model.step_change-model-name": "Промяна на името на модела",
  "gui.howtos.marty-machine-create-audio-model.step_collect-data": "Събиране на данни",
  "gui.howtos.marty-machine-create-audio-model.step_train-model": "Модел за обучение",
  "gui.howtos.marty-machine-create-audio-model.step_run-model": "Стартирайте модела",
  "gui.howtos.marty-machine-create-audio-model.step_save-model": "Запазване на модела",
  "gui.howtos.marty-machine-load-tm-model.name": "Заредете обучаем модел на машина",
  "gui.howtos.marty-machine-load-tm-model.step_load-tm-model": "Заредете обучаем модел на машина",
  "gui.howtos.marty-machine-load-and-run-image-model.name": "Заредете и стартирайте модел на изображение",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-and-run-image-model": "Изведете AI блоковете",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-model": "Заредете модел",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classification-on": "Включете класификацията",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classify-image": "Класифициране на изображението",
  "gui.howtos.marty-machine-load-and-run-audio-model.name": "Заредете и стартирайте аудио модел",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-and-run-audio-model": "Изведете AI блоковете",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-model": "Заредете модел",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classification-on": "Включете класификацията",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classify-audio": "Класифицирайте аудио"
}