{
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.description": "Fortschritt von BlocksJr zu MartyBlocks!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-1": "Willkommen bei MartyBlocks! <br /><br /> Lasst uns kurz zusammenfassen, was wir von MartyBlocks Jr. kennen, um uns an dieses neue System zu gewöhnen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-2": "Wir finden den „Start-Button“ in den Ereignissen. <br /><br /> Ziehen Sie ihn in den Skriptbereich, um mit der Codierung zu beginnen",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-3": "In Motion finden wir den „Bereitmachen!“-Block. <br /><br /> Denk daran, diesen Block immer einzufügen, bevor Marty sich bewegt.<br /><br /> Platziere ihn unter dem grünen Flaggenblock.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-6": "Sie finden den Slide-Block auch in Motion. <br /><br /> Fügen Sie den Block nach „Gehen Sie 4 Schritte vorwärts“ hinzu, stellen Sie das Dropdown-Feld auf „rechts“ und geben Sie „3“ ein, um dem BlocksJr-Code zu entsprechen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-7": "Verwenden Sie denselben Block, um Marty nach links rutschen zu lassen. <br /><br /> Fügen Sie den Block nach „3-mal nach rechts rutschen“ hinzu, stellen Sie das Dropdown-Feld auf „links“ und geben Sie „2“ ein, um dem BlocksJr-Code zu entsprechen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-8": "Zum Schluss fügen wir den Block „Rückwärtsgehen“ hinzu. <br /><br /> Füge den Block nach „Zweimal nach links wischen“ ein und gib „1“ ein, um den Code von BlocksJr anzupassen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-9": "<b/>Du hast es geschafft! Du bist erfolgreich von BlocksJr zu MartyBlocks gewechselt.</b> <br /><br /> Jetzt bist du bereit, MartyBlocks zu erkunden und so viele coole Dinge mit Marty zu machen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.description": "Lerne, wie man Sprites in MartyBlocks erstellt und steuert!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-2": "Wählen Sie ein Sprite aus, mit dem Sie arbeiten möchten – Sie können ein Sprite aus der Bibliothek auswählen oder ein Überraschungs-Sprite erhalten!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-3": "Wählen wir zunächst einen Block mit der grünen Flagge aus und ziehen Sie ihn in den Skriptbereich, um mit der Codierung zu beginnen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-4": "Wir verwenden die „Endlosschleife“, damit der Sprite so lange folgt, bis wir ihn mit dem roten Stoppknopf zum Anhalten auffordern.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-5": "Wählen Sie in Motion den Punkt in Richtung Mauszeigerblock aus. <br /><br /> Fügen Sie dies als unseren ersten Block in der Endlosschleife hinzu.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-7": "Du kannst auch den Hintergrund ändern, vor dem dein Sprite platziert ist. <br /><br />Damit können wir noch mehr mit Sprites anstellen. <br /><br /> Wähle zehn verschiedene Hintergründe aus (du weißt, dass du dies getan hast, wenn dort „Hintergründe: 10“ steht).",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-8": "Helfen wir unserem Sprite, zwischen diesen Hintergründen zu wechseln, um sie zu erkunden! <br /><br />Wählen Sie einen Block zum Wechseln des Hintergrunds und verwenden Sie das Dropdown-Menü, um „zufälliger Hintergrund“ auszuwählen.<br /><br />Platzieren Sie dies zwischen dem Block „Wenn auf die grüne Flagge geklickt wird“ und der Endlosschleife, wie im Beispielcode hier gezeigt:",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-9": "Du hast es geschafft! <br /><br /> <b/>Jetzt können wir jedes Mal, wenn wir auf die grüne Flagge klicken, mit unserem Sprite einen neuen Hintergrund erkunden! </b><br/><br /> Du kannst die Schaltfläche mit den vier Pfeilen verwenden, um dein Sprite im Vollbildmodus anzusehen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.description": "Lassen Sie uns Ereignisse und Sprites erkunden und wie sie Martys Bewegungen steuern können!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-1": "Da wir nun wissen, wie man ein Sprite steuert, verwenden wir ein Sprite, einen Hintergrund und einige Ereignisblöcke, um Marty in der Arktis zu steuern!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-4": "Klicken Sie im Sprite-Menü auf den Eisbären, um dessen Code anzuzeigen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-5": "Navigieren Sie anschließend zu den Ereignissen. <br /><br />Diese Blöcke legen fest: <b/>„Wenn dies passiert, führe das aus.“</b> Sie helfen uns sicherzustellen, dass unser Code nur dann ausgeführt wird, wenn wir es wünschen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-6": "Um mit dem Programmieren zu beginnen, benötigen wir zwei separate Ereignisblöcke. <br /><br />Wählen Sie den Ereignisblock „Grüne Flagge“ und den Ereignisblock „Als dieses Sprite geklickt hat“.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-7": "Wir möchten Code schreiben, der besagt: <br /> <br /> <i>Wenn dieses Sprite angeklickt wird, wird der Hintergrund auf Arktis umgestellt. <br />Wenn die grüne Flagge angeklickt wird, wird der Hintergrund wieder auf Standard umgestellt.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-9": "Jetzt lassen wir Marty mithilfe seiner Ereignisblöcke auf diesen Code reagieren. <br /><br />Navigiere zu Martys Blöcken, indem du im Gerätemenü auf Marty klickst.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-10": "Wir möchten Code schreiben, der besagt: <br /> <i> Wenn der Hintergrund auf Arktis umschaltet, wackeln! </i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-12": "Navigieren Sie abschließend zu „Bewegung“, wählen Sie den Block „Wackeln!“ aus und platzieren Sie ihn wie im Beispielcode gezeigt:",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-13": "Du hast es geschafft! Klicke auf die grüne Flagge, um die Szene zurückzusetzen, klicke dann auf den Eisbären, um eine Arktisszene zu erstellen, und sieh zu, wie Marty wackelt!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-3": "Jetzt braucht unsere Party etwas Musik! <br/> Klicken Sie auf „Sprite auswählen“ und suchen Sie nach <b/>Lautsprecher</b>, um unsere Partyszene zu vervollständigen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-5": "Ziehen Sie diesen Block in den Codierungsbereich, um mit unserem Sprite-Code zu beginnen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-6": "Ziehen Sie den Block „Broadcast Message1“ an die gezeigte Position. <br /><br />",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-7": "Wählen Sie im Dropdown-Feld „Neue Nachricht“ aus und erstellen Sie dann eine neue Nachricht mit dem Namen „Partyzeit!“ zum Senden.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-10": "Bei Ereignissen wählen wir „Wenn ich empfange“ aus, ziehen es in den Skriptbereich und wählen im Dropdown-Feld „Partyzeit!“ aus. <br /><br />Damit sagen wir Marty, was er tun soll, wenn Partyzeit ist – Musik spielen und tanzen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-11": "Wählen Sie den Startsound-Block aus und platzieren Sie ihn wie unten gezeigt.<br/><br/>Wählen Sie im Dropdown-Menü „Feiern!“ aus und die Party kann beginnen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-12": "Navigieren Sie abschließend zu Motion, wählen Sie den Block „Tanzen!“ aus und platzieren Sie ihn wie im Beispielcode unten gezeigt.<br/><br/>Jetzt kann Marty richtig feiern!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.description": "Lernen Sie, if-Anweisungen zu verwenden, um Marty zu schützen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-1": "In diesem Tutorial lernen wir, wie <b/> ​​if-Anweisungen</b> und Martys <b/>Hindernissensoren</b> funktionieren! <br /><br /> Wir verwenden sie zusammen in einer Endlosschleife, damit Marty anhält, wenn ihm etwas den Weg versperrt.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-2": "Dies ist ein if-Anweisungsblock. <br /><br />If-Anweisungen sind in der Programmierung sehr wichtig. Sie helfen uns zu steuern, wann ein Code ausgeführt wird.<br/><br/>Manchmal möchten wir nur, dass ein Teil des Codes ausgeführt wird, <b /> wenn <b /> etwas anderes wahr ist.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-5": "IR-Sensoren bestehen aus zwei Teilen: <b />Sendern und Empfängern.</b> <br /><br />Der <b />Sender</b> sendet unsichtbares Licht aus, das reflektiert wird, wenn sich ein Hindernis im Weg befindet. <br /> Der <b />Empfänger</b> sucht nach IR-Licht, das von einem Hindernis zurückgeworfen wird. <br /><br />Erkennt der Empfänger reflektiertes Licht, weiß der Sensor, dass etwas im Weg ist. <br /><br />IR-Sensoren werden verwendet, um automatische Türen zu öffnen, Autos einzuparken und Marty-Robotern beim Ausweichen vor Hindernissen zu helfen! <br/><br/><br/><i/>Klicken Sie auf das Bild, um das Diagramm zu vergrößern.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-6": "Navigieren Sie zu „Sensorik“ und wählen Sie den Block „Fußhindernis erkannt“ aus.<br /><br />In diesem Beispiel können Sie entweder den linken oder den rechten Bodensensor aus dem Dropdown-Menü auswählen – Sie müssen jedoch einen auswählen, sonst funktioniert der Block nicht!<br /><br />Platzieren Sie den Sensorblock in der Raute des if-Anweisungsblocks, wie unten gezeigt. Dieser Code besagt nun: Wenn <i />„Fußhindernis erkannt“ wahr ist, dann tue etwas.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-7": "Wenn Marty ein Hindernis erkennt, soll er anhalten, damit wir ihn schützen können. Fügen wir in unsere if-Anweisung einen Block „Marty sofort stoppen“ ein.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-8": "Wir wollen nicht, dass Marty nur einmal nach Hindernissen sucht, sondern dass er dies immer und immer wieder tut. Deshalb setzen wir unsere if-Anweisung in eine Endlosschleife.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-10": "Platzieren wir unseren Gehblock in einer Endlosschleife, sodass Marty weiterläuft, bis er ein Hindernis sieht.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.description": "Lerne, if-else-Anweisungen zu verwenden, um Marty zu schützen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-1": "In diesem Tutorial lernen wir, wie <b/> ​​if-else-Anweisungen</b> funktionieren! <br /><br /> Wir verwenden Martys Bodensensoren in einer if-else-Anweisung, um zu verhindern, dass Marty von einer Kante läuft.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-2": "Wir wissen bereits, wie man eine if-Anweisung verwendet. <br /><br /> Code innerhalb der if-Anweisung wird nur ausgeführt, <b/>wenn</b> der Code in der Raute wahr ist – aber was ist, wenn wir steuern möchten, was passiert, wenn der Code NICHT wahr ist? <br /><br /> If-else-Anweisungen helfen uns zu sagen: <b /> wenn </b> dies wahr ist, führe Code aus, <b/>sonst</b> führe anderen Code aus.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-4": "Für diese Übung verwenden wir Martys Bodensensoren. Sie erkennen, ob Martys Fuß auf einer Oberfläche steht oder nicht.<br /><br /> Wir möchten sicherstellen, dass er nur vorwärts geht, <b/> ​​wenn BEIDE Füße auf dem Boden stehen.<b/> <br /><br /> Wählen Sie <b/>zwei</b> Blöcke der Option „Fußsensor auf dem Boden auswählen“ aus. Verwenden Sie das Dropdown-Menü, um einen dem rechten und einen dem linken Fuß zuzuweisen.<br /><br /> Wir möchten Marty anweisen, vorwärts zu gehen, <b/>WENN</b> beide Füße auf dem Boden stehen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-5": "Um sicherzustellen, dass unser Code beide Sensoren gleichzeitig überprüft, verwenden wir den „and“-Block in Operatoren. <br /><br />Platzieren Sie beide Sensorblöcke innerhalb des „and“-Blocks, wie im Beispielcode gezeigt:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-6": "Fügen wir nun den „and“-Block in unseren „if-else“-Block ein, sodass er dem Beispielcode unten entspricht.<br /><br />Dieser Code sagt nun: <i/>Wenn „linker Fuß und rechter Fuß auf dem Boden“ wahr ist, tu etwas. Wenn das nicht wahr ist, tu etwas anderes.<i/>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-8": "Wenn ein oder beide Füße nicht auf dem Boden sind, wollen wir Marty sicher stoppen. Dazu verwenden wir den „Bereitmachen“-Block, um seine Beine zu strecken. <br /><br />Platzieren Sie einen „Bereitmachen“-Block nach „Sonst“, wie unten gezeigt:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-9": "Fast fertig! Nur soll unser Code nicht nur einmal ausgeführt werden, sondern immer wieder. Deshalb packen wir ihn in eine Endlosschleife.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-10": "Du hast es geschafft! Jetzt testen wir deinen Code! <br /><br /> <b/> ​​Wichtig:</b> Wir empfehlen, Marty auf einer Kante zu platzieren, <b/>maximal 12,5 cm hoch</b>, um Schäden bei Stürzen zu vermeiden. <br/>Wir empfehlen, Marty auf einer <b/>weißen Oberfläche</b> (z. B. einem Blatt Papier) laufen zu lassen, da dies die Genauigkeit seiner Bodenerkennung verbessert. <br /><br /> Stelle Marty auf einen kleinen Vorsprung und klicke auf die Endlosschleife, um Martys Sturzschutz zu testen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.name": "Reaktionstestspiel!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-2": "Stellen Sie zunächst sicher, dass Sie mit einem Zahnrad verbunden sind.<br /><br />Falls nicht, fügen Sie eines hinzu, wie im letzten Tutorial, indem Sie im Gerätebereich auf die Schaltfläche „Hinzufügen“ klicken, ein Zahnrad auswählen und dann auf „Verbinden“ klicken. Springen Sie bei Bedarf zurück zum letzten Tutorial, um zu sehen, wie",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-3": "Fügen Sie einen Block <b>Wenn Flagge angeklickt</b> aus der Kategorie <b>Ereignisse</b> hinzu.<br /><br />Dies ist der Start unseres Programms und wird ausgeführt, wenn wir die grüne Flagge oben auf dem Bildschirm drücken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-4": "<b>Fügen Sie einen</b> <i>[Ring]-LEDs auf [Farbe] einstellen</i> <b>Block</b> aus der Kategorie <b>Aussehen</b> hinzu.<br /><br />Ändern Sie ihn, um die Farbe der <i>Schaltfläche</i> festzulegen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-6": "Gehen Sie zurück zur Kategorie <b>Looks</b> und fügen Sie einen Block <b>Turn off all LEDs</b> hinzu.<br /><br />Fügen Sie ihn direkt nach dem Warteblock hinzu, sodass Cog die Tasten-LED nach 1 Sekunde ausschaltet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-7": "<b>Probier es aus!</b> Klicke auf die grüne Flagge, um das Programm zu starten! Der Knopf auf dem Zahnrad leuchtet 1 Sekunde lang auf und erlischt dann.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-8": "<b>Überprüfen Sie, ob Sie die Taste rechtzeitig drücken können!</b> Gehen Sie zur Kategorie <b>Ereignisse</b> und fügen Sie einen Block <b>Bei Tastendruck</b> hinzu.<br /><br />",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-9": "Fügen Sie einen <b>Wenn __ dann</b>-Block unter dem Block <b>Beim Drücken der Taste</b> aus der Kategorie <b>Steuerung</b> hinzu.<br /><br />Wir verwenden diesen Wenn-Block, um zu prüfen, ob der Spieler die Taste rechtzeitig gedrückt hat.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-10": "Ziehen Sie einen < Block aus der Kategorie <b>Operatoren</b> in den if-Block.<br /><br />Das < Symbol bedeutet „kleiner als“ und ist nur dann wahr, wenn die Zahl links kleiner ist als die Zahl rechts.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-12": "Der Timer ist eine spezielle Variable, die die Zeit in Sekunden misst.<br /><br />Der Code im if-Block wird nur ausgeführt, wenn der Timer weniger als eine Sekunde beträgt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-13": "Fügen Sie unter dem Block „Wenn Flagge geklickt wird“ einen <b>Timer zurücksetzen</b>-Block hinzu.<br /><br />Dadurch wird die Timer-Variable kurz vor dem Einschalten der LED auf 0 zurückgesetzt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-15": "Fügen Sie einen Block <b>Note [C4] für [1] Sekunden spielen</b> aus der Kategorie <b>Ton</b> hinzu.<br /><br />Platzieren Sie ihn direkt nach dem Block <b>LED einstellen</b> und ändern Sie ihn so, dass <b>C6</b> für <b>0,25 Sekunden</b> gespielt wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-16": "Fügen Sie nach dem Block <b>Note abspielen</b> einen Block <b>Alle LEDs ausschalten</b> hinzu.<br /><br />Der Code in der if-Anweisung wird nur ausgeführt (und Cog leuchtet und piept daher nur), wenn die Taste innerhalb von 1 Sekunde nach dem Zurücksetzen des Timers gedrückt wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-17": "<b>Probier es aus!</b> Drück die grüne Flagge zum Starten. Wenn du dann innerhalb von 1 Sekunde den Knopf drückst, schalten sich die Lichter ein und du hörst den Piepton!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-18": "Jetzt sorgen wir dafür, dass das Licht mehr als einmal aufleuchtet!<br /><br />Gehen Sie zur Kategorie <b>Steuerung</b> und fügen Sie einen <b>Wiederholen</b>-Block um den Code unter dem <b>Wenn Flagge angeklickt</b>-Block ein.<br /><br />Dadurch leuchtet das Zahnrad mehrmals auf!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-19": "Fügen Sie außerdem einen weiteren Block <b>Warten [1] Sekunden</b> innerhalb der Wiederholungsschleife hinzu",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-20": "Gehen Sie zur Kategorie <b>Operatoren</b> und ändern Sie die Zeit für diesen Warteblock auf eine Zufallszahl zwischen 1 und 5 Sekunden",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-21": "Wenn Sie jetzt die grüne Flagge drücken, haben Sie 10 Chancen, den Knopf zu drücken, während er leuchtet!<br /><br />Zwischen jedem Knopf gibt es eine zufällige Pause, und während jeder Iteration durch die Schleife wird der Timer zurückgesetzt, sodass wir den Code, der auf den Knopfdruck reagiert, nicht ändern müssen. <br /><br />Probieren Sie es aus! Wie viele Lichter können Sie fangen?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-22": "Den Punktestand im Kopf zu behalten ist etwas langweilig. Fügen wir Code hinzu, um den Punktestand automatisch zu erfassen!<br /><br />Gehen Sie zur Kategorie <b>Variablen</b> und erstellen Sie eine Variable namens <b>Punktzahl</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-23": "Fügen Sie direkt nach dem Block <b>Wenn Flagge angeklickt wird</b> und vor der Wiederholungsschleife einen Block <b>Setze [meine Variable] auf [0]</b> hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-24": "Ändern Sie die Variable in <b>Punktzahl</b>, sodass sie <i>Punktzahl auf 0 setzen</i><br /><br />Wenn Sie jetzt das Spiel starten, wird die Punktzahl auf 0 zurückgesetzt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-25": "Fügen Sie in der if-Anweisung einen Block „Ändere [meine Variable] um 1“ hinzu und wählen Sie die Variable <b>Score</b> aus dem Menü aus, sodass dort „Score um 1 ändern“ steht.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-26": "Probieren Sie es aus!<br /><br />Jetzt erhöht sich die Punktzahl jedes Mal um 1, wenn Sie rechtzeitig drücken!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-27": "Jetzt machen wir es etwas schwieriger!<br /><br />Was passiert, wenn die Lichter schneller blinken, je weiter du kommst?<br /><br />Erstelle eine weitere Variable und nenne sie <i>Verzögerung</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-28": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-29": "Verringern wir die Verzögerung bei jedem Durchlauf der Wiederholungsschleife!<br /><br />Fügen Sie einen Block <b>Ändere [Verzögerung] um [1]</b> innerhalb der Wiederholungsschleife hinzu.<br /><br />Wir warten nicht zu lange, bis die Verzögerung abnimmt, also stellen Sie sie so ein, dass sie sich um -0,05 ändert. Dadurch wird sie jedes Mal um 1/20 Sekunde verringert.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-32": "Probieren Sie es aus!<br /><br />Bemerken Sie, dass das Spiel schneller wird?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-33": "Lass uns dafür sorgen, dass das Zahnrad dem Spieler am Ende die Punktzahl anzeigt.<br /><br />Das können wir genauso machen wie mit den Würfeln in der letzten Übung.<br /><br />Zuerst erstellen wir eine Variable namens <b>ledID</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-34": "Fügen Sie anschließend nach der Wiederholungsschleife einen <b>set variable</b>-Block ein und setzen Sie <b>ledID</b> auf 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-35": "Gehen Sie als Nächstes zur Kategorie <b>Steuerung</b> und fügen Sie eine weitere <b>Wiederholungsschleife</b> hinzu.<br /><br />Ersetzen Sie die Zahl darin durch die Variable „Punktzahl“, sodass „Wiederholung [Punktzahl]“ angezeigt wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-36": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-38": "Probier es aus!<br /><br />Wenn du fertig bist, zeigt Cog dir deine Punktzahl an!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-39": "Gut gemacht – du hast schon ziemlich fortgeschritten programmiert!<br /><br />Du hast gelernt, wie man Variablen verwendet, um während eines Spiels den Überblick zu behalten.<br /><br />Wir haben einen Timer und einen Kleiner-als-Operator verwendet, um einen Vergleich durchzuführen, sowie eine Wenn-Dann-Anweisung, um zu entscheiden, ob der Spieler den Knopf rechtzeitig gedrückt hat.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-40": "Nächste Schritte!<ul><li>Könntest du das Spiel schwieriger gestalten? Wie wäre es mit ein paar weiteren, noch schnelleren Levels?</li><li>Könntest du, basierend auf dem, was du im Würfel-Tutorial gelernt hast, Cog jubeln lassen, wenn der Spieler die volle Punktzahl erreicht?</li><li>Wenn du Freunde oder Klassenkameraden mit Cogs hast, spielt abwechselnd „Hau den Maulwurf“ mit mehreren Cogs gleichzeitig! Alle drücken gleichzeitig die grüne Flagge, und dann versuchen die Spieler abwechselnd, so viele Punkte wie möglich mit allen Cogs zu erzielen. Am Ende addiert ihr die Punkte, indem ihr die Anzahl der Lichter auf jedem Cog zusammenzählt.</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.name": "Reaktive Lichtshow!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-1": "Lasst uns eine Lichtshow erstellen, die auf eure Interaktion mit Cog reagiert!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-2": "Stellen Sie zunächst sicher, dass Sie mit einem Zahnrad verbunden sind.<br /><br />Falls nicht, fügen Sie eines hinzu, wie im letzten Tutorial, indem Sie im Gerätebereich auf die Schaltfläche „Hinzufügen“ klicken, ein Zahnrad auswählen und dann auf „Verbinden“ klicken. Springen Sie bei Bedarf zurück zum letzten Tutorial, um zu sehen, wie",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-3": "Gehen Sie zur Kategorie <b>Ereignisse</b> und fügen Sie einen <b>on object sensed [left]</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-5": "Stellen Sie die Farben nach Ihren Wünschen ein.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-6": "Probieren Sie es aus! Platzieren Sie einen Gegenstand auf dem linken Hindernissensor.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-9": "Gehen Sie zurück zur Kategorie <b>Looks</b> und fügen Sie mit Hilfe des Farbauswahl-Blocks ein weiteres <b>Set LEDs</b> hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-10": "Probieren Sie es aus! Legen Sie einen Gegenstand auf den richtigen Hindernissensor.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-11": "Sie können auf Cog Animationen erstellen, indem Sie mehrere miteinander verbundene Farbauswahlblöcke verwenden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-12": "Die Animation bestand aus 9 <b>Frames</b>, die sich jeweils in einem separaten Colorpicker-Block befanden, mit einem Block zum Ausschalten der LEDs am Ende.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-14": "Können Sie eine Animation erstellen, die sich reibungslos ändert, wenn Sie Cog von einem Objektsensor auf den anderen bewegen?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-15": "Bisher hat Cog immer erkannt, ob die Taste gedrückt wurde oder nicht, wenn wir sie verwendet haben.<br /><br />Wir nennen diese Art von Information einen <b>Booleschen Wert</b> – etwas, das entweder wahr oder falsch ist.<br /><br />Wir können uns den Knopf nicht nur als Booleschen Eingang vorstellen, sondern ihn auch als <b>analogen</b> Eingang verwenden – einen, der viele verschiedene Werte haben kann.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-16": "Gehen Sie zur Kategorie <b>Sensorik</b> und aktivieren Sie das Kontrollkästchen neben dem Block <b>Tastenkraftwert %</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-17": "Es erscheint ein Monitor, der den Wert des Tastenkraftsensors anzeigt.<br /><br />Wenn Sie die Taste drücken, ändert sich der Wert.<br /><br />Verwenden wir diesen Wert, um die Farbe der Lichter am Zahnrad zu ändern, wenn Sie die Taste stärker drücken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-18": "Gehen Sie zur Kategorie <b>Ereignisse</b> und fügen Sie einen <b>Wenn Flagge angeklickt</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-19": "Gehen Sie nun zur Kategorie <b>Steuerung</b> und fügen Sie eine <b>Endlosschleife</b> hinzu.<br /><br />Im Gegensatz zur <b>Wiederholungsschleife</b>, die nur eine bestimmte Anzahl von Malen wiederholt wurde, läuft die <b>Endlosschleife</b> so lange, bis Sie die rote Stopptaste drücken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-21": "Ziehen Sie nun den Block mit der Aufschrift <b>Farbton [360] Sättigung [100] Helligkeit [100]</b> an die Stelle für die Farbe im Block <b>[Ring]-LEDs auf [Farbe] einstellen</b>.<br /><br />Es gibt verschiedene Möglichkeiten, Farben zu beschreiben, und Farbton, Sättigung und Helligkeit (oder Wert) ist eine davon.<br /><br />Mit diesen drei Zahlen können wir jede Farbe beschreiben.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-22": "Der <b>Farbton</b> ist eine Zahl zwischen 0 und 360 (wie die Gradzahl auf einem Kreis), die angibt, welche Grundfarbe wir wollen.<br /><br />Er kann in einem Kreis angezeigt werden – und das haben Sie bereits bei der Verwendung des Farbwählers gesehen!<br /><br />0 Grad steht oben und stellt Rot dar. 90 Grad ist ein Grüngelb, 180 Grad ist ein Cyanblau, 270 Grad ist Lila und 360 Grad ist wieder Rot!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-23": "Die <b>Sättigung</b> gibt an, wie lebendig die Farbe sein soll.<br /><br />In diesem Beispiel für einen Farbton von 360 ist eine Sättigung von 100 das röteste Rot, das es gibt.<br /><br />Eine Sättigung von 0 entspricht Weiß – dem geringsten Rot, das es gibt.<br /><br />Und eine Sättigung von 50 liegt in der Mitte – Rosa.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-24": "Schließlich gibt die <b>Helligkeit</b> (oder Helligkeit oder Wert) an, wie hell die Farbe sein soll.<br /><br />In diesem Beispiel mit einem Farbton von 360 und einer Sättigung von 100 ergibt eine Helligkeit von 100 wieder das röteste Rot.<br /><br />Eine Helligkeit von 0 ergibt überhaupt kein Rot – in diesem Fall würde die LED auf Cog einfach ausgeschaltet!<br /><br />Eine Helligkeit von 50 liegt in der Mitte – ein dunkles Rot.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-25": "Lass uns den <b>Button Force</b> verwenden, um einen dieser Werte festzulegen!<br /><br />Gehe zurück zur Kategorie <b>Sensorik</b> und ziehe den Block <b>Button Force Wert</b> in den Bereich „Helligkeit“ im Block <b>Farbton, Sättigung, Helligkeit</b>.<br /><br />Füge außerdem am Ende der Endlosschleife eine <b>Warte 0,1 Sekunden</b> hinzu, damit sich die Lichter nicht zu schnell ändern.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-27": "Probieren Sie es aus! Wenn Sie den Knopf drücken, leuchten die LEDs immer heller rot!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-28": "Versuchen Sie es mit der Tastenkrafteinstellung der Sättigung statt der Helligkeit.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-31": "Stellen Sie es so ein, dass der Tastendruckwert mit 3,6 multipliziert wird.<br /><br />Das bedeutet, dass wir statt Zahlen von 0 bis 100 Zahlen von 0 bis 360 (3,6 x 100) erhalten.<br /><br />Probieren Sie es aus!<br /><br />Wenn Sie jetzt die Taste drücken, ändert sich die Farbe der Lichter von Rot über Grün zu Blau und wieder zurück zu Rot!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-32": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-34": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-35": "Notieren Sie sich den normalen Umgebungslichtwert.<br /><br />Nehmen Sie dann eine Taschenlampe, leuchten Sie damit auf Cog und notieren Sie sich die Werte, die Sie erhalten.<br /><br />Wahrscheinlich erreichen Sie den Maximalwert, den der Sensor liefern kann – 4095!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-36": "Gehen Sie zur Kategorie <b>Steuerung</b> und fügen Sie unter dem Block <b>Wenn Flagge angeklickt</b> einen Block <b>Warten bis</b> hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-37": "Gehen Sie als Nächstes zu <b>Operatoren</b> und fügen Sie einen <b>größer als</b>-Block in den <b>warte bis</b>-Block ein.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-38": "Gehen Sie zurück zur Kategorie <b>Erfassung</b> und ziehen Sie den Block <b>Umgebungslichtwert</b> auf die linke Seite des Blocks <b>&gt;</b>.<br /><br />Ändern Sie die rechte Seite in eine Zahl, die nur erreicht wird, wenn Sie Cog mit einer Taschenlampe anleuchten.<br /><br />Sie müssen nicht die Höchstzahl eingeben, sondern nur eine, die höher ist als die, die Sie ohne Taschenlampe sehen.<br /><br />Hier habe ich 1500 ausgewählt, daher lautet die gesamte Zeile <b>Warten, bis Umgebungslichtwert > 1500</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-39": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-41": "Lassen Sie uns dafür sorgen, dass die Lichter von Cog allmählich angehen, wenn es eine Taschenlampe erkennt.<br /><br />Dazu verwenden wir wieder eine Variable!<br /><br />Gehen Sie zur Kategorie <b>Variablen</b> und erstellen Sie eine Variable namens <b>Helligkeit</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-42": "Füge am Anfang des Codes einen Block hinzu, der die Helligkeit auf 0 setzt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-43": "Fügen Sie nun einen Block <b>Wiederholen bis</b> unter dem Block <b>Warten bis</b> hinzu und lassen Sie ihn den Block <b>[Ring]-LEDs auf [Farbe] einstellen</b> umgeben.<br /><br />Sie finden den Block <b>Wiederholen bis</b> in der Kategorie <b>Steuerung</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-44": "Ändern Sie die Variable <b>Helligkeit</b>, die Sie gerade erstellt haben, so, dass die Zeile lautet: <b>Wiederholen, bis Helligkeit > 100</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-45": "Fügen Sie nun einen <b>Ändere Helligkeit um 10</b>-Block innerhalb des <b>Wiederhole bis</b>-Blocks ein.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-46": "Ändern Sie den Block <b>[Ring]-LEDs auf [Farbe] einstellen</b>, um einen Block <b>Farbton, Sättigung, Helligkeit</b> zu verwenden.<br /><br />Verwenden Sie die Variable <b>Helligkeit</b> für die Helligkeit.<br /><br />Ändern Sie außerdem die Farbe in ein schönes Blau, indem Sie den Farbton auf 180 einstellen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-47": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-48": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-49": "Probieren Sie es aus!<br /><br />Klicken Sie auf die grüne Flagge, um den Code auszuführen.<br /><br />Wenn Sie jetzt mit einer Taschenlampe auf Cog leuchten, gehen die Lichter nach und nach an!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-50": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-51": "Fügen Sie nun einen weiteren <b>Wiederholen bis</b>-Block hinzu und wiederholen Sie ihn, bis die Helligkeit kleiner als (<) 0 ist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-52": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-53": "Dieser Code funktioniert fast, aber findest du den Fehler?<br /><br />Die Helligkeit nimmt immer weiter zu, anstatt abzunehmen!<br /><br />Ändere den Code so, dass er <b>Helligkeit um -5 ändern</b> lautet.<br /><br />Die <b>-5</b> subtrahieren jedes Mal 5 von der Helligkeitsvariablen.<br /><br />Dadurch werden die Lichter mit halber Geschwindigkeit ausgeblendet, mit der sie eingeblendet wurden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-54": "Probier es aus! Wenn du jetzt die Taschenlampe wegnimmst, erlöschen die Lichter auf Cog wieder!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-55": "Wir sorgen dafür, dass Sie nicht jedes Mal auf die grüne Flagge klicken müssen, wenn Cog reagieren soll.<br /><br />Fügen Sie eine <b>Endlosschleife</b> hinzu, sodass sie nach dem Block <b>Alle LEDs ausschalten</b> beginnt und den gesamten anderen Code umgibt.<br /><br />Jetzt reagiert Cog so lange auf helles Licht, bis Sie auf das rote Stoppschild drücken!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-56": "Gut gemacht – Sie haben eine Menge gelernt!<br /><br />Sie haben gelernt, wie man Animationen aus vielen einzelnen Frames erstellt.<br /><br />Sie haben gelernt, wie man Cog auf die Objektsensoren reagieren lässt.<br /><br />Wir haben etwas über analoge Werte gelernt, die variieren können, und haben die Lichter an Cog verwendet, um anzuzeigen, wie stark der Knopf gedrückt wurde.<br /><br />Wir haben gelernt, wie man Farben mithilfe von Farbton, Sättigung und Helligkeit (oder Wert) beschreibt.<br /><br />Wir haben außerdem gelernt, wie man den Lichtsensor an Cog verwendet, und ein wirklich schnelles Experiment durchgeführt, um einige Messwerte vom Sensor zu erfassen, die uns beim Schreiben unseres Codes helfen.<br /><br />Mithilfe von <b>Warten bis</b>-, <b>Wiederholen bis</b>-Blöcken, Variablen und Vergleichsoperatoren haben wir Cog dazu gebracht, auf helles Licht zu reagieren!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-57": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.name": "Wasserwaage",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.description": "Lasst uns noch etwas Nützliches mit Cog bauen! <br /><br />Dieses Mal nutzen wir Cogs Neigungssensor, um eine Wasserwaage zu bauen – etwas, das anzeigt, ob etwas waagerecht steht oder kippt. <br /><br />Viele Wasserwaagen funktionieren nur in einer Dimension, aber wir machen unsere zweidimensional!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-1": "<b>Lasst uns eine Wasserwaage bauen</b>, die anzeigt, ob etwas waagerecht oder geneigt ist!<br /><br />Wir verwenden die Neigungserkennung von Cog, um sie in zwei Dimensionen zum Laufen zu bringen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-2": "Stellen Sie zunächst sicher, dass Sie mit einem Zahnrad verbunden sind.<br /><br />Falls nicht, fügen Sie eines hinzu, wie im letzten Tutorial, indem Sie im Gerätebereich auf die Schaltfläche „Hinzufügen“ klicken, ein Zahnrad auswählen und dann auf „Verbinden“ klicken. Springen Sie bei Bedarf zurück zum letzten Tutorial, um zu sehen, wie",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-4": "Gehen Sie nun zur Kategorie <b>Looks</b> und fügen Sie einen <b>Set-LEDs mit Hilfe des Farbwählers</b>-Blocks hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-5": "Klicken Sie auf das Symbol <b>Licht aus</b>, um alle Lichter auszuschalten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-7": "Fügen Sie einen weiteren <b>bei Neigung [links]</b>-Block aus der Kategorie „Steuerung“ hinzu und ändern Sie ihn so, dass er <b>bei Neigung [rechts]</b> lautet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-8": "Verbinden Sie diesen Block <b>bei Neigung [rechts]</b> mit einem anderen Block <b>mithilfe des Farbwählers LEDs einstellen</b> und stellen Sie ihn so ein, dass nur die LED auf der rechten Seite leuchtet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-9": "Probieren Sie es aus!<br /><br />Kippen Sie das Zahnrad nach links und rechts.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-11": "Zum Schluss fügen Sie einen vierten Satz Blöcke hinzu und stellen Sie ihn so ein, dass er bei Neigung [vorwärts] eingeschaltet wird und die LED an der Vorderseite des Zahnrads aktiviert wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-13": "Lass uns diese Informationen auch auf dem Bildschirm anzeigen!<br /><br />Gehe zur Kategorie <b>Sensorik</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-17": "Klicken Sie dann auf die Schaltfläche, um <b>ein neues Diagramm hinzuzufügen</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-18": "Und wählen Sie Ihr Zahnrad aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-21": "Kippen Sie das Zahnrad und beobachten Sie, wie sich die Werte für die X-Achse und die Y-Achse ändern.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-22": "Klicken Sie auf die Schaltfläche <b>x</b>, um das Sensor-Dashboard zu schließen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-23": "Lass uns etwas Wissenschaft betreiben! Du brauchst etwas Papier, um dir Notizen zu machen.<br /><br />Kippe das Zahnrad nach rechts und notiere dir die Werte der Beschleunigungssensoren ax und ay.<br /><br />Mach dann dasselbe für die Neigung nach vorne, hinten und links.<br /><br />Wir werden diese Daten gleich verwenden!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-24": "Gehen Sie nun zur Kategorie <b>Variablen</b> und erstellen Sie zwei Variablen namens <b>ax</b> (für Beschleunigungsmesser x) und <b>ay</b> (für Beschleunigungsmesser y).",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-26": "Gehen Sie nun zur Kategorie <b>Events</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-27": "Fügen Sie innerhalb der Endlosschleife einen <b>Broadcast [message1]</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-28": "Geben wir der Nachricht einen aussagekräftigeren Namen. Wählen Sie dazu <b>Neue Nachricht</b> aus dem Dropdown-Menü.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-29": "Geben Sie der neuen Nachricht dann den Namen <b>Position aktualisieren</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-31": "Klicken Sie auf die Schaltfläche <b>Sprite hinzufügen</b> und wählen Sie das Sprite <b>Ball</b> (oder ein beliebiges anderes Sprite) aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-32": "Dein Code wird verschwinden! Keine Sorge – er ist noch da, nur jetzt mit dem Zahnradsymbol anstatt mit diesem Sprite verknüpft.<br /><br />Gehe zur Kategorie <b>Ereignisse</b> und füge einen <b>Wenn ich [Position aktualisieren] erhalte</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-33": "Ändern Sie es so, dass dort steht: <b>Wenn ich [Position aktualisieren] erhalte</b> – das ist die Nachricht, die wir gerade erstellt haben.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-34": "Gehen Sie nun zur Kategorie <b>Bewegung</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-35": "Fügen Sie einen <b>Gehe zu x: [] y: []</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-36": "Die Bildschirmmitte hat die Koordinaten [0,0].<br /><br />Koordinaten rechts von der Mitte haben x-Werte größer als 0.<br />Koordinaten links von der Mitte haben x-Werte kleiner als 0.<br />Koordinaten oberhalb der Mitte haben y-Werte größer als 0.<br />Koordinaten unterhalb der Mitte haben y-Werte kleiner als 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-38": "Wir müssen die Zahl auch vergrößern, indem wir sie multiplizieren.<br /><br />Gehen Sie zur Kategorie <b>Operatoren</b> und ziehen Sie einen <b>Multiplikationsblock</b> in das x-Koordinatenfeld.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-39": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-41": "Sie sollten sehen, dass sich <b>ax</b> geändert hat – also verwenden wir das, um die y-Koordinate festzulegen.<br /><br />Fügen Sie einen weiteren Multiplikationsblock hinzu und platzieren Sie die Variable <b>ax</b> darin.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-42": "Aber es gibt ein Problem! Wir möchten, dass sich das Sprite nach oben bewegt, wenn Sie das Zahnrad nach vorne kippen, was bedeuten würde, dass es eine Y-Koordinate über 0 benötigt.<br /><br />Aber als Sie das Zahnrad nach vorne kippten, war der Y-Wert unter 0!<br /><br />Um das zu beheben, müssen wir es mit <b>-100</b> statt mit <b>100</b> multiplizieren. Das zusätzliche Minuszeichen ändert den Wert von unter 0 auf über 0 und umgekehrt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-43": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-44": "Drücke nun die <b>grüne Flagge</b>, um deinen Code auszuführen.<br /><br />Du solltest sehen, wie sich der Ball bewegt, wenn du das Zahnrad neigst!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-45": "Fügen wir einen Hintergrund hinter dem Ball hinzu, um besser zu verdeutlichen, was wir darstellen.<br /><br />Wählen Sie die <b>Bühne</b> aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-46": "Wählen Sie dann die Registerkarte <b>Hintergründe</b> aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-47": "Zeichnen Sie ein paar Kreise um den Mittelpunkt.<br /><br />Wenn Sie möchten, können Sie sie auch bunt gestalten!<br /><br />Tipp: Wenn Sie an einem Computer arbeiten, können Sie die Umschalttaste gedrückt halten, um sicherzustellen, dass Sie einen Kreis statt einer Ellipse erhalten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-48": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-49": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-50": "Wenn Sie in einem 45-Grad-Winkel kippen, hat der Indikator den gleichen Abstand von der Mitte, aber ax und ay liegen jetzt bei etwa 0,7. Können Sie sich vorstellen, warum das so ist?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-51": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-52": "Gut gemacht!<br /><br />Sie haben gelernt, wie Sie mit dem Neigungssensor von Cog eine Wasserwaage bauen – ein Gerät, das anzeigt, ob etwas waagerecht oder geneigt ist.<br /><br />Wir haben etwas über Sprites in der Blocks-Oberfläche gelernt und Variablen und eine Nachricht zur Kommunikation zwischen Cog und Sprite verwendet.<br /><br />Wir haben darüber nachgedacht, wie wir Daten – den Neigungsgrad in x- und y-Richtung – auf eine leicht verständliche Weise darstellen können – mithilfe von Lichtern auf Cog und der Bewegung des Sprites vor einer Anzeige im Hintergrund.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-53": "Lassen Sie Cog auch anzeigen, wenn es flach ist!<br /><br />Gehen Sie zurück zur Kategorie <b>Erfassung</b> und aktivieren Sie das Kontrollkästchen neben <b>Neigungsrichtung</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-54": "Sehen Sie, was mit der <b>Neigungsrichtung</b> passiert, wenn Sie Cog bewegen.<br /><br />Wenn es fast flach ist, ist die Neigungsrichtung <b>keine</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-55": "Fügen Sie diesen Code hinzu.<br /><br />Er verwendet einige neue Blöcke.<br /><br />Der <b>if … else</b>-Block funktioniert ähnlich wie der zuvor verwendete <b>if</b>-Block. Wenn die Bedingung wahr ist, wird der Code im if-Teil ausgeführt. Ist die Bedingung falsch, wird stattdessen der Code im else-Teil ausgeführt.<br /><br />Mithilfe des <b>if … else</b>-Blocks können wir alternativen Code schreiben, der nur ausgeführt wird, wenn die Bedingung nicht wahr ist.<br /><br />Der andere neue Block ist ein <b>=</b>-Block. Dies ist eine weitere Art von Vergleichsoperator – er vergleicht zwei Dinge. Hier vergleichen wir den Neigungssensor mit dem Wort „keine“.<br /><br />Stimmt die Neigungsrichtung exakt mit dem Wort „keine“ überein, ist die Bedingung erfüllt, die LED der Taste leuchtet grün und die LEDs des Rings sind aus!<br /><br />Ist die Neigungsrichtung ein anderer Wert als „keine“, bleibt die LED der Taste aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-56": "Probier es aus!<br /><br />Jetzt erhältst du auch auf Cog ein Signal, wenn es waagerecht steht 🙂",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.name": "Lasst uns ein Skispiel machen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-1.2": "Stellen Sie zunächst sicher, dass Sie mit einem Zahnrad verbunden sind.<br /><br />Falls nicht, fügen Sie eines hinzu, wie im letzten Tutorial, indem Sie im Gerätebereich auf die Schaltfläche „Hinzufügen“ klicken, ein Zahnrad auswählen und dann auf „Verbinden“ klicken. Springen Sie bei Bedarf zurück zum letzten Tutorial, um zu sehen, wie",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-2": "Gehen Sie zur Kategorie „Ereignisse“ und fügen Sie einen Block <b>Bei erkanntem Objekt [links]</b> hinzu.<br /><br />Wir verwenden dies als unsere Startschaltfläche.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-4": "Gehen Sie zur Kategorie „Variablen“ und erstellen Sie eine Variable namens <b>ay</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-6": "Fügen Sie einen Block <b>Broadcast [Nachricht 1]</b> hinzu und stellen Sie ihn so ein, dass er eine <b>Neue Nachricht</b> mit dem Namen <i>Position aktualisieren</i> sendet.<br /><br />Wir verwenden dies als Signal, um unser Sprite zu bewegen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-8": "Klicken Sie auf die Schaltfläche, um einen Sprite zum Hinzufügen auszuwählen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-9": "Fügen Sie das Sprite <b>Pinguin 2</b> hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-10": "Wenn der Pinguin-Sprite ausgewählt ist, füge einen <b>wenn ich [start] erhalte</b>-Block aus der Kategorie Ereignisse hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-11": "Gehen Sie zur Kategorie „Looks“ und fügen Sie einen Block <b>Größe auf [100] % festlegen</b> hinzu.<br /><br />Ändern Sie die Größe auf 20 %.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-12": "Gehen Sie zurück zur Kategorie „Ereignisse“ und fügen Sie einen Block <b>Wenn ich [Position aktualisieren] erhalte</b> hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-13": "Gehe zur Kategorie „Bewegung“ und füge einen <b>Gehe zu x: [] y: []</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-14": "Ändern Sie es in <b>Gehe zu x: [[ay] x 200] y:0</b>.<br /><br />Sie müssen einen <b>Multiplikationsblock (*)</b> aus der Kategorie „Operatoren“ und die Variable <b>ay</b> aus der Kategorie „Variablen“ verwenden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-15": "Probier es aus!<br /><br />Decke den linken Objektsensor ab, um das Spiel zu starten, und neige dann das Zahnrad nach links und rechts, um den Pinguin nach links und rechts zu bewegen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-16": "Fügen wir einige Hindernisse hinzu!<br /><br />Fügen Sie das Sprite <b>Tree1</b> hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-17": "Wenn der Baum-Sprite ausgewählt ist, füge einen <b>wenn ich [start] erhalte</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-18": "Fügen Sie aus der Kategorie „Aussehen“ einen <b>set size to [30]%</b>-Block und einen <b>hide</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-22": "Fügen Sie nun einen Block <b>Wenn ich als Klon starte</b> hinzu.<br /><br />Jeder daran angehängte Code wird ausgeführt, wenn der Klon erstellt wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-23": "Fügen Sie einen Block <b>Gehe zu x: [Wähle zufällig [-240] bis [240] y: [-200]</b> hinzu.<br /><br />Sie finden den Block <b>Wähle zufällig</b> in der Kategorie „Operatoren“.<br /><br />Dadurch wird der neue Klon des Baums an einer zufälligen Stelle am unteren Bildschirmrand gestartet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-24": "Füge einen <b>Gleitblock [1] Sek. zu: x[] y:[]</b> hinzu.<br /><br />Der Gleitblock bewirkt eine sanfte Bewegung über einen bestimmten Zeitraum.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-25": "Ändere es in <b>Gleiche [2] Sekunden zu x: [x-Position] y: [200]</b>.<br /><br />Den Block für die x-Position findest du in der Kategorie „Bewegung“.<br /><br />Dadurch bewegt sich der Baum innerhalb von 2 Sekunden vom unteren zum oberen Bildschirmrand, wobei die x-Position (die linke und rechte Position) gleich bleibt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-26": "Füge vor dem Gleitblock einen <b>Anzeigen</b>-Block aus der Kategorie „Aussehen“ hinzu.<br /><br />Der Klon ist anfangs ausgeblendet, da das Original-Sprite ausgeblendet war. Wir müssen ihn also einblenden, bevor wir ihn bewegen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-27": "Wir möchten, dass jeder Klon des Baumes verschwindet, sobald er den oberen Bildschirmrand erreicht.<br /><br />Fügen Sie dazu einen <b>Diesen Klon löschen</b>-Block aus der Kategorie „Steuerung“ unter dem Gleitblock hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-28": "Probieren Sie es aus!<br /><br />Jede Sekunde erscheint ein neuer Baum und wandert über den Bildschirm nach oben.<br /><br />Um das Programm zu beenden, drücken Sie das rote Stoppsymbol.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-30": "Fügen Sie innerhalb der Endlosschleife einen <b>if [] then</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-31": "Ändere es in <b>wenn [Pinguin 2 berührt, dann</b>.<br /><br />Den Berührungsblock findest du in der Kategorie „Sensorik“. Dort kannst du Pinguin 2 aus dem Dropdown-Menü auswählen.<br /><br />Diese Bedingung ist erfüllt, wenn der Baum den Pinguin berührt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-32": "Füge innerhalb der if-Bedingung einen <b>stop [all]</b>-Block hinzu.<br /><br />Dadurch wird das Spiel beendet, wenn der Pinguin gegen einen Baum stößt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-33": "Probier es aus!<br /><br />Decke den linken Objektsensor ab, um das Spiel zu starten, und neige Cog, um den Pinguin so zu steuern, dass er den Bäumen ausweicht.<br /><br />Sobald du einen Baum berührst, ist das Spiel beendet!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-34": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-35": "Wenn der Baum-Sprite noch ausgewählt ist, füge nach dem Block „wenn ich [start] erhalte“ einen <b>set [score] to [0]</b>-Block ein.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-36": "Füge zwischen den Blöcken „glide“ und „delete this clone“ einen Block „change [core] by [1]“ ein.<br /><br />Dadurch erhöht sich die Punktzahl für jeden erfolgreich vermiedenen Baum um 1.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-37": "Lasst uns das Spiel im Laufe der Zeit schwieriger gestalten.<br /><br />Füge eine weitere Variable namens <b>Verzögerung</b> hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-38": "Füge diese Blöcke zusammen mit den anderen für den Baum-Sprite hinzu.<br /><br />Beim Spielstart ist die Verzögerung auf 1 eingestellt.<br /><br />Anschließend wird die Verzögerung alle 5 Sekunden auf ¾ (drei Viertel) des vorherigen Wertes reduziert.<br /><br />Sie verringert sich von 1 Sekunde auf 0,75 Sekunden (drei Viertel einer Sekunde), dann auf 0,56 Sekunden (etwas mehr als eine halbe Sekunde), dann auf 0,42 Sekunden, dann auf 0,3 Sekunden usw.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-39": "Verwenden Sie nun die Verzögerungsvariable, um die Zeit zwischen dem Erstellen der Bäume festzulegen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-41": "Fügen wir ein paar Lichter an Cog hinzu, um die Sache spannender zu machen.<br /><br />Fügen Sie vor dem Block <b>Stopp [alle]</b> einen Block <b>Senden [Stopp] und Warten</b> hinzu.<br /><br />Sie müssen eine neue Nachricht namens <b>Stopp</b> erstellen.<br /><br />Der Block <b>Senden [Stopp] und Warten</b> stellt sicher, dass der Code, der ausgeführt wird, wenn die Stoppnachricht gesendet wird, beendet wird, bevor der Code fortgesetzt wird und der Block <b>Stopp [alle]</b> ausgeführt wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-42": "Zahnrad auswählen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-43": "Fügen Sie einen Block <b>Setze [Ring]-LEDs auf [Grün]</b> und einen Block <b>Setze [Ring]-LEDs auf Muster [Spin1]</b> hinzu, wie hier gezeigt.<br /><br />Dadurch drehen sich die Lichter auf Cog, wenn das Spiel beginnt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-44": "Füge einen <b>wenn ich [Stopp] erhalte</b>-Block und einen <b>um die [Ring]-LEDs auf [rot] zu setzen</b> hinzu.<br /><br />Diese sorgen dafür, dass die Lichter rot leuchten, wenn das Spiel beendet ist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-45": "Gut gemacht!<br /><br />Du hast gelernt, wie man ein Spiel in Blocks erstellt! Wir haben die Klonfunktion verwendet, um viele Kopien von Bäumen zu erstellen, denen man ausweichen muss, und Cog eine Spielfigur auf dem Bildschirm steuern lassen.<br /><br />Nächste Schritte:<ul><li>Kannst du eine andere Art von Hindernis erstellen, dem man ausweichen muss – vielleicht Felsen?</li><li>Kannst du den Pinguin springen lassen, wenn du den Knopf auf Cog drückst?</li><li>Kannst du es so einrichten, dass man über die Felsen springen kann, um Bonuspunkte zu erhalten?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.description": "Lasst uns Cog in ein Musikinstrument verwandeln!<br /><br />Wir lassen Cog Töne spielen, die sich je nach eurer Interaktion mit ihm verändern, und lernen dabei die verschiedenen Tonarten kennen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-1": "Lasst uns Cog in ein Musikinstrument verwandeln!<br /><br />Wir lassen Cog Töne spielen, die sich je nach eurer Interaktion mit ihm verändern, und lernen dabei die verschiedenen Tonarten kennen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-2": "Messen wir zunächst, was Cog „sieht“, wenn Sie mit dem Objektsensor interagieren.<br /><br />Nehmen Sie ein leeres Blatt Papier und markieren Sie mit einem Lineal alle Zentimeter zwischen 0 und 5 cm. Nummerieren Sie die Markierungen von 0 bis 5.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-4": "Notieren Sie den Wert des IR-Sensors rechts, ohne dass sich etwas davor befindet.<br /><br />Legen Sie dann Ihre Hand auf die 5-cm-Markierung und notieren Sie den nun angezeigten Wert.<br /><br />Schwankungen der Werte sind normal – versuchen Sie, einen Wert im mittleren Bereich zu notieren.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-5": "Wiederholen Sie dies mit Ihrer Hand an den Markierungen bei 4 cm, 3 cm, 2 cm, 1 cm und 0 cm.<br /><br />Am Ende sollten Sie eine Maßtabelle erhalten.<br /><br />Vielleicht fällt Ihnen auf, dass sich die Zahlen stark ändern, wenn sich Ihre Hand in der Nähe von Cog befindet, aber weniger, je weiter Ihre Hand davon entfernt ist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-6": "Lassen Sie Cog eine Note spielen, wenn die Taste gedrückt wird.<br /><br />Fügen Sie einen <b>Beim Tastendruck</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-7": "Wir verwenden den rechten IR-Sensor, um die zu spielende Note auszuwählen. Machen wir einen Schnappschuss davon, indem wir eine Variable namens <b>reading</b> erstellen und sie auf den Wert des rechten IR-Sensors setzen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-8": "Jetzt müssen wir Bedingungen verwenden, um die zu spielende Note auszuwählen.<br /><br />Wir möchten nur eine Note spielen, daher verwenden wir den <b>if…else</b>-Block.<br /><br />Fügen Sie für die Bedingung einen <b>Kleiner-als</b>-Vergleichsoperator (<) hinzu und setzen Sie ihn auf <b>Wert <[2100]</b>. Ersetzen Sie 2100 durch den Wert, den Sie gemessen haben, als sich Ihre Hand auf der 4-cm-Linie befand.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-9": "Fügen Sie einen Block <b>Startnote [C4]</b> innerhalb des if-Teils des if … else-Blocks hinzu.<br /><br />Dies ist die tiefste Note, die wir spielen werden, und wir spielen sie, wenn der Messwert des IR-Sensors niedrig ist, d. h. wenn Ihre Hand weit davon entfernt ist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-10": "Probier es aus!<br /><br />Drück den Knopf, ohne dass sich etwas vor dem Zahnrad befindet – du solltest einen Ton hören.<br /><br />Drück den Knopf erneut, während sich deine Hand einige Zentimeter vor dem Zahnrad befindet – es sollte nichts passieren, da wir stattdessen den else-Zweig der Bedingung ausgeführt haben.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-12": "Setzen Sie die Bedingung des zweiten if…else-Blocks auf <b>[Lesen] <b>2200</b>, aber verwenden Sie anstelle von 2200 den Wert, den Sie mit der Hand auf der 3-cm-Linie gemessen haben.<br /><br />Fügen Sie innerhalb des if-Teils der zweiten Bedingung einen weiteren <b>Startnote</b>-Block hinzu und legen Sie fest, dass dieser die Note <b>D4</b> spielt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-13": "Machen Sie das noch zweimal, sodass Sie am Ende vier if … else-Blöcke haben.<br /><br />Sie können dies schneller tun, wenn Sie mit der rechten Maustaste klicken oder den letzten if… else-Block gedrückt halten und die Option <b>Duplizieren</b> auswählen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-15": "Ändere die dritte Note zu <b>E4</b>.<br /><br />Ändere die vierte Note zu <b>G4</b>.<br /><br />Vielleicht ist dir aufgefallen, dass wir eine Note übersprungen haben! Wir spielen nur fünf Noten und wählen diese aus der sogenannten pentatonischen C-Dur-Tonleiter.<br /><br />Pentatonisch bedeutet, dass eine Oktave fünf Noten enthält, und C ist die Tonart. Eine Tonart gibt die Vorzeichen (Kreuze und Bs) an, die in einem Lied verwendet werden – das sind die schwarzen Tasten auf dem Klavier.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-16": "Nun ist es Zeit für die fünfte Note.<br /><br />Es ist nicht nötig, einen weiteren if…else-Block zu verwenden, da dies die einzige verbleibende Option ist!<br /><br />Fügen Sie einen <b>Startnote [A4]</b>-Block in den else-Teil der letzten if…else-Bedingung ein.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-17": "Probieren Sie es aus!<br /><br />Können Sie Cog dazu bringen, alle 5 Noten zu machen?<br /><br />Sie können die Zahlen ein wenig ändern, wenn Sie Anpassungen vornehmen möchten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-18": "Lassen Sie Cog aufhören, die Note zu spielen, wenn Sie aufhören, die Taste zu drücken.<br /><br />Fügen Sie nach allen if .. else-Blöcken einen <b>Warten bis [[Taste angeklickt] = [Falsch]]</b>-Block und einen <b>Töne stoppen</b>-Block hinzu.<br /><br />Sie müssen in der Kategorie „Steuerung“ nach dem „Warten bis“-Block, in der Kategorie „Operatoren“ nach dem „=“-Block, in der Kategorie „Erkennung“ nach dem „Taste angeklickt“-Block und in der Kategorie „Töne“ nach dem „Töne stoppen“-Block suchen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-19": "Versuch es noch einmal!<br /><br />Cog hört jetzt auf, den Ton zu spielen, sobald du aufhörst, den Knopf zu drücken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-20": "Es wäre lustig, wenn man die Note ändern könnte, während man die Taste gedrückt hält.<br /><br />Füge direkt nach dem Codeblock für den Tastendruck einen <b>repeat until</b>-Block ein.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-21": "Legen Sie die Bedingung im Block „Wiederholen bis“ auf <b>[[Schaltfläche angeklickt] = Falsch]</b> fest.<br /><br />Verschieben Sie den Block „Töne stoppen“</b> außerhalb der Schleife „Wiederholen bis“ und ersetzen Sie den Block „Warten bis“</b> durch einen Block „Warten [0,1] Sekunden“</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-22": "Probieren Sie es aus!<br /><br />Nehmen Sie Cog in die Hand und bewegen Sie Ihre Hand vor dem Sensor hin und her, während Sie den Knopf gedrückt halten – Sie sollten hören, wie der Ton auf und ab geht!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-23": "Wir haben Cog dazu gebracht, Noten in der Tonart C zu spielen, also sollten wir in der Lage sein, zu jedem Lied mitzuspielen, das auch in der Tonart C ist!<br /><br />Versuchen Sie zum Beispiel, zu „Let it Be“ von den Beatles mitzuspielen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-24": "Es wäre noch cooler, wenn wir Noten schneller ändern könnten, aber wir müssen sicherstellen, dass wir nicht zu viele Befehle an Cog senden und es überfordern.<br /><br />Verwenden wir Variablen, um zu verfolgen, welche Note wir spielen, und ändern wir sie nur, wenn es nötig ist.<br /><br />Erstellen Sie zwei neue Variablen namens <b>note</b> und <b>lastNote</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-25": "Ersetzen Sie jeden der <b>Startnote</b>-Blöcke durch einen <b>set [note] to [notec4]</b>-Block.<br /><br />Damit dies funktioniert, müssen Sie <b>notec4</b> exakt so eingeben. Für die anderen Noten verwenden Sie <b>noted4</b>, <b>notee4</b>, <b>noteg4</b> und <b>notea4</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-27": "Können Sie erkennen, was der kleine Fehler wäre, wenn wir den Code hier fertigstellen würden?<br /><br />Ein Fehler ist ein Fehler – in diesem Fall müssen wir noch eine Sache tun, um sicherzustellen, dass wir immer eine Note spielen, wenn die Taste gedrückt wird – und zwar die Variable lastNote löschen, wenn wir die Töne stoppen.<br /><br />Tun Sie dies, indem Sie am Ende des Codes einen Block <b>set [lastNote] to [0]</b> hinzufügen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-28": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-30": "Wie könntest du die Note sonst noch ändern?<br /><br />Wie wäre es, die Neigung des Zahnrads zu nutzen? Dann könntest du die Note ändern, indem du das Zahnrad einfach nach links und rechts drehst!<br /><br />Du kannst deinen Code ändern, um das auszuprobieren – hier ist ein kleiner Hinweis dazu:",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.name": "Uhr",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.description": "Lasst uns Cog in eine Uhr verwandeln!<br /><br />Im Ring von Cog befinden sich 12 LEDs. Wir können also Zeiger wie bei einer Uhr verwenden, um Stunden, Minuten und Sekunden anzuzeigen!<br /><br />Wir werden uns ein wenig mit der nötigen Mathematik beschäftigen und kreativ werden, um die Zeit auf verschiedene Arten anzuzeigen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-1": "Lasst uns Cog in eine Uhr verwandeln!<br /><br />Im Ring von Cog befinden sich 12 LEDs. Wir können also Zeiger wie bei einer Uhr verwenden, um Stunden, Minuten und Sekunden anzuzeigen!<br /><br />Wir werden uns ein wenig mit der nötigen Mathematik beschäftigen und kreativ werden, um die Zeit auf verschiedene Arten anzuzeigen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-2": "Fügen Sie Ihrem Code die folgenden Blöcke hinzu:<br /><br /><b>Wenn auf die grüne Flagge geklickt wird</b><ul><li>Schalte alle LEDs aus</li><li>Setze LED [1] auf [rot]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-3": "Gehen Sie zur Kategorie „Sensorik“ und ziehen Sie den Block „Aktuelles [Jahr]“ in den Codierungsbereich.<br /><br />Ändern Sie ihn in „Aktuelle [Stunde]“ und klicken Sie darauf.<br /><br />Genau wie die Sensoren auf Cog ihren Wert ändern, ändert sich auch dieser Block, um die aktuelle Uhrzeit anzuzeigen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-4": "Die Blocks-Oberfläche verwendet, wie die meisten Computer, eine 24-Stunden-Uhr.<br /><br />Morgens liegt die aktuelle Stunde zwischen 0 und 11.<br /><br />Nachmittags liegt sie zwischen 12 und 23.<br /><br />Normale analoge Uhren verwenden hingegen eine 12-Stunden-Uhr mit zwei 12-Stunden-Abschnitten (vormittags und nachmittags) pro 24-Stunden-Tag.<br /><br />Da Cog 12 LEDs im Ring hat, verwenden wir ebenfalls eine 12-Stunden-Uhr. Wie können wir die Uhrzeit in der Blocks-Oberfläche von 24-Stunden- auf 12-Stunden-Format umstellen?<br /><br />Wir könnten prüfen, ob die Stunde größer als 11 ist, und in diesem Fall 12 subtrahieren.<br /><br />Alternativ könnten wir den Modulo-Operator verwenden, der den Rest einer Division liefert.<br /><br />Wenn wir hier 17 durch 12 teilen, erhalten wir 1 Rest 5 (oder 1r5). 17:00 Uhr im 24-Stunden-Format entspricht 17:00 Uhr im 12-Stunden-Format – das passt also!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-8": "Für unsere Uhr möchten wir jedoch nicht, dass der Minutenzeiger zur nächsten Position weitergeht, bis er vollständig dort steht. Um 17:09 Uhr soll der Minutenzeiger beispielsweise immer noch auf der Position „1“ stehen.<br /><br />Dazu müssen wir immer abrunden. In Blöcken gibt es eine Möglichkeit, dies zu tun – mit dem Operator <b>floor</b>. Sie finden ihn in der Dropdown-Liste unter dem Operator, der standardmäßig <b>[abs]</b> lautet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-9": "Füge einen Block hinzu, um <b>LED [[floor] von [[current [minute]] / [5]] auf [blue] zu setzen</b>.<br /><br />Probiere es aus! Drücke die grüne Flagge und Cog zeigt nun den Minutenzeiger als blaues Licht und den Stundenzeiger als rotes Licht an.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-10": "Wie würden Sie auch die Sekunden anzeigen?<br /><br />Fügen Sie einen weiteren Block <b>LED einstellen</b> hinzu, aber stellen Sie diesmal die LED <b>[[Boden] von [[aktuelle [Sekunde]] / [5]] auf [grün] ein</b>.<br /><br />Denken Sie daran, dass Sie mit der rechten Maustaste auf einen Block klicken oder ihn gedrückt halten können, um die Option zum Duplizieren zu erhalten – das kann viel Zeit sparen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-11": "Probieren Sie es aus!<br /><br />Jetzt erhalten Sie drei „Zeiger“ auf der Uhr – rot für Stunden, blau für Minuten und grün für Sekunden!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-12": "Sorgen wir dafür, dass die Zeit automatisch aktualisiert wird. Fügen Sie eine <b>forever</b>-Schleife und einen <b>wait[5]seconds</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-13": "Probieren Sie es aus!<br /><br />Jetzt wird die Uhrzeit alle 5 Sekunden aktualisiert und die Zeiger bewegen sich im Kreis!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-15": "Probieren Sie es aus!<br /><br />Jetzt werden die Stunden, Minuten und Sekunden nacheinander angezeigt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-17": "Probieren Sie es aus!<br /><br />Ihre Uhr zeigt Ihnen jetzt durch einen Farbwechsel an, ob es Vormittag oder Nachmittag ist!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-18": "Wie könnten wir die Uhrzeit sonst noch anzeigen?<br /><br />Dieser Code zeigt die Stunde an, indem er alle LEDs von der 12-Uhr-Position bis zur aktuellen Stunde einschaltet – je später es wird, desto mehr LEDs leuchten auf.<br /><br />Löschen Sie Ihren vorherigen Uhrencode und probieren Sie ihn aus!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-19": "Wenn Sie Freunde haben, die auch ein Cog haben, können Sie drei davon verwenden, um die Zeit anzuzeigen – eines für Stunden, eines für Minuten und eines für Sekunden, so wie hier?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-21": "Probieren Sie es aus!<br /><br />Die LEDs leuchten mit der Zeit langsam auf – in diesem Bild zeigt unsere Uhr beispielsweise halb sieben an!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-22": "Wenn Sie Zeit haben, können wir versuchen, unsere Originaluhr raffinierter zu gestalten.<br /><br />Wir können den Sekundenzeiger so animieren, dass er jede Sekunde blinkt, etwa so – dann macht es nichts, wenn er die anderen Zeiger verdeckt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-23": "Dazu verwenden wir eine Liste, um die Farbe jeder LED festzuhalten.<br /><br />Gehen Sie zur Kategorie <b>Variablen</b> und klicken Sie auf die Schaltfläche <b>Liste erstellen</b>, um eine Liste mit dem Namen <b>LEDs</b> zu erstellen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-24": "Listen sind spezielle Variablen, die eine geordnete Liste einzelner Variablen enthalten können.<br /><br />Löschen Sie Ihren vorherigen Code und fügen Sie die im Bild gezeigten Blöcke hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-25": "Drücken Sie die grüne Flagge, um den Code auszuführen. Die Liste <b>leds</b> erhält 12 Farbcodes – einen für jede LED auf dem Zahnrad.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-26": "Erstellen Sie zwei neue Variablen mit den Namen <b>Stunde</b> und <b>Minute</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-27": "Fügen Sie Blöcke hinzu, um diese Variablen auf die Positionen der Stunden- und Minutenzeiger einzustellen. Verwenden Sie dabei die gleiche Mathematik wie zuvor.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-28": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-29": "Versuchen Sie, den Code durch Drücken der grünen Flagge auszuführen.<br /><br />Die Liste wird nun mit unterschiedlichen Farbcodes für Stunden- und Minutenzeiger aktualisiert.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-31": "Ok, wir haben jetzt eine Liste mit den Farben, die wir auf den LEDs von Cog anzeigen möchten – es ist Zeit, sie anzuzeigen!<br /><br />Erstellen Sie eine weitere Variable namens <b>ledID</b> und verwenden Sie sie in einer Schleife, um die 12 LEDs von Cog einzustellen.<br /><br />Um die verschiedenen Farben einzustellen, beziehen wir uns mithilfe des Blocks <b>item</b> auf die Elemente in der Liste <b>leds</b> – denken Sie daran, 1 hinzuzufügen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-32": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-33": "Fügen wir den Code in eine Schleife ein, damit er sich automatisch aktualisiert.<br /><br />Fügen Sie am Ende einen <b>wait until</b>-Block hinzu und lassen Sie ihn warten, bis sich der Minutenzeiger ändern muss. Dazu wird der Wert der Sollposition des Minutenzeigers mit dem Wert der Variable <b>minute</b> verglichen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-34": "Fügen Sie den Code dann in eine <b>Endlosschleife</b> ein, sodass er wiederholt ausgeführt wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-35": "Jetzt ist es Zeit, den Sekundenzeiger hinzuzufügen!<br /><br />Wir werden dies in einem parallelen Codeabschnitt tun, also fügen Sie einen weiteren Block <b>Wenn auf die grüne Flagge geklickt wird</b> hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-36": "Erstellen Sie eine weitere Variable namens <b>Sekunde</b> und legen Sie sie auf die gleiche Weise fest, wie wir zuvor die Position des Sekundenzeigers festgelegt haben.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-37": "Füge nun Blöcke hinzu, um die LED des Sekundenzeigers auf Grün zu setzen, eine Sekunde zu warten und sie dann wieder auf die Farbe aus der Liste `<b>leds</b>` zurückzusetzen.<br /><br />So merken wir uns, welche Farbe die LED nach dem Ändern haben soll. Die Liste `<b>leds</b>` dient dazu, den Zustand des Stunden- und Minutenzeigers unserer Uhr zu speichern.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-39": "Ihr Code sollte jetzt so aussehen – probieren Sie es aus!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-40": "Gut gemacht!<br /><br />Du hast viel Mathematik verwendet, um mit Cog eine Uhr zu bauen! Du hast über verschiedene Möglichkeiten nachgedacht, wie du die Zeit anzeigen könntest.<br /><br />Wenn du es bis zum Ende geschafft hast, hast du auch etwas über Listen gelernt, mit denen du geordnete Informationen speichern kannst, wie z. B. den Status jeder LED auf Cog.<br /><br />Nächste Schritte:<ul><li>Kannst du dafür sorgen, dass diese neue Uhr die Hintergrundfarbe ändert, je nachdem, ob es vormittags oder nachmittags ist?</li><li>Wäre es sinnvoller, wenn sich der Sekundenzeiger tatsächlich alle 5 Minuten einmal drehen würde, um die Zeit genauer anzuzeigen? Was würdest du ändern, um das zu erreichen?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.name": "Stützrad",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.description": "Lasst uns ein Laufrad basteln!<br /><br />Das ist ein besonderes Rad, das die zurückgelegte Strecke misst!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-1": "In früheren Aktivitäten haben wir gesehen, wie wir den Beschleunigungsmesser am Cog verwenden können, um zu messen, in welche Richtung sich das Cog neigt.<br /><br />Wir können diesen Sensor auch verwenden, um den Winkel zu ermitteln, in dem sich das Cog befindet.<br /><br />Wir werden das verwenden, um das Cog in ein Messrad zu verwandeln – das ist ein Gerät zum Messen von Entfernungen, indem man ein Rad entlang der Entfernungen rollt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-2": "Fügen Sie einen <b>Wenn auf die grüne Flagge geklickt wird</b>-Block und eine <b>Endlosschleife</b> hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-3": "Erstelle eine Variable namens <i>angle</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-6": "Probieren Sie es aus!<br /><br />Drücken Sie auf die grüne Flagge, halten Sie Cog dann vertikal, sodass der gelbe Pfeil nach oben zeigt, und drehen Sie es wie ein Lenkrad.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-7": "Wenn Sie das Zahnrad im Uhrzeigersinn drehen, sehen Sie, dass sich der Winkel von 0 Grad, wenn das Zahnrad nach oben zeigt, auf 180 Grad, wenn das Zahnrad nach unten zeigt, ändert.<br /><br />Er springt dann auf -180 Grad, bevor er wieder auf 0 Grad ansteigt, wenn Sie weiter im Uhrzeigersinn drehen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-8": "Für unser Drehrad wäre es ideal, wenn es von 0 bis 360 Grad hochzählen würde.<br /><br />Füge diese Blöcke in die <b>Endlosschleife</b> ein:<ul><li><b>Wenn</b> [[Winkel] < [0]] dann</li><ul><li>Ändere [Winkel] um [360]</li></ul></ul><br />Anstatt -180 Grad wird unser Winkel nun auf +180 Grad gesetzt.<br /><br />Er erhöht sich von dort bis 360 Grad und springt dann wieder auf 0 Grad zurück.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-9": "Probier es aus!<br /><br />Wenn du das Zahnrad drehst, bewegt sich der Winkel von 0 bis 360 Grad und wiederholt sich dann.<br /><br />Diese Rechnung funktioniert, weil 360 Grad einer vollen Umdrehung entsprechen. Wenn wir also weitere 360 ​​Grad zur Drehung hinzufügen, zeigen wir am Ende in dieselbe Richtung, aber mit einem positiven Winkel, der das Zählen der Umdrehungen erleichtert.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-10": "Fügen wir ein Sprite auf dem Bildschirm hinzu, um die Rotation von Cog anzuzeigen.<br /><br />Wählen Sie im Menü <i>Sprite auswählen</i> die Option <i>malen</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-11": "Lass uns ein Sprite zeichnen, das Cog darstellt!<br /><br />Füge zunächst einen Kreis hinzu und verwende dann das Linienwerkzeug, um ein Sechseck darum zu zeichnen.<br /><br />Der Kreis ist nur eine Richtlinie, die uns dabei hilft, das Sechseck richtig hinzubekommen – keine Sorge, wenn dein Sechseck nicht perfekt ist!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-12": "Löschen Sie den Kreis und ersetzen Sie ihn durch einen kleineren Kreis in der Mitte, der die Schaltfläche auf Cog darstellt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-13": "Zeichnen Sie abschließend mit dem Linienwerkzeug ein Dreieck und färben Sie es gelb.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-14": "Klicken Sie auf die Registerkarte <i>Code</i>, um zum Codierungsbildschirm zurückzukehren.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-15": "Füge bei ausgewähltem Sprite folgende Blöcke hinzu:<ul><li>Wenn die grüne Flagge angeklickt wird</li><li>Für immer</li><ul><li>Zeige in Richtung [Winkel]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-17": "Um zwischen diesen verschiedenen Konventionen zu konvertieren, ändern Sie den Code so, dass er 90 Grad zum Winkel addiert.<br /><br />Versuchen Sie es erneut, und die Bewegung des Zahnrad-Sprites entspricht der Ihres realen Zahnrads!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-18": "Wählen Sie Cog erneut aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-19": "Fügen wir eine LED am Zahnrad hinzu, um anzuzeigen, dass die Rotationserkennung funktioniert.<br /><br />Fügen Sie zwei neue Variablen namens <i>LED</i> und <i>lastLED</i> hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-21": "Füge nun diese Blöcke innerhalb der <b>Forever-Schleife</b> hinzu:<ul><li>Wenn [nicht [[LED] = [lastLED]]] dann</li><ul><li>Setze LED [LED] auf [blau]</li><li>Setze LED [lastLED] auf [schwarz]</li><li>Setze [lastLED] auf [LED]</li></ul></ul><br />Kannst du herausfinden, wie dieser neue Codeabschnitt funktioniert und was er bewirkt?<br /><br />Wir verwenden die Variablen LED und lastLED, um zu verfolgen, welche LED leuchtet und ob wir sie ändern müssen. Wenn sich der Wert von LED von einer Iteration der Schleife zur nächsten ändert, ist die Bedingung in der if-Anweisung wahr.<br /><br />Dann schalten wir die neue LED ein und die alte aus (indem wir sie auf Schwarz setzen, was dem Ausschalten einer Lampe entspricht). Schließlich aktualisieren wir die Variable lastLED, sodass sie für den nächsten Schleifendurchlauf gesetzt ist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-22": "Probier es aus!<br /><br />Drück die grüne Flagge und dreh dann das Zahnrad.<br /><br />Du wirst feststellen, dass etwas Merkwürdiges passiert! Manchmal leuchtet die LED oben, manchmal unten!<br /><br />Das ist etwas verwirrend und nicht das, was wir beabsichtigt haben.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-23": "Wenn Sie darüber nachdenken, liegt das daran, dass sich die LED im Uhrzeigersinn dreht, während wir das Zahnrad im Uhrzeigersinn drehen.<br /><br />Was wir eigentlich wollen, nämlich dass sich die LED immer am unteren Ende des Zahnrads befindet, ist, dass sie sich in die entgegengesetzte Richtung dreht, in die wir das Zahnrad drehen.<br /><br />Wie können wir das erreichen?<br /><br />Ändern Sie Ihren Code so, dass er lautet: <b>Setze [LED] auf [[Runde [[360] - [Winkel]] / [30]] mod [12]]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-24": "Probier es aus!<br /><br />Wenn du das Zahnrad drehst, befindet sich die LED immer oben!<br /><br />Wenn wir die Variable [Winkel] von 360 subtrahieren, kehren wir effektiv die Drehrichtung um den Kreis um.<br /><br />Drehen wir uns beispielsweise 10 Grad im Uhrzeigersinn von 0 aus, befinden wir uns bei 10 Grad. Drehen wir uns 10 Grad gegen den Uhrzeigersinn von 0 aus, befinden wir uns bei 350 Grad.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-25": "Das kommt dem schon recht nahe, ist aber noch nicht ganz das, was wir uns vorgestellt haben. Es wäre intuitiver, wenn die LED unten am Zahnrad wäre, statt oben.<br /><br />Wie können wir das umsetzen?<br /><br />Im Prinzip müssen wir 6 zur LED-Variablen addieren – und genau wie das Addieren von 6 Stunden den Stundenzeiger einer Uhr um die Hälfte dreht, dreht sich der Ring aus 12 LEDs um die Hälfte, wenn wir die LED-Variablen um 6 erhöhen.<br /><br />Wir verwenden dazu den Modulo-Operator, um die Zahlen von 11 bis 0 zu durchlaufen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-26": "Probieren Sie es aus!<br /><br />Wenn Sie jetzt das Zahnrad drehen, leuchtet die LED unten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-27": "Ok! Jetzt haben wir gutes Benutzerfeedback, dass die Rotationserkennung funktioniert. Lassen Sie uns das Zahnrad die Entfernung messen!<br /><br />Für den nächsten Teil benötigen Sie einen Kartenkreis – das wird unser Rad.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-28": "Zeichnen Sie die Oberseite des Zahnrads nach und schneiden Sie dann in der Mitte des Kreises ein Sechseck aus.<br /><br />(Sie müssen nicht genau in der Mitte sein)<br /><br />Messen Sie den Durchmesser Ihres Kreises.<br /><br />Der hier hat einen Durchmesser von etwa 200 mm, was bedeutet, dass der Radius 100 mm beträgt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-29": "Setzen wir diese Zahl in unser Programm ein.<br /><br />Erstellen Sie zwei neue Variablen namens <i>Radius</i> und <i>Umfang</i>.<br /><br />Fügen Sie neue Blöcke hinzu, um sie vor der Endlosschleife festzulegen:<ul><li>Setzen Sie [Radius] auf [100]</li><li>Setzen Sie [Umfang] auf [2] * [[3,14] * [Radius]]]</li></ul><br />Ersetzen Sie die 100 durch den Radius Ihres Rads.<br /><br />Wir messen die zurückgelegte Strecke, wenn sich das Rad dreht. Jede Umdrehung des Rads legt eine Strecke zurück, die dem Umfang des Rads entspricht.<br /><br />Denken Sie daran, dass der Umfang gleich 2 * Pi * Radius ist. Hier schätzen wir Pi als 3,14.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-31": "Damit wir die Anzahl der Umdrehungen zählen können, müssen wir verfolgen, wann sich der Winkel von 360 -> 0 und umgekehrt ändert.<br /><br />Wir verwenden hierfür die Variable „lastAngle“. Wenn der Winkel von 360 auf 0 Grad wechselt, ist das Ergebnis von [Winkel] - [lastAngle] -360.<br /><br />In der Praxis wird unsere Messung wahrscheinlich von etwa 355 auf 5 Grad springen.<br /><br />Fügen Sie diese Blöcke innerhalb der <b>Endlosschleife</b> ein:<ul><li>Wenn [[Winkel] - [lastAngle] < [-180]], dann</li><ul><li>Ändere [Umdrehungen] um [1]</li></ul></ul><br />Wenn sich der Winkel also plötzlich stark verringert (180 Grad oder mehr), wissen wir, dass wir zur Anzahl der Umdrehungen 1 hinzufügen müssen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-32": "Wir müssen auch Umdrehungen in die entgegengesetzte Richtung erfassen. Dabei springt der Winkel von 0 auf 360 Grad.<br /><br />Füge diese Blöcke in die <b>Forever-Schleife</b> ein:<ul><li>Wenn [[Winkel] - [letzterWinkel]] > [180]] dann</li><ul><li>Ändere [Umdrehungen] um [-1]</li></ul></ul><br />Das bedeutet: Wenn der Winkel plötzlich stark ansteigt, verringern wir die Anzahl der Umdrehungen um 1.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-33": "Fügen Sie einen Block <b>set [lastAngle] to [angle]</b> innerhalb der <b>forever loop</b> hinzu.<br /><br />Dadurch wird die Variable lastAngle für den nächsten Durchgang der Schleife bereit gemacht.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-34": "Jetzt ist es an der Zeit, die Distanz zu berechnen, die das Rad gerollt ist!<br /><br />Fügen Sie diesen Block innerhalb der <b>Endlosschleife</b> hinzu:<ul><li>Setzen Sie [totalRotation] auf [[[Umdrehungen] * [360]] + [[Winkel]]]</li></ul><br />Dadurch werden für jede Drehung 360 Grad zur aktuellen Winkelmessung addiert, um die Gesamtdrehung zu erhalten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-36": "Probier es aus!<br /><br />Leg das Zahnrad in das Papprad und versuche, es zu rollen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-39": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-40": "Ihnen ist vielleicht aufgefallen, dass im letzten Video eine Liste mit Entfernungen vorhanden war.<br /><br />Um diese zu erstellen, klicken Sie auf die Schaltfläche <b>Liste erstellen</b> und erstellen Sie eine Liste mit dem Namen <i>Entfernungen</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-41": "Fügen Sie anschließend direkt nach dem Block „on button press“ einen <b>add [distance] to [distances]</b>-Block ein.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-42": "Probieren Sie es aus!<br /><br />Sie können Entfernungen messen und die Taste drücken, um sie in der Liste zu speichern und später auf Ihrem Bildschirm anzusehen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-43": "Gut gemacht!<br /><br />Du hast gelernt, wie man ein Zahnrad in ein Gerät zur Entfernungsmessung verwandelt! Im Alltag verwendet man Messräder, um längere Strecken zu messen. Es gibt sie mit Griffen, die man entlangrollen kann.<br /><br />Du hast mithilfe von Mathematik den gemessenen Durchmesser in einen Radius und anschließend in einen Umfang umgerechnet und diesen zusammen mit der Winkelmessung verwendet, um die Entfernung zu berechnen.<br /><br />Du hast dir viele Gedanken über Winkel gemacht und eine Variable verwendet, um die Änderung des Zahnradwinkels zu verfolgen, sowie Bedingungen, um die Änderung der Gesamtumdrehungen zu erfassen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.description": "Lasst uns ein weiteres Spiel machen!<br /><br />Dieses Mal machen wir ein Spiel über eine Flughund, die ziemlich wählerisch ist, was ihr Essen angeht.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-1": "Lasst uns ein weiteres Spiel machen!<br /><br />Dieses Mal machen wir ein Spiel über eine Flughund, die ziemlich wählerisch ist, was ihr Essen angeht.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-2": "Wir lassen die Fledermaus mithilfe der Neigungserkennung des Zahnrads wieder nach links und rechts fliegen.<br /><br />Erstelle wie zuvor eine Variable namens <b>ay</b>.<br /><br />Wir werden in diesem Spiel auch Punkte zählen, also erstelle auch eine Variable namens <b>score</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-3": "Fügen Sie diese Blöcke hinzu:<ul><li>Wenn auf die grüne Flagge geklickt wird</li><ul><li>Punktzahl auf [0] setzen</li><li>Für immer</li><ul><li>[ay] auf [Beschleunigungsmesser [Y]] setzen</li><li>[Position aktualisieren] senden</li></ul></ul></ul><br />Sie werden:<ul><li>Dem Benutzer ermöglichen, das Spiel durch Drücken der grünen Flagge zu starten</li><li>Die Punktzahl zurücksetzen, wenn das Spiel beginnt</li><li>Die Variable ay in einer Schleife auf den Wert der Y-Achse des Beschleunigungsmessers aktualisieren und die Nachricht „Position aktualisieren“ senden</li></ul><br />Wir werden die Variable <b>ay</b> und die Nachricht <b>Position aktualisieren</b> verwenden, um die Position unseres Sprites zu ändern.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-5": "Fügen Sie bei ausgewähltem Fledermaus-Sprite diese Blöcke hinzu:<ul><li>Wenn ich [Position aktualisieren] erhalte</li><ul><li>Setze x auf [[ay] * 200]</li></ul></ul><br />Das bedeutet, dass wir jedes Mal, wenn die Variable <b>ay</b> aktualisiert wird, auch die Position der Fledermaus verschieben.<br /><br />Die Variable ay variiert meist zwischen -1 und 1, also setzen wir durch Multiplikation mit 200 die x-Position auf einen Wert zwischen -200 und 200.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-6": "Probieren Sie es aus!<br /><br />Drücken Sie auf die grüne Flagge und kippen Sie dann das Zahnrad von einer Seite zur anderen, dann bewegt sich auch die Fledermaus!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-9": "Füge diese Blöcke hinzu:<ul><li>Bei Objekterkennung [rechts]</li><li>Sende [flap]</li></ul><br />Wir verwenden den rechten IR-Objektsensor als Knopf, um die Fledermaus mit den Flügeln schlagen zu lassen, und wir verwenden eine neue Nachricht namens <b>flap</b>, um diese Anweisung an den Fledermaus-Sprite zu senden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-10": "Wählen Sie das Fledermaus-Sprite aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-12": "Fügen Sie diese Blöcke hinzu:<ul><li>Wenn ich einen Flügelschlag erhalte</li><li>Wiederhole [4]</li><ul><li>Nächstes Kostüm</li><li>Ändere y um [10]</li></ul></ul><br />Da die Fledermaus vier Kostüme hat, führen wir diese Schleife viermal aus, um sie alle zu durchlaufen.<br /><br />Gleichzeitig bewegen wir die Fledermaus auf dem Bildschirm nach oben, sodass sie beim Flügelschlagen nach oben schwebt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-14": "Probieren Sie es aus!<br /><br />Drücken Sie die grüne Flagge, um den Code zu starten, und versuchen Sie dann, mit Ihrem Finger auf den rechten IR-Objektsensor zu tippen – die Fledermaus fliegt über den Bildschirm!<br /><br />Sie können immer noch nach links und rechts kippen, um zu lenken.<br /><br />Drücken Sie das rote Stoppschild, um die Ausführung des Codes zu stoppen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-15": "Fügen wir auch einen lustigeren Hintergrund hinzu – Fledermäuse leben oft im Wald und mögen die Nacht, also fügen wir einen Waldhintergrund hinzu.<br /><br />Klicken Sie auf die Schaltfläche <b>Hintergrund auswählen</b>.<br /><br />Wählen Sie dann den Waldhintergrund aus.<br /><br />Jetzt können Sie mit Ihrer Fledermaus durch den Wald fliegen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-17": "Unsere Fledermaus ist eine Fruchtfledermaus und sie frisst gerne Obst!<br /><br />Erstellen Sie eine Liste mit dem Namen <b>Obst</b>.<br /><br />Auf dem Bildschirm wird eine leere Liste angezeigt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-18": "Wir können der Liste Dinge hinzufügen, indem wir die neuen Blöcke verwenden, die im Abschnitt „Variablen“ erschienen sind.<br /><br />Zuerst müssen wir sicherstellen, dass die Fledermaus eine leere Liste hat, wenn das Spiel beginnt.<br /><br />Fügen Sie diese Blöcke hinzu:<ul><li>Wenn auf die grüne Flagge geklickt wurde</li><li>Alle [Früchte] löschen</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-19": "Als Nächstes fügen wir ein paar Früchte zur Einkaufsliste unserer Fledermaus hinzu.<br /><br />Füge einen <b>add [thing] to [fruit]</b>-Block hinzu und ändere ihn in <b>add [banana] to [fruit]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-21": "Drücken Sie auf die grüne Flagge. Jetzt sehen Sie, dass die Bananen- und Apfelartikel zur Obstliste hinzugefügt wurden!<br /><br />Unten wird Ihnen auch angezeigt, dass die Liste 2 Artikel umfasst.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-22": "Lass die Fledermaus etwas von der Einkaufsliste auswählen.<br /><br />Erstelle eine neue Variable namens <b>Frucht</b>.<br /><br />Du wirst feststellen, dass du eine Variable namens „Frucht“ und eine Liste namens „Frucht“ haben kannst.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-23": "Suchen Sie das Element [1] des Blocks [Früchte] und ziehen Sie es in den Programmierbereich.<br /><br />Wenn Sie darauf klicken, wird das Element an der angegebenen Position in der Liste ausgegeben – in diesem Fall die Banane.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-25": "Wenn Sie diese beiden Blöcke so kombinieren, dass sie <b>Element [Länge von [Frucht]] von [Frucht]</b> lauten, wird das letzte Element in der Liste gefunden.<br /><br />Das liegt daran, dass der Block <b>Länge von [Frucht]</b> zuerst ausgewertet wird und den Wert 2 zurückgibt, wie Sie zuvor gesehen haben. Der Block <b>Element</b> wird als Nächstes ausgewertet, verwendet die Zahl 2 als Eingabe und gibt dann das zweite Element in der Liste zurück.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-26": "Wie können wir den Code dazu bringen, ein zufälliges Element aus der Liste auszuwählen?<br /><br />Verwenden Sie den Block <b>Zufällig auswählen</b> aus der Kategorie „Operatoren“ und stellen Sie ihn so ein, dass er eine Zufallszahl zwischen 1 und <b>Länge von [Frucht]</b> auswählt. Fügen Sie dann den gesamten Zufallsblock in den Block <b>Element</b> ein, und zwar so:<br /><br />Wenn Sie darauf klicken, sehen Sie, dass zufällig entweder Banane oder Apfel ausgewählt wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-27": "Füge diese Blöcke unterhalb des Blocks <b>add [apple] to [fruit]</b> hinzu:<ul><li>Repeat [10]</li><ul><li>Set [fruit] to [item [pick random [1] to [length of [fruit]]] of [fruit]]</li><li>Broadcast [show fruit]</li><li>Think [fruit] for [5] seconds</li></ul></ul><br />Den Denk-Block findest du im Abschnitt Aussehen. Dort kannst du die Variable „fruit“ hinzufügen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-28": "Probier es aus!<br /><br />Jetzt wählt die Fledermaus alle 5 Sekunden zufällig eine Frucht aus, über die sie nachdenken soll!<br /><br />Der Code sendet außerdem die Nachricht <b>show fruit</b>, die wir gleich verwenden werden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-29": "Fügen wir diese Früchte in unser Spiel ein.<br /><br />Klicke auf die Schaltfläche <b>Sprite auswählen</b> und wähle den Bananen-Sprite aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-30": "Ziehen Sie die Bananen an eine bessere Stelle auf dem Bildschirm.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-31": "Fügen Sie bei ausgewählten Bananen diese Blöcke hinzu:<ul><li>Wenn auf die grüne Flagge geklickt wurde</li><li>Für immer</li><ul><li>Wenn [[Fledermaus]] berührt wird, dann</li></ul></ul><br />Dieser Code wird auch beim Starten des Spiels ausgeführt und prüft, ob die Fledermaus die Bananen berührt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-32": "Wenn die Fledermaus die Bananen erreicht hat, möchten wir überprüfen, ob es sich um die gewünschte Frucht handelt.<br /><br />Fügen Sie eine <b>if … else</b>-Bedingung innerhalb des if-Blocks ein und setzen Sie die Bedingung auf <b>[fruit] = [banana]</b>, wobei fruit die zuvor erstellte Variable ist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-33": "Wenn die Frucht richtig ist, erhöhen wir die Punktzahl um 1 und senden die richtige Nachricht.<br /><br />Andernfalls verringern wir die Punktzahl um 1 und senden die falsche Nachricht.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-34": "Um zu vermeiden, dass wir mehr als einmal Punkte erzielen (oder verlieren!), verstecken wir die Bananen, sobald die Fledermaus sie erreicht hat.<br /><br />Fügen Sie nach dem if… else-Block einen <b>hide</b>-Block hinzu – das bedeutet, dass sich die Bananen immer verstecken, wenn die Fledermaus sie berührt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-35": "Da wir die Bananen verstecken, müssen wir sie irgendwie wieder anzeigen können.<br /><br />Zuvor haben wir Code hinzugefügt, um jedes Mal, wenn die Fledermaus eine neue Frucht pflückt, die Nachricht <b>Obst anzeigen</b> zu senden. Wir verwenden dies als Signal, um die Frucht anzuzeigen.<br /><br />Fügen Sie diese Blöcke hinzu:<ul><li>Wenn ich [Obst anzeigen] empfange</li><li>Anzeigen</li></ul><br />Wenn die Fledermaus jetzt eine neue Frucht pflückt, werden die Bananen wieder angezeigt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-36": "Fügen Sie ein weiteres Sprite hinzu – diesmal das Apple-Sprite.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-37": "Verschiebe den Apfel-Sprite auf die andere Seite der Bühne.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-38": "Kopiere den Code von der Bananen-Sprite auf die Apfel-Sprite, indem du ihn auf die Apfel-Sprite ziehst.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-39": "Wenn der Apfel-Sprite ausgewählt ist, ändern Sie den Code so, dass er prüft, ob die Variable „fruit“ gleich <b>apple</b> ist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-40": "Probier es aus!<br /><br />Drücke die grüne Flagge, um zu starten, und versuche dann, die Frucht zu sammeln, an die die Fledermaus denkt!<br /><br />Drücke das rote Stoppschild, um den Code zu beenden, wenn du fertig bist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-41": "Geben Sie uns Feedback dazu, ob Sie die richtige Frucht erhalten haben.<br /><br />Wählen Sie erneut „Zahnrad“ aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-42": "Fügen Sie diese Blöcke hinzu:<ul><li>Wenn ich [richtig] empfange</li><li>Setze [Ring]-LEDs auf [grün]</li><li>Spiele Note [C6] für [0,5] Sekunden</li><li>Schalte alle LEDs aus</li></ul><br />Und<br /><br /><ul><li>Setze [Ring]-LEDs auf [rot]</li><li>Wenn ich [falsch] empfange</li><li>Spiele Note [C4] für [0,5] Sekunden</li><li>Schalte alle LEDs aus</li></ul><br />Dadurch werden die richtigen und falschen Nachrichten verwendet, die Sie zuvor für die Früchte codiert haben, und Cog leuchtet auf und gibt einen Ton aus, wenn Sie eine Frucht einsammeln.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-43": "Probieren Sie es aus!<br /><br />Jetzt erhalten Sie Feedback von Cog, während Sie Früchte sammeln.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-44": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.name": "Intervall-Timer-Stoppuhr",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.description": "Lasst uns eine Stoppuhr mit Rundenzeitmesser bauen!<br /><br />Dies ist eine spezielle Stoppuhr, die so viele Rundenzeiten aufzeichnet, wie wir möchten.<br />Wir verwenden eine Liste, um diese zu speichern.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-1": "Lasst uns eine Stoppuhr mit Rundenzeitmesser bauen!<br /><br />Dies ist eine spezielle Stoppuhr, die so viele Rundenzeiten aufzeichnet, wie wir möchten.<br />Wir verwenden eine Liste, um diese zu speichern.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-4": "Drücken Sie die Taste auf dem Zahnrad – jedes Mal, wenn Sie darauf drücken, wird der Liste eine neue Zeit hinzugefügt!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-5": "Es gibt allerdings ein paar Probleme: Beim ersten Mal war die Zeitmessung etwas zufällig, da wir den Timer nicht vorher eingerichtet hatten.<br /><br />Außerdem haben wir keine Möglichkeit, den Timer zu stoppen und die Liste der Rundenzeiten zu löschen.<br /><br />Das beheben wir jetzt!<br /><br />Fügen wir eine Variable namens <b>started</b> hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-6": "Wir sorgen dafür, dass das Schütteln des Zahnrads den Timer stoppt.<br /><br />Fügen Sie diese Blöcke hinzu:<br /><ul><li>Beim Schütteln</li><li>Setzen Sie <b>gestartet</b> auf <b>falsch</b></li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-8": "Gut gemacht, wenn Sie bemerkt haben, dass wir auch die Variable <b>started</b> auf <b>true</b> setzen müssen, sobald die Stoppuhr gestartet wurde!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-9": "Schütteln Sie das Zahnrad, um alles zurückzusetzen, und drücken Sie dann den Knopf, um den Timer zu starten. Dadurch werden die alten Zeiten aus der Liste gelöscht und der Timer zurückgesetzt.<br /><br />Bei jedem weiteren Knopfdruck wird eine neue Zeit zur Liste hinzugefügt!<br /><br />Wenn Sie das Zahnrad nach der letzten Zeitaufzeichnung erneut schütteln, wird der Timer zurückgesetzt, sodass der nächste Knopfdruck eine neue Zeiterfassung startet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-10": "Das funktioniert super als Stoppuhr!<br /><br />Aber es ist für unsere Benutzer etwas schwierig zu erkennen, in welchem ​​Zustand sich die Stoppuhr befindet – ist sie gestartet oder gestoppt?<br /><br />Fügen wir dazu eine Rückmeldung hinzu.<br /><br />Fügen Sie in den <b>on shake</b>-Blöcken unter dem <b>set started to false</b>-Block die folgenden Blöcke hinzu:<br /><ul><li>Alle LEDs ausschalten</li><li>LEDs des <b>Buttons</b> auf <b>rot</b></li></ul><br />Wenn Sie nun das Zahnrad schütteln, um die Stoppuhr zurückzusetzen, wird die aktuelle LED-Anzeige gestoppt und der Button leuchtet auf, um anzuzeigen, dass die Stoppuhr gestoppt und bereit zum Starten ist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-11": "Wir müssen außerdem eine Rückmeldung hinzufügen, die anzeigt, wann der Knopf erfolgreich gedrückt wurde und wann die Stoppuhr läuft.<br /><br />Fügen Sie am Ende der Blöcke für den Knopfdruck die folgenden Blöcke hinzu:<br /><ul><li>Setze die Ring-LEDs auf Grün</b></li><li>Spiele den Ton C6 für 0,5 Sekunden</li><li>Setze die Ring-LEDs auf Blau</b></li><li>Setze das Muster Spin1</b></li></ul><br />Wenn Sie nun den Knopf drücken, hören Sie ein Bestätigungssignal und die LEDs blinken grün, bevor sie sich blau drehen, um anzuzeigen, dass die Stoppuhr läuft.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-12": "Probieren Sie es aus!<br /><br />Es ist jetzt viel einfacher zu erkennen, ob die Stoppuhr angehalten oder gestartet ist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-13": "Können Sie den Fehler in unserem Code entdecken?<br /><br />Was passiert, wenn Sie versuchen, Zeiten unter 0,5 Sekunden aufzuzeichnen?<br /><br />Das ist nicht möglich, da der Code des vorherigen Tastendrucks weiterhin ausgeführt wird und die Note abspielt.<br /><br />Wie können wir das beheben und gleichzeitig die Note 0,5 Sekunden lang abspielen?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-14": "Eine Möglichkeit, dies zu beheben, besteht darin, den Broadcast-Block zu verwenden, um stattdessen eine Nachricht zum Auslösen von Licht und Ton zu senden.<br /><br />Erinnern Sie sich, dass die Ausführung des Broadcast- und Warteblocks erst abgeschlossen wurde, wenn der gesamte von ihm ausgelöste Code abgeschlossen war? Der Broadcast-Block tut dies nicht. Sobald er die Schaltflächen-Push-Nachricht gesendet hat, wird die Ausführung abgeschlossen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-15": "Probieren Sie es aus!<br /><br />Es ist jetzt viel einfacher zu erkennen, ob die Stoppuhr angehalten oder gestartet ist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-16": "Super, unsere Stoppuhr funktioniert jetzt richtig gut!<br /><br />Oft wollen wir bei Stromkreisläufen unsere Durchschnittszeit wissen. Lasst uns das auch mit unserer Stoppuhr berechnen!<br /><br />Fügt zwei Variablen hinzu: eine namens <b>Durchschnitt</b> und eine namens <b>Zähler</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-17": "Wir berechnen den Durchschnitt, nachdem wir die Stoppuhr durch Schütteln des Zahnrads angehalten haben.<br /><br />Fügen Sie diese Blöcke unterhalb des Blocks „Tasten-LEDs auf Rot setzen“ ein:<br /><ul><li>Setze <b>Durchschnitt</b> auf 0</li><li>Setze <b>Zähler</b> auf 0</li></ul><br />Damit sind unsere Variablen für die Durchschnittsberechnung vorbereitet.<br /><br />Überlegen Sie sich nun, wie Sie den Durchschnitt einer Zahlenliste berechnen würden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-18": "Um den Durchschnitt zu berechnen, addiert man alle Zahlen in der Liste und teilt die Summe durch die Anzahl der Elemente.<br /><br />Wir durchlaufen die Liste mithilfe einer Schleife und addieren alle Elemente.<br /><br />Fügen Sie einen Wiederholungsblock hinzu und legen Sie die Anzahl der Wiederholungen auf <b>Anzahl der Wiederholungen</b> fest.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-19": "Wir verwenden die Zählervariable, um zu verfolgen, wo wir uns in der Liste befinden, während wir alle Zeiten addieren.<br /><br />Fügen Sie innerhalb der Wiederholungsschleife einen Block hinzu, um <b>den Zähler um 1 zu ändern</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-21": "Okay, es läuft gut, aber die Variable `average` speichert jetzt die Summe aller Zeiten.<br /><br />Um den Durchschnitt zu erhalten, müssen wir ihn durch die Anzahl der Elemente in der Liste teilen.<br /><br />Fügen Sie einen `set average to [average / counter]`-Block hinzu.<br /><br />Die Variable `counter` zählt bereits die Elemente in der Liste, daher können wir sie als Divisor verwenden, um den Durchschnitt zu berechnen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-22": "Probieren Sie es aus!<br /><br />Wenn Sie jetzt das Zahnrad bewegen, wird die Variable „Durchschnitt“ auf den Durchschnitt aller von Ihnen aufgezeichneten Zeiten gesetzt!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-23": "Gut gemacht!<br /><br />Sie haben eine wirklich ausgefallene Stoppuhr gebaut, die jede Menge Rundenzeiten aufzeichnen, Ihnen sagen kann, wie viele Rundenzeiten sie aufgezeichnet hat, und sogar den Durchschnitt für Sie berechnen kann!<br /><br />Wofür könnten Sie den Rundentimer verwenden?<br /><br />Können Sie die Lichter am Zahnrad verwenden, um mehr Feedback zu geben, wenn die Stoppuhr läuft? Vielleicht die verstreichenden Sekunden anzeigen, indem Sie LEDs am Zahnrad einschalten?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.name": "Quizspiel",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.description": "Lasst uns ein Quizspiel machen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-2": "Beginnen wir mit den Vorbereitungen für das Quiz. <br/><br/>Wir brauchen eine Figur, die als Moderator fungiert. Wählen Sie aus den Optionen Ihre Lieblingsfigur aus. In diesem Beispiel wird eine Krabbe verwendet, Sie können jedoch jede beliebige Figur verwenden oder Ihre eigene zeichnen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-7": "Wir durchlaufen die Fragenliste und lassen das Sprite jede einzelne davon stellen. <br/><br/>Dazu verwenden wir eine Wiederholungsschleife. Fügen Sie diese Blöcke hinzu: <ul><li>Wenn auf die grüne Flagge geklickt wurde</li><li>Wiederhole [Länge der [Fragen]]</li></ul>Es gibt jedoch ein kleines Problem – was passiert, wenn der Code, den wir gerade ausgeführt haben, ausgeführt wird, bevor der andere Code die Fragenliste ausfüllt? <br/><br/>Es ist nicht ganz klar, was genau passieren würde – dies ist eine andere Art von Fehler und wir können die Dinge etwas anders codieren, um sicherzustellen, dass der Code in der gewünschten Reihenfolge ausgeführt wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-8": "Wir könnten einfach einen Warteblock vor der Wiederholungsschleife einfügen, aber das ist nicht sehr elegant. <br/><br/>Wir könnten auch den gesamten Code in eine einzige lange Sequenz einfügen, aber das wird schnell unübersichtlich. <br/><br/>Alternativ können wir eigene Blöcke erstellen und sicherstellen, dass sie in der gewünschten Reihenfolge ausgeführt werden. <br/><br/>Klicken Sie auf die Schaltfläche „Block erstellen“.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-9": "Geben Sie dem Block den Titel <i>Fragen ausfüllen</i> und klicken Sie auf OK.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-11": "Ersetzen Sie den Block <i>Wenn auf die grüne Flagge geklickt wird</i> durch den neuen Block <i>Definieren [Fragen ausfüllen]</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-12": "Fügen Sie den neuen Block „Fragen ausfüllen“ vor der Wiederholungsschleife ein. <br/><br/>Nun wissen wir sicher, dass die Fragenliste ausgefüllt ist, bevor wir ihre Länge ermitteln und mit der Iteration beginnen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-14": "Probier es aus – die Spielfigur liest die Fragen nacheinander vor. <br/><br/>Möglicherweise musst du die Spielfigur in die linke untere Ecke des Bildschirms verschieben, um mehr Platz für die Fragen zu schaffen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-15": "Fügen wir eine Möglichkeit hinzu, sich per Buzzer zu melden und die Frage zu beantworten. <br/><br/>Zahnrad auswählen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-17": "Fügen Sie diese Blöcke hinzu: <ul><li>Wenn auf die grüne Flagge geklickt wurde</li><li>Setzen Sie [Spielernummer] auf [1]</li></ul>Später werden wir weitere Zahnräder hinzufügen und ihre Spielernummern anders einstellen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-18": "Wir möchten die Summer nur aktivieren, wenn eine Frage gestellt wurde, also verwenden wir die Nachricht <i>Jetzt antworten</i>, die gesendet wurde, als die Figur eine Frage stellte. <br/><br/>Fügen Sie diese Blöcke hinzu: <ul><li>Wenn ich [Jetzt antworten] empfange</li><li>Setzen Sie [Ring]-LEDs auf [blau]</li><li>Setzen Sie [Ring]-LEDs auf Muster [Drehen1]</li><li>Warten Sie, bis [[[Schaltfläche angeklickt] = [wahr]] oder [[Summer] > [0]]]]</li></ul>Sie müssen eine neue Variable namens <b>Summer</b> erstellen – wir verwenden diese, um zu verfolgen, welcher Summer zuerst gedrückt wird. <br/><br/>Sie finden den Block <i>oder</i> in der Kategorie „Operatoren“. <br/><br/>Die Bedingung im Warte-bis-Block ist entweder, dass die Schaltfläche angeklickt wird oder die Buzzer-Variable größer als 0 ist. <br/><br/>Auf diese Weise können wir warten, bis entweder die Schaltfläche auf diesem Zahnrad gedrückt wird oder ein anderer Buzzer gedrückt wird und die Buzzer-Variable woanders gesetzt wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-19": "Fügen Sie diese Blöcke hinzu: <ul><li>Wenn [[Schaltfläche angeklickt] = [wahr]], dann</li><ul><li>Setze [Summer] auf [Spielernummer]</li><li>Setze [Ring]-LEDs auf [grün]</li></ul>Sonst</li><ul><li>Schalte alle LEDs aus</li></ul></ul>Wenn mit diesem Code die Schaltfläche auf diesem Zahnrad zuerst gedrückt wurde, setzen wir die Variable <i>Summer</i> auf diese <i>Spielernummer</i> und schalten die Lichter auf dem Zahnrad grün. <br/><br/>Andernfalls bedeutet das, dass jemand anderes zuerst da war oder uns die Zeit ausgegangen ist, und wir schalten stattdessen einfach die Lichter aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-20": "Gehe zurück zu dem Sprite, den du zuvor hinzugefügt hast.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-22": "Jetzt wird jedes Mal, wenn eine Frage gestellt wird, entweder nach 10 Sekunden oder sobald ein Summer (der Knopf auf dem Zahnrad) gedrückt wird, mit der nächsten fortgefahren. <br/><br/>Wir müssen unserem Kandidaten immer noch die Chance geben, die Frage tatsächlich zu beantworten, bevor wir mit der nächsten fortfahren. <br/><br/>Erstellen Sie einen neuen Block namens <i>Antwort prüfen</i> und platzieren Sie ihn nach dem Block <i>Warten bis</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-23": "Fügen Sie unter dem Block `<i>define [check answer]</i>` einen Block `<i>if … else</i>` mit der Bedingung `<i>[buzzer] > [0]</i>` hinzu. <br/><br/>Damit wird geprüft, ob der Summer rechtzeitig gedrückt wurde.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-25": "Füge diese Blöcke ebenfalls hinzu: <ul><li>Sag [join [join [Hast du gesagt] [Element [1] von [Antworten]] [? Drücke Grün für Ja und Rot für Nein]]</li><li>Sende [Antwort bestätigen] und warte</li></ul>Erinnere dich daran, wie wir zuvor <i>if</i>-Bedingungen verschachtelt haben. Du kannst auch <i>join</i>-Operatoren verschachteln, wenn du mehr als zwei Textstrings verbinden möchtest. <br/><br/>Nachdem der Spieler 6 Sekunden Zeit hatte, seine Antwort laut auszusprechen, fragt ihn die Spielfigur, ob er die richtige Antwort aus der Antwortliste gegeben hat. Anschließend wird er aufgefordert, Grün für Ja und Rot für Nein zu drücken, die Nachricht <i>Antwort bestätigen</i> zu senden und zu warten, bevor es weitergeht.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-26": "Lass uns etwas mit der <i>Antwort bestätigen</i>-Nachricht machen. <br/><br/>Wähle das Zahnradsymbol erneut aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-27": "Fügen Sie diese Blöcke hinzu: <ul><li>Wenn ich [Antwort bestätigen] erhalte</li><li>Wenn [[Summer] = [Spielernummer], dann</li></ul>. <br/><br/>Später werden wir weitere Zahnräder anschließen und diesen Code ausführen. Diese IF-Bedingung prüft, ob dieses Zahnrad der erfolgreiche Summer war.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-28": "Fügen Sie mithilfe des ColorPicker-Blocks innerhalb der if-Bedingung ein <i>Set LEDs</i> hinzu und stellen Sie es so ein, dass neben dem linken IR-Objektsensor eine rote LED und neben dem rechten IR-Objektsensor eine grüne LED angezeigt wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-31": "Füge diese Blöcke hinzu: <ul><li>Wenn ich [buzzed] erhalte</li><li>Wenn [[buzzer] = [Spielernummer]] dann</li><ul><li>Setze [ledID] auf [0]</li><li>Wiederhole [6]</li><ul><li>Setze LED [ledID] auf [lila]</li><li>Setze LED [[ledID] + [1]] auf [lila]</li><li>Warte [1] Sekunden</li><li>Ändere [ledID] um [2]</li></ul></ul></ul>Während der 6 Sekunden, die dem Spieler zur Beantwortung der Frage zur Verfügung stehen, sieht er nun einen Countdown auf den LEDs des Zahnrads.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-32": "Probier es aus! <br/><br/>Die Fragen werden nacheinander gestellt. Wenn du buzzerst, hast du 6 Sekunden Zeit zu antworten, während das Zahnrad einen Countdown anzeigt. Anschließend wählst du Rot oder Grün, je nachdem, ob deine Antwort richtig oder falsch war.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-33": "Wir müssen noch etwas unternehmen, falls sich niemand rechtzeitig meldet, und wir müssen am Ende den Gewinner bekanntgeben. <br/><br/>Zurück zum Sprite.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-34": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-35": "Es ist Zeit, mehr Zahnräder hinzuzufügen, damit wir mehr Spieler haben können!<br/><br/>Klicken Sie mit der rechten Maustaste auf das Zahnrad und wählen Sie <i>Duplizieren</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-36": "Ein neues Zahnrad mit demselben Code wie das erste wurde hinzugefügt!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-37": "Neben dem duplizierten Code wurden auch die von uns erstellten <i>lokalen</i> Variablen dupliziert. <br/><br/>Nachdem dieses neue Zahnrad ausgewählt ist, ändern Sie die Spielernummer auf 2.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-39": "Okay!<br/><br/>Jetzt müssen wir herausfinden, wer am Ende des Quiz gewinnt.<br/><br/>Gehen Sie zurück zum Sprite-Code.<br/><br/>Erstellen Sie einen weiteren Block namens <i>Gewinner bekanntgeben</i> und rufen Sie ihn nach der Hauptschleife für die Fragen auf.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-40": "Zuerst ermitteln wir die höchste Punktzahl. <br/><br/>Erstellen Sie einen weiteren Block namens <i>Maximale Punktzahl ermitteln</i>. <br/><br/> Fügen Sie unter dem Block <i>[Maximale Punktzahl ermitteln] definieren</i> diese Blöcke hinzu: <ul><li>Setze [maxScore] auf [Element [1] von [Punkte]]</li><li>Setze [playerID] auf [1]</li><li>Wiederhole [Länge von [Punkte]]</li><ul>Wenn [[Element [playerID] von [Punkte]] > [maxScore]], dann</li><ul><li>Setze [maxScore] auf [Element [playerID] von [Punkte]]</li><ul><li>Ändere [playerID] um [1]</li></ul></li></ul></li></ul><br/><br/> Sie müssen die Variablen <i>maxScore</i> und <i>playerID</i> erstellen. <br/><br/>Dieser Code <li>iteriert</li> durch die Anzeigetafel – geht sie also Eintrag für Eintrag durch – und setzt die Variable <i>maxScore</i> auf den höchsten Punktwert, den er dabei findet.<br/><br/>Klicken Sie auf diesen Codeabschnitt, um ihn auszuführen – die Variable <i>maxScore</i> sollte am Ende auf den höchsten Wert in der Punkteliste gesetzt werden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-41": "Nachdem wir nun die höchste Punktzahl kennen, müssen wir herausfinden, wie viele Spieler diese Punktzahl erreicht haben. <br/><br/>Erstellen Sie einen neuen Block mit dem Namen <i>Anzahl der Spieler mit der Punktzahl [Punktzahl]</i>. Dies können Sie tun, indem Sie im Fenster „Block erstellen“ auf die Schaltfläche <i>Zahl oder Text hinzufügen</i> klicken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-42": "Füge diese Blöcke dem Block `<i>define [how many players with score [score]]</i>` hinzu: `<ul><li>set [result] to [0]</li><li>set [playerID] to [0]</li><li>repeat [length of [scores]]</li><ul><li>change [playerID] by [1]</li><li>if [[item [playerID] of [scores]] = [score]] then</li><ul><li>change [result] by [1]</li></ul></ul></ul>` Dieser neue Block (bzw. diese neue Funktion) unterscheidet sich etwas von den vorherigen, da er einen Parameter benötigt – die zu suchende Punktzahl. <br/><br/>Du kannst den Parameter `<i>score</i>` aus dem `define`-Block nach unten ziehen und in deinem Code verwenden. Er funktioniert wie eine Variable, kann aber nur innerhalb dieser Funktion verwendet werden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-43": "Um dies auszuprobieren, führen Sie den Block „how many players with score []“ aus, wobei der Parameter „score“ auf eine Zahl gesetzt ist, die in Ihrer Punkteliste steht. Die Ergebnisvariable wird auf die Anzahl der Spieler mit dieser Punktzahl gesetzt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-44": "Beginnen wir mit dem Erstellen der Funktion <i>Gewinner bekannt geben</i>, die wir zuvor erstellt haben. Fügen Sie diese Blöcke zum Block <i>Define [Gewinner bekannt geben]</i> hinzu: <ul><li>Maximale Punktzahl ermitteln</li><li>Wie viele Spieler haben die Punktzahl [maxScore]?</li><li>Wenn [[Ergebnis] = [1], dann</li><ul><li>Sagen Sie [Join [Der Gewinner mit einer Punktzahl von ] [maxScore]] für [5] Sekunden</li><li>Sagen Sie [Join [ist Spieler ] [Elementnummer von [maxScore] in [Punkte]]</li></ul></ul>Wenn dies nun ausgeführt wird, wird die Variable <i>maxScore</i> durch die Funktion <i>Maximale Punktzahl ermitteln</i> auf die höchste Punktzahl gesetzt. Anschließend wird die Variable <i>Ergebnis</i> durch den Block <i>Wie viele Spieler haben die Punktzahl [maxScore]?</i> auf die Anzahl der Spieler mit dieser Punktzahl gesetzt. Wenn es nur einen Gewinner gibt, ist es ganz einfach, ihn zu nennen. Mithilfe des Blocks <i>item # of [maxScore] in [scores]</i> können wir nachsehen, wo sich der Punktestand auf der Anzeigetafel befindet. Bei einem Gleichstand und mehreren Gewinnern ist die Sache jedoch etwas komplizierter.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-45": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-46": "Probieren Sie es aus! <br/> Am Ende des Quiz werden nun die Gewinner bekanntgegeben, auch bei einem Gleichstand!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-47": "Gut gemacht! Du hast eine Gameshow programmiert, bei der Zahnräder als Buzzer für die Kandidaten dienen!<br/><br/>Du hast <b>Listen</b> verwendet, um die Fragen, Antworten und Anzeigetafeln zu speichern.<br/><br/>Du hast <b>lokale Variablen</b> verwendet, damit jedes Zahnrad seine Spielernummer separat verfolgen konnte.<br/><br/>Wir haben gelernt, wie man <b>Funktionen</b> verwendet (eigene Blöcke erstellt), um den Code übersichtlich und leserlich zu halten. Leicht lesbarer Code lässt sich leichter debuggen – und das Aufteilen langer, komplizierter Codeabschnitte in kleinere Abschnitte nennt man <b>Funktionale Zerlegung</b>.<br/><br/>Funktionen sind auch sehr nützlich, wenn du Code mehr als einmal ausführen und ihn nicht immer wieder kopieren und einfügen möchtest.<br/><br/>Du hast auch gelernt, wie Funktionen Parameter haben können. Die Funktion „Wie viele Spieler haben Punkte?“ gibt einen zu suchenden Punktestand an.<br/><br/>Nächste Schritte<ul><li>Können Sie Ihrem Quiz weitere Fragen und Antworten (und vielleicht mehr Zahnräder) hinzufügen?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.name": "Bewegungstracker",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-3": "Füge diese Blöcke hinzu:<ul><li>Wenn die grüne Flagge angeklickt wird</li><li>Setze [numSamples] auf [10]</li><li>Lösche alles in [ax]</li><li>Wiederhole [numSamples]</li><ul><li>Füge [Accelerometer [X]] zu [ax] hinzu</li></ul><li>Unendlich</li><ul><li>Setze [sampleCounter] auf [[[sampleCounter] mod [numSamples]] + [1]]</li><li>Ersetze den Eintrag [sampleCounter] in [ax] durch [Accelerometer [X]]</li><li>Warte [0,1] Sekunden</li></ul></ul><br/>Du musst die Variablen <i>numSamples</i> und <i>sampleCounter</i> erstellen.<br/><br/>Was denkst du, was dieser Code bewirken wird?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-4": "Probieren Sie es aus!<br/><br/>Drücken Sie die grüne Flagge, um den Code auszuführen, und bewegen Sie dann das Zahnrad.<br/><br/>Sie werden sehen, dass die Ax-Liste alle 0,1 Sekunden mit dem neuesten Messwert (oder <i>Sample</i>) der X-Achse des Beschleunigungsmessers aktualisiert wird.<br/><br/>Jedes neue Sample in der Ax-Liste ersetzt das älteste und wir verwenden den Operator <i>mod</i>, um sicherzustellen, dass die Variable <i>sampleCounter</i> vom Ende der Liste zurück zum Anfang läuft.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-5": "Wir müssen feststellen können, ob die gesammelten Daten zeigen, ob sich das Zahnrad bewegt oder nicht.<br/><br/>Eine einfache Möglichkeit hierfür besteht darin, zu untersuchen, wie stark es sich ändert – Bewegung sollte Beschleunigung bedeuten, die der Beschleunigungsmesser misst.<br/><br/>Wir erstellen einen neuen Block namens <i>Bereich abrufen</i>, der ermittelt, wie stark die Daten in der Axtliste variieren.<br/><br/>Fügen Sie diese Blöcke hinzu:<ul><li>Definiere [Bereich abrufen]</li><li>Setze [Bereichszähler] auf [0]</li><li>Setze [min] auf [Element [1] von [ax]]</li><li>Setze [max] auf [Element [1] von [ax]]</li><li>Wiederhole [Länge von [ax]]</li><ul><li>Ändere [Bereichszähler] um [1]</li><li>Setze [Beispiel] auf [Element [Bereichszähler] von [ax]]</li><li>Wenn [[Beispiel] < [min]] dann</li><ul><li>Setze [min] auf [Sample]</li></ul><li>Wenn [[Sample] > [max]] dann</li><ul><li>Setze [max] auf [Sample]</li></ul><li>Setze [Ergebnis] auf [[max] - [min]]</li></ul></ul><br/>Diese Funktion durchläuft nun die gesamte Ax-Liste Stichprobe für Stichprobe und ermittelt die Minimal- und Maximalwerte.<br/>Am Ende wird die Ergebnisvariable auf die Differenz zwischen den beiden Werten gesetzt.<br/>Mehr Bewegung bedeutet, dass ein größerer Wertebereich aufgezeichnet wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-8": "Ok, wir haben also ein Programm erstellt, das versucht, Sekunde für Sekunde zu bestimmen, ob das Zahnrad überhaupt bewegt wurde.<br/><br/>Machen wir mehr mit diesen Daten!<br/><br/>Es wäre gut zu bestimmen, ob wir denken, dass eine Minute generell aktiv war oder nicht.<br/><br/>Zählen wir dazu die Anzahl der aktiven Sekunden in jeder Minute.<br/><br/>Fügen Sie eine neue Variable namens <i>activeSecondsThreshold</i> und einen <i>set [activeSecondsThreshold] to [30]</i>-Block direkt nach dem <i>set [motionThreshold]</i>-Block und vor der Endlosschleife hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-9": "Füge eine weitere Variable namens activeSeconds hinzu.<br/>Direkt innerhalb dieser <i>forever</i>-Schleife füge einen <i>set [activeSeconds] to [0]</i>-Block ein, und anschließend einen <i>repeat [60]</i>-Block, der den restlichen Code in der Forever-Schleife umschließt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-10": "Fügen Sie innerhalb der Bedingung <i>if [[result] > [motionThreshold] then</i> einen Block <i>change [activeSeconds] by [1]</i> hinzu.<br/>Mit diesem Code zählen wir, wie viele von jeweils 60 Sekunden wir für aktiv halten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-11": "Erstelle eine neue Liste namens activeMinutes.<br/>Direkt nach der Schleife <i>repeat [60]</i> (aber noch innerhalb der Endlosschleife) füge diese Blöcke hinzu:<ul><li>Wenn [[activeSeconds] > [activeSecondsThreshold]] dann</li><ul><li>Füge [true] zu [activeMinutes] hinzu</li></ul><li>Sonst</li><ul><li>Füge [false] zu [activeMinutes] hinzu</li></ul></ul><br/>Nun vergleichen wir alle 60 Sekunden – also einmal pro Minute – die Gesamtzahl der aktiven Sekunden in dieser Minute mit der Variable <i>activeSecondThreshold</i>, um zu bestimmen, ob die Minute insgesamt als aktiv eingestuft wurde oder nicht.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-12": "Vergessen wir nicht, die Liste `activeMinutes` zu Beginn des Programms zu leeren!<br/>Fügen Sie nach dem Block `set [activeSecondsThreshold]` einen Block `delete all of [activeMinutes]` ein.<br/>Denken Sie immer daran, alle Variablen und Listen zu Beginn eines Programms zurückzusetzen – dies nennt man Variableninitialisierung. Wenn Sie dies vergessen, kann dies zu Fehlern führen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-13": "Probieren Sie es aus!<br/><br/>Wird innerhalb eines 60-Sekunden-Fensters länger als 30 Sekunden eine Bewegung erkannt, wird diese Minute in der Liste <i>activeMinutes</i> als „true“ gespeichert.<br/><br/>Andernfalls wird ein <i>false</i> gespeichert.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-15": "Können Sie sich vorstellen, wo Sie Blöcke hinzufügen sollten, um diese neuen Variablen zu erhöhen?<br/><br/>Eine mögliche Stelle ist wie hier gezeigt, wo <i>totalActiveSeconds</i> jedes Mal erhöht wird, wenn <i>activeSeconds</i> erhöht wird, und <i>totalSeconds</i> in jeder Iteration der <i>repeat [60]</i> Schleife erhöht wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-16": "Probieren Sie es aus!<br/>Jetzt erfasst das Programm auch den Anteil der aktiven Sekunden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-17": "Lassen Sie uns einige dieser Informationen auf benutzerfreundlichere Weise melden.<br/><br/>Fügen Sie direkt vor dem Ende der <i>Forever</i>-Schleife einen <i>Broadcast [Report Stats]</i>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-18": "Fügen Sie ein neues Sprite hinzu – Sie können jedes beliebige auswählen. In diesem Beispiel haben wir einen Roboter ausgewählt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-23": "Der Prozentsatz der aktiven Sekunden erscheint mir definitiv eine genauere Zusammenfassung der Gesamtaktivität unseres Nutzers zu sein, aber das heißt nicht, dass die Liste der aktiven Minuten nicht nützlich ist. Es handelt sich um eine eher pessimistische Aktivitätsschätzung, die aber dennoch anzeigt, ob sich jemand viel bewegt.<br/><br/>Fügen wir eine Funktion hinzu, die den Benutzer zu etwas Bewegung anregt, wenn er sich in den letzten 5 Minuten kaum bewegt hat.<br/><br/>Fügen Sie diese Blöcke hinzu:<ul><li>Wenn [[length of [activeMinutes]] > [4]] dann</li><ul><li>Setze [totalActiveMinutes] auf [0]</li><li>Wiederhole [5]</li><ul><li>Wenn [[item [minuteCounter] of [activeMinutes]] = [true]] dann</li><ul><li>Ändere [totalActiveMinutes] um [1]</li></ul><li>Ändere [minuteCounter] um [-1]</li></ul><li>Wenn [[totalActiveMinutes] = [0]] dann</li><ul><li>Sende [signal user]</li><li>Sag: [Du hast dich kaum bewegt] Nachdem die Hauptstatistiken ausgelesen wurden, prüft der Code, ob in der Liste <i>activeMinutes</i> mindestens 5 Minuten aufgezeichnet wurden. Falls ja, werden die letzten 5 Minuten in der Liste rückwärts durchlaufen und die Anzahl der aktiven Minuten gezählt. Falls keine aktiven Minuten vorhanden sind, wird die Nachricht <i>Signal User</i> gesendet und der Benutzer wird darüber informiert, dass er sich in letzter Zeit kaum bewegt hat.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-24": "Wechseln Sie zurück zu Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-25": "Füge diese Blöcke hinzu:<ul><li>Wenn ich [Signal Benutzer] empfange</li><li>Wiederhole [3]</li><ul><li>Setze die [Ring]-LEDs auf [rot]</li><li>Spiele die Note [A5] für [0,5] Sekunden</li><li>Setze die [Ring]-LEDs auf [weiß]</li><li>Warte [0,5] Sekunden</li></ul><li>Schalte alle LEDs aus</li></ul><br/>Jetzt piept und leuchtet Cog auch, um den Benutzer darauf hinzuweisen, dass er sich mehr bewegen sollte.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-27": "Gut gemacht!<br/>Du hast Cog in einen Fitness-Tracker verwandelt!<br/>Er misst deine Aktivität und erinnert dich daran, dich zu bewegen, wenn du zu lange still sitzt.<br/><br/>Im Alltag ist es völlig in Ordnung, 5 Minuten stillzusitzen, aber es ist wichtig, aktiv zu bleiben und sich regelmäßig zu bewegen.<br/><br/>Wie viel Zeit solltest du deiner Meinung nach täglich aktiv verbringen? Und wie oft?<br/><br/>Du hast gelernt, wie man Daten sammelt und analysiert und sie aus einer großen Anzahl von Stichproben in eine einfache Ja/Nein-Aktivitätsmessung einordnet. Pro Minute wurden 600 Messungen mit dem Beschleunigungsmesser durchgeführt, und wir haben all diese Daten zu einer einzigen Angabe zusammengefasst, ob die Minute aktiv war oder nicht.<br/><br/>Denke an andere Software und Systeme, die Entscheidungen treffen und Klassifizierungen vornehmen. Welche Entscheidungen mussten die Programmierer beim Design treffen, und was konnte dabei schiefgehen?<br/><br/><b>Nächste Schritte<ul><li>Überlegen Sie, ob Sie die verschiedenen Schwellenwerte und anderen Variablen ändern würden, die das Verhalten Ihres Fitness-Trackers steuern.</li><li>Überlegen Sie, welche weiteren zusammenfassenden Statistiken Ihr Fitness-Tracker anzeigen soll und wie Sie diese berechnen könnten.</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.description": "Lassen Sie uns ein Modell zur Gestenerkennung erstellen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-1": "Lasst uns maschinelles Lernen nutzen, um mit Cog bestimmte Bewegungen zu erkennen!<br/><br/>Wir trainieren ein Modell, um Gesten zu erkennen, und verwenden diese im Rahmen eines Gedächtnisspiels, das auf dem Erlernen von Zaubersprüchen basiert!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-2": "Klicken Sie auf die Registerkarte <i>Maschinelles Lernen</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-4": "Drücken Sie <i>Weiter</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-5": "Die Daten, die wir zum Trainieren dieses Modells verwenden, sind die drei Achsen des Beschleunigungsmessers. <br/><br/> Sie können diese Daten in Echtzeit auf diesem Bildschirm sehen, genau wie im Sensor-Dashboard.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-6": "Geben Sie als Modellnamen <i>gesture</i> ein und tragen Sie dann im Feld „Neue Klasse erstellen“ das Wort <i>nothing</i> ein.<br/>Klicken Sie auf die Schaltfläche „+“, um diese neue Klasse zu erstellen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-7": "Dadurch wird eine Klasse namens <i>nothing</i> erstellt. <br/>Wir benötigen für jede zu erkennende Bewegungsart eine eigene Klasse – dazu gehört auch ein Basisfall ohne Bewegung.<br/><br/>Nun müssen wir Trainingsdaten für die Klasse <i>nothing</i> sammeln. Sie können solche Daten für Beschleunigungsmessermodelle erfassen, indem Sie die Taste am Cog gedrückt halten.<br/><br/>Nehmen Sie Cog in die Hand, halten Sie es ruhig und drücken Sie dann die Taste einige Sekunden lang.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-8": "Drehen Sie das Zahnrad in eine andere Position, halten Sie es fest und drücken Sie dann den Knopf erneut für einige Sekunden, um eine neue Probe zu entnehmen.<br/>Wiederholen Sie dies mit verschiedenen Positionen, bis Sie 10–20 Proben haben.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-9": "Erstellen Sie nun eine weitere Klasse namens <i>swoosh</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-10": "Dieses Mal möchten Sie Beispiele für eine langsame, seitliche Rauschbewegung aufzeichnen.<br/>Bewegen Sie das Zahnrad vorsichtig vor und zurück und halten Sie die Taste für jede einzelne Bewegung gedrückt. Lassen Sie sie los, sobald die Bewegung beendet ist.<br/>Die Bewegung, die Sie hier aufzeichnen, wird hoffentlich später erkannt und als Rauschen klassifiziert.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-11": "Stellen Sie nochmals sicher, dass Sie mindestens 10 Proben haben.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-18": "Möglicherweise stellen Sie fest, dass Bewegungen manchmal falsch klassifiziert werden – oder dass beispielsweise ein <i>Swoosh</i> kurz vor einem <i>Flick</i> leicht falsch erkannt wird.<br/>Um dies zu beheben, können wir versuchen, weitere Trainingsdaten hinzuzufügen.<br/>Klicken Sie auf die Klasse, der Sie Beispiele hinzufügen möchten, und zeichnen Sie dann weitere auf.<br/>Wenn Sie glauben, dass Sie Fehler gemacht haben, können Sie auf die einzelnen Beispiele klicken, um sie zu löschen",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-19": "Wenn Sie zufrieden sind, drücken Sie <i>Trainieren</i>, um das Modell erneut zu trainieren.<br/>Dann <i>Starten</i> Sie es und prüfen Sie, ob Sie mit der Leistung zufrieden sind.<br/>Ich hatte immer noch Probleme damit, dass das Modell vor jedem <i>Schnippen</i> ein <i>Swoosh</i> erkannte, obwohl es keines gab. Um das zu beheben, habe ich der <i>Nothing</i>-Klasse einige Beispiele hinzugefügt, in denen ich Cog von der Horizontalen in die Vertikale drehe – die Art von Bewegung, die ich vor einem Schnippen mache und die fälschlicherweise als Swoosh kategorisiert wurde.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-21": "Wenn Sie absolut zufrieden sind, klicken Sie auf die Schaltfläche <i>Speichern</i>.<br/><b>Nachdem Sie auf „Speichern“ geklickt haben, können Sie keine Änderungen mehr vornehmen oder weitere Beispiele zu diesem Modell hinzufügen.</b><br/>Das liegt daran, dass die ursprünglichen Trainingsdaten nicht mehr benötigt werden und daher verworfen werden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-23": "Gehen Sie zurück zur Registerkarte <i>Code</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-25": "Aktivieren Sie das Kontrollkästchen neben dem Block <i>Beschleunigungsmesser-Beschriftung</i>.<br/>Sobald wir mit der Klassifizierung beginnen, wird uns angezeigt, was das Modell erkennt",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-26": "Fügen Sie diese Blöcke hinzu:<ul><li>Wenn die grüne Flagge angeklickt wird</li><li>Maschinelles Lernmodell [Geste] laden</li><li>Alle [1] Sekunden ein Label erstellen</li><li>Konfidenzschwelle [0,5] festlegen</li></ul><br/>Dadurch wird das trainierte <i>Gesten</i>-Modell gestartet. Es aktualisiert seine Klassifizierung der erkannten Bewegung jede Sekunde.<br/><br/>Erinnern Sie sich, wie wir beim Testen des Modells prozentuale Balken zur Erkennungssicherheit gesehen haben? Die <i>Konfidenzschwelle</i> legt fest, wie sicher sich das Modell sein muss, bevor es eine Klassifizierung vornimmt.<br/>Wir belassen sie vorerst bei 0,5 (oder 50 %), müssen sie aber möglicherweise später erhöhen, falls das Modell falsche Klassifizierungen liefert.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-28": "Fügen Sie diese Blöcke hinzu:<ul><li>Wenn die Beschleunigungssensorbezeichnung [Swoosh] empfangen wird</li><li>Setzen Sie die [Ring]-LEDs auf [Grün]</li><li>Senden Sie [Swoosh] und warten Sie</li><li>Warten Sie [1] Sekunden</li><li>Schalten Sie alle LEDs aus</li></ul><p>Und</p><ul><li>Wenn die Beschleunigungssensorbezeichnung [Flick] empfangen wird</li><li>Setzen Sie die [Ring]-LEDs auf [Rot]</li><li>Senden Sie [Flick] und warten Sie</li><li>Warten Sie [1] Sekunden</li><li>Schalten Sie alle LEDs aus</li></ul><br/>Jetzt reagiert Cog, indem es Lichter anzeigt, und wir senden eine Nachricht, wenn ein Swoosh oder ein Flick erkannt wird",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-30": "Ok, lass uns ein Memory-Spiel mit dem Bewegungsmelder machen!<br/>Füge ein <i>Hexe</i>-Sprite hinzu und verschiebe es in die untere linke Ecke",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-32": "Und gehen Sie zum Reiter <i>Kostüme</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-34": "Wir werden noch ein paar weitere Hintergründe zur Verwendung im Spiel hinzufügen.<br/>Drücken Sie die Schaltfläche <i>Hintergrund auswählen</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-35": "Wählen Sie den Hintergrund <i>Burg 3</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-36": "Fügen Sie außerdem <i>Schloss 2</i> und <i>Hexenhaus</i> hinzu, sodass Sie insgesamt vier Hintergründe haben.<br/>Benennen Sie den ersten in <i>Titelbildschirm</i> um, damit wir ihn leicht identifizieren können.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-37": "Gehen Sie zurück zur Registerkarte „Code“, während die Stufe noch ausgewählt ist.<br/><br/>Fügen Sie diese Blöcke hinzu:<ul><li>Wenn auf die grüne Flagge geklickt wird</li><li>Hintergrund auf [Titelbildschirm] umschalten</li><li>Warten Sie [2] Sekunden</li><li>Hintergrund auf [Schloss 3] umschalten</li></ul><br/>Wenn das Spiel jetzt gestartet wird, wird dem Spieler 2 Sekunden lang der Titelbildschirm angezeigt, bevor zu Schloss 3 – dem Inneren des Schlosses – gewechselt wird",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-39": "Wir brauchen auch einen für die Flick-Bewegung.<br/><br/>Fügen Sie diese Blöcke hinzu:<ul><li>Wenn ich [Flick] empfange</li><li>Wenn [[Hintergrund [Name]] = [Schloss 2]], dann<ul><li>Wiederholen Sie [50]<ul><li>Ändern Sie den [Fischaugen]-Effekt um [10]</li><li>Ändern Sie den [Wirbel]-Effekt um [-10]</li></ul></li><li>Wechseln Sie den Hintergrund zu [Hexenhaus]</li><li>Wiederholen Sie [50]<ul><li>Ändern Sie den [Fischaugen]-Effekt um [-10]</li><li>Ändern Sie den [Wirbel]-Effekt um [10]</li></ul></li><li>Übertragen Sie [Spiel starten]</li></ul></li></ul><br/>Vielleicht geht es schneller, wenn Sie mit der rechten Maustaste klicken und diesen Code duplizieren. Achten Sie nur darauf, ihn an den richtigen Stellen zu ändern und den Übertragungsblock hinzuzufügen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-40": "Wählen Sie nun das <i>Hexe</i>-Sprite aus",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-41": "Wir müssen den Schritten des Tutorials einige Anweisungen hinzufügen.<br/><br/>Fügen Sie diese Blöcke hinzu:<ul><li>Wenn der Hintergrund zu [Schloss 3] wechselt</li><li>Warte [2] Sekunden</li><li>Sag [Es ist Zeit, das Schloss zu verlassen] für [2] Sekunden</li><li>Sag [Bewege den Zauberstab, um uns nach draußen zu transportieren]</li></ul><p>Und</p><ul><li>Wenn der Hintergrund zu [Schloss 2] wechselt</li><li>Warte [2] Sekunden</li><li>Sag [Lass uns zu mir nach Hause gehen, um Zaubersprüche zu üben] für [2] Sekunden</li><li>Sag [Bewege den Zauberstab, um uns dorthin zu transportieren]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-42": "Okay, probieren wir es aus!<br/>Um das ML-Modell auszuführen, müssen Sie Cog erneut auswählen und das Programm mit ausgewähltem Cog starten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-43": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-44": "Lassen Sie uns mit der Hexe in ihrem Haus richtig mit dem Spiel beginnen.<br/>Dies wird ein Gedächtnisspiel, bei dem die Hexe eine Abfolge von Gesten vorliest und der Spieler sich diese merken und der Reihe nach ausführen muss.<br/>Wählen Sie das <i>Hexe</i>-Sprite erneut aus",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-45": "Füge diese Blöcke hinzu:<ul><li>Wenn ich [Spiel starten] erhalte</li><li>Lösche alle [Gesten]</li><li>Füge [Schwung] zu [Gesten] hinzu</li><li>Füge [Schnippen] zu [Gesten] hinzu</li><li>Setze [Leben] auf [3]</li><li>Setze [Sequenzlänge] auf [2]</li></ul><br/>Du benötigst eine Liste namens <i>Gesten</i> und Variablen namens <i>Leben</i> und <i>Sequenzlänge</i>.<br/>Die Gestenliste enthält alle möglichen Bewegungen. Wenn du das Spiel um weitere Bewegungen erweitern möchtest, kannst du diese hier hinzufügen, sobald du ein Modell dafür trainiert hast.<br/>Wir geben unserem Spieler zu Beginn 3 Leben. Er verliert jedes Mal ein Leben, wenn er einen Fehler macht.<br/>Wir beginnen mit einer Sequenz von 2 Bewegungen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-46": "Erstellen Sie einen neuen Block mit dem Namen <i>Erstellen Sie eine Sequenz von [Länge] Gesten</i>.<br/>Sie müssen sowohl die Optionen <i>Eingabenummer oder -text hinzufügen</i> als auch <i>Beschriftung hinzufügen</i> verwenden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-47": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-48": "Fügen Sie nun den Block `<i>Erstelle eine Sequenz von [Sequenzlänge] Gesten</i>` hinzu.<br/>Die Funktion `Erstelle eine Sequenz` verwendet den Wert der Variable `<i>Sequenzlänge</i>` als Argument für ihren Parameter `<i>Länge</i>`.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-49": "Füge diese Blöcke hinzu:<ul><li>Wenn ich [flick] erhalte</li><li>Füge [flick] zu [user input] hinzu</li></ul><p>Und</p><ul><li>Wenn ich [swoosh] erhalte</li><li>Füge [swoosh] zu [user input] hinzu</li></ul><br/>Du benötigst eine weitere Liste namens <i>user input</i>.<br/>Hier erfassen wir die Bewegungen des Spielers, um sie mit den erwarteten Bewegungen zu vergleichen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-50": "Fügen Sie diese Blöcke nach dem Block <i>Erstellen Sie eine Sequenz von [Sequenzlänge] Gesten</i> hinzu:<ul><li>Sagen Sie [2] Sekunden lang [Ich werde einige Gesten vorlesen]</li><li>Sagen Sie [Sie müssen sie in der gleichen Reihenfolge ausführen]</li><li>Sagen Sie [2] Sekunden lang [Fertig?!]</li><li>Wiederholen Sie [10]<ul><li>Sagen Sie [Sequenz] [2] Sekunden lang</li></ul></li><li>Löschen Sie die gesamte [Benutzereingabe]</li><li>Warten Sie, bis [[Länge der [Benutzereingabe]] = [Länge der [Sequenz]]]</li><li>Wenn [[Benutzereingabe] = [Sequenz]], dann<ul><li>Sagen Sie [2] Sekunden lang [Gut gemacht!]</li><li>Sagen Sie [2] Sekunden lang [Machen wir es komplizierter]</li><li>Ändern Sie [Sequenzlänge] um [1]</li><li>Erstelle eine Sequenz von [Sequenzlänge] Gesten</li></ul></li><li>Sonst <ul><li>Wenn [[Leben] > [0]], dann <ul><li>Sage [Ups! Nicht ganz] für [2] Sekunden</li><li>Sage [Versuch es noch einmal…] für [2] Sekunden</li><li>Ändere [Leben] um [-1]</li></ul></li><li>Sonst <ul><li>Beende das Spiel</li></ul></li></ul></li></ul><br/>Du musst einen neuen Block namens <i>Spiel beenden</i> erstellen",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-51": "Füge diese Blöcke hinzu, um die Funktion zum Beenden des Spiels zu definieren:<ul><li>Definiere [Spiel beenden]<ul><li>Sag [Das reicht fürs Erste. Gut gemacht!] für [2] Sekunden</li><li>Sag [beitreten [beitreten [Du hast einen Zauber gelernt mit] [[Sequenzlänge] - [1]]] [Gesten]] für [10] Sekunden</li><li>Stoppe [alle]</li></ul></li></ul><br/>Wenn der Spieler keine Leben mehr hat, wird ihm seine Punktzahl angezeigt – wie lange eine Bewegungssequenz war, die er sich merken und ausführen konnte.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-52": "Wähle Cog erneut aus und probiere es aus!<br/>Du kannst das Spiel vor dem Start immer noch im Vollbildmodus starten, um besser zu sehen, was die Hexe sagt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-53": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.description": "Lerne, wie Programmierer Variablen und Schleifen nutzen, um ihren Code zu optimieren!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-1": "In diesem Tutorial lernen wir, wie Programmierer <b/>Variablen</b> verwenden, um ihren Code zu optimieren!<br /><br />Variablen sind beim Programmieren sehr wichtig. Sie helfen Computern, sich Daten <b/>zu merken und zu bearbeiten</b>, sodass wir kompliziertere Aufgaben mit weniger Codezeilen erledigen können.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-4": "Um mit unserer <b/>mein Zähler</b>-Variable zu programmieren, können wir sie aus der Kategorie „Variablen“ in den Skriptbereich ziehen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-5": "Lassen wir Marty unsere Variable vorlesen!<br /><br />Wählen Sie den Block „Marty spricht“ und ersetzen Sie „Hallo“ durch die Variable <b/>mein Zähler</b> wie unten. Klicken Sie auf diesen Block und Sie sollten hören, wie Marty „Null“ sagt.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-8": "Hmm … Was, wenn wir wieder bis zehn zählen wollen? Wir müssen <b/>meinen Zähler</b> auf Null zurücksetzen! <br /><br />Wählen Sie im Skriptbereich „Meinen Zähler auf 0 setzen“ aus, klicken Sie darauf, und <b/>mein Zähler</b> sollte auf 0 zurückgesetzt werden.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-9": "Versuchen wir eine zusätzliche Herausforderung: Was wäre, wenn Marty durch Klicken auf die grüne Flagge von 0 bis 10 zählen könnte?<br /><br /> Marty müsste unseren Code so oft wiederholen, bis er bei zehn ist.\n<br /><br /> Dies können wir mit einem <b/>repeat until</b>-Block steuern. Platzieren Sie unseren vorhandenen Code darin wie folgt:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-10": "Wir möchten diesen Vorgang wiederholen, bis <b/>mein Zähler</b> mehr als 10 anzeigt.<br /><br /> Wählen Sie den Block „mehr als“ aus. Platzieren Sie ihn in der Raute von <b/>Wiederholen bis</b> und ändern Sie 50 in 10.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-11": "Lassen Sie uns unsere <b/>repeat until</b>-Anweisung vervollständigen.<br /><br /> Wir möchten die Schleife fortsetzen, bis mein Zähler größer als zehn ist.<br /><br /> Navigieren Sie zu den Variablen und füllen Sie die Wiederholungsanweisung mit <b/>my counter</b> wie folgt aus:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-12": "Denken Sie an Schritt 8 zurück. Wir möchten <b/>meinen Zähler</b> jedes Mal auf Null setzen, wenn wir mit dem Zählen beginnen möchten. <br /><br /> Ziehen Sie den Block <b/>setze meinen Zähler auf 0</b> und platzieren Sie ihn so vor unserem Wiederholungsblock.<br /><br /> Jetzt beginnt Marty immer bei 0.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-13": "Großartige Arbeit! Du bist fast am Ziel!<br/><br/>Füge abschließend am Anfang unseres Codes einen <b/>wenn grüne Flagge angeklickt</b>-Block hinzu, um ihn fertigzustellen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.description": "Lerne, wie Computer Code steuern, der gleichzeitig ausgeführt wird!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-1": "In diesem Tutorial lernen wir, wie Programmierer parallele Programme, Race Conditions und gegenseitigen Ausschluss verwenden, um die Ausführungsreihenfolge von Codeabschnitten zu steuern!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-4": "Um einen Race Condition zu demonstrieren, werden wir Marty bitten, gleichzeitig vorwärts und rückwärts zu gehen.<br/><br/>Zuerst schreiben wir unseren „Vorwärtsgehen“-Code.<br/><br/> Wählen Sie einen <b/>Wenn auf die grüne Flagge geklickt wird</b>-Block aus und ziehen Sie ihn in den Skriptbereich.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-5": "Platziere einen <b/>Gehe 2 Schritte vorwärts</b>-Block nach dem grünen Flaggenblock.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-7": "Fügen Sie abschließend einen <b/>Rückwärtsgehen</b>-Block hinzu, um unseren parallelen Code zu vervollständigen.<br/><br/>Kann Marty jetzt gleichzeitig vorwärts und rückwärts gehen? <b/>Nein!</b> Wir haben einen Wettlaufzustand geschaffen.<br/><br/><i/>Klicken Sie auf die grüne Flagge und sehen Sie, was Marty zuerst tun wird …</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-8": "Ist dir aufgefallen, dass Marty zuerst vorwärts und dann rückwärts gegangen ist? Lass uns herausfinden, warum.<br/><br/>Lösche zunächst deinen gesamten Code, damit wir von vorne anfangen können.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-10": "Lassen Sie uns nun auch unseren <b/>Walk Forwards</b>-Code neu erstellen. Ihr paralleler Code sollte folgendermaßen aussehen: <br/><br/><i/>Wenn Sie Hilfe benötigen, gehen Sie einfach zurück zu den Schritten 4 und 5!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-11": "Klicken Sie auf die grüne Flagge und sehen Sie, was Marty jetzt macht ... <b/>er geht zuerst rückwärts!</b><br/><br/> Das liegt daran, dass Martys Software Race Conditions behandelt, indem sie zuerst auf den <b/>ältesten</b> Code zugreift und ihn ausführt.<br/><br/>Das Problem ist, dass wir nicht einfach durch Hinsehen erkennen können, welcher Code zuerst erstellt wurde, und wenn wir komplizierteren Code schreiben, kann es verwirrend werden!<br/><br/>Sehen wir uns an, wie wir <b/>Wartefunktionen und Variablen</b> verwenden können, um unseren parallelen Code zu steuern!<br/><br/><br/><i/>Klicken Sie auf das Bild, um das Diagramm zu vergrößern.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-12": "Wie wir bereits gelernt haben, umgehen Programmierer Race Conditions durch gegenseitigen Ausschluss. <br/><br/>Das bedeutet, dass wir beide Codeteile gleichzeitig ausführen können, aber steuern können, welche Aktion <b/>tatsächlich</b> zuerst ausgeführt wird. <br/><br/>Zuerst verwenden wir einen Warteblock, um unseren Code gegenseitig auszuschließen. <br/><br/><br/><i/>Klicken Sie auf das Bild, um das Diagramm zu vergrößern.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-13": "Sagen wir Marty, er soll vorwärts und dann rückwärts gehen. <br/><br/>Marty braucht etwa 3 Sekunden, um vorwärts zu gehen, also platzieren wir vor „rückwärts gehen“ einen Warteblock und ändern den Parameter auf 3 Sekunden, passend zum Beispielcode unten.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-14": "Klicken Sie auf die grüne Flagge und sehen Sie zu, wie Marty als Erster nach vorne geht, genau wie wir es wollten! <br/><br/>Wir wissen also, dass Warteblöcke uns bei der gegenseitigen Ausgrenzung helfen können, aber für längeren, komplizierteren Code sind sie nicht so toll. <br/><br/>Die Zeit, die ein Code zum Ausführen benötigt, kann unterschiedlich und komplex sein, was es schwierig macht, eine Wartezeit genau vorherzusagen. <br/><br/>Schauen wir uns die Verwendung der <b/>variablen Steuerung</b> für eine genauere Methode der gegenseitigen Ausgrenzung an.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-15": "Wir verwenden eine Variable namens „nächster Zug“, um den Code für „rückwärts gehen“ und „vorwärts gehen“ gegenseitig auszuschließen. <br/><br/>Obwohl beide Codeblöcke beim Klicken auf die grüne Flagge ausgeführt werden, können wir Folgendes festlegen: <br/><br/>Mach erst dann einen Schritt vorwärts, wenn „nächster Zug“ gleich „vorwärts“ ist.</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-16": "Erstelle eine Variable namens „nächster Zug“. Mit dieser Variable steuern wir, welchen Zug Marty als Nächstes macht.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-18": "Anstatt eine bestimmte Anzahl von Sekunden zu warten, bevor er geht, soll Marty <b/>warten, bis</b> die nächste Bewegung auf den richtigen Wert eingestellt ist: vorwärts oder rückwärts. <br/><br/>Fügen Sie vor jedem Gehblock einen „Warte bis“-Block hinzu, wie hier gezeigt:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-22": "Wählen Sie abschließend einen Block <b/>Nächsten Zug festlegen auf</b> aus, um festzulegen, ob Marty zuerst vorwärts oder rückwärts gehen soll.<br/><br/> Nehmen wir an, Marty soll zuerst rückwärts gehen – geben Sie „rückwärts“ in das Parameterfeld ein und klicken Sie auf den Block, sodass der nächste Zug auf rückwärts gesetzt wird.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-23": "Geschafft! Du kannst jetzt <b/>Variablensteuerung</b> und Wartefunktionen verwenden, um parallelen Code gegenseitig auszuschließen!<br/> Klicke auf die grüne Flagge und beobachte, wie dein paralleler Code zusammenarbeitet.<br/><br/>Beide Codeblöcke werden gleichzeitig ausgeführt, aber deine Variable „nächster Zug“ stellt sicher, dass wir immer wissen, was als Nächstes kommt!<br/><br/><i/>Für eine zusätzliche Herausforderung kannst du versuchen, „nächster Zug“ in „vorwärts“ (oder sogar etwas Zufälliges wie „Banane“) zu ändern und zu sehen, wie Marty jetzt läuft …",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.description": "Lassen Sie uns parallele Programmierung mit variabler Steuerung verwenden, um Marty dabei zu helfen, all seine lustigen Gesichter zu zeigen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-3": "Fügen wir nun nacheinander einige von Martys ausdrucksstarken Lauten unter einem Block mit einer grünen Flagge hinzu.<br/><br/> Wir möchten Code schreiben, der besagt: <br/><i/> Wenn die grüne Flagge geklickt wurde <br/> Ton abspielen: Unglaube, bis fertig <br/> Ton abspielen: Nein!, bis fertig <br/> Ton abspielen: Aufgeregt, bis fertig</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-4": "Platzieren wir unseren ersten Soundblock unter einem der grünen Flaggenblöcke.<br/><br/>Wählen Sie im Dropdown-Feld „Unglaube“ aus, passend zu Martys überraschtem Gesicht!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-5": "Platzieren wir nun den zweiten Soundblock. <br/><br/>Wählen Sie im Dropdown-Feld „Nein!“ aus, passend zu Martys mürrischem Gesicht!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-7": "Jetzt schreiben wir etwas Code, um Martys Gesichtsausdrücke unter dem zweiten grünen Flaggenblock zu steuern. Unser Code soll Folgendes ausgeben: <br/><br/><i/>Wenn die grüne Flagge angeklickt wird: <br/>Augen weit aufgerissen <br/>Augen wütend <br/>Augen aufgeregt</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-8": "Platzieren wir unseren ersten <b/>Augen</b>-Block wie gezeigt unter dem zweiten grünen Flaggenblock. <br/><br/>Wählen Sie im Dropdown-Feld „Breit“ aus, um Martys überraschtes Gesicht zu zeigen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-9": "Platzieren wir nun den zweiten Augenblock. <br/><br/>Wählen Sie im Dropdown-Feld „wütend“ aus, um Martys wütendes Gesicht zu zeigen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-10": "Jetzt fügen wir den letzten Augenblock ein. <br/><br/>Wählen Sie im Dropdown-Menü „Aufgeregt“ aus, um Martys aufgeregtes Gesicht anzuzeigen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-13": "Navigieren Sie zur Registerkarte „Variablen“ und erstellen Sie eine Variable mit dem Namen <b/>Marty fühlt</b> <br/><br/>Wir verwenden diese, um sicherzustellen, dass Marty gleichzeitig den richtigen Ausdruck und Ton von sich gibt.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-14": "Wählen Sie unter „Variablen“ den Block „Marty fühlt sich 0“ aus und platzieren Sie ihn wie abgebildet vor dem ersten Soundblock. <br/><br/>Tragen Sie für 0 „überrascht“ ein.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-15": "Wählen Sie einen weiteren Block <b/>Setze Martys Gefühle auf 0</b> und platzieren Sie ihn wie gezeigt vor dem zweiten Soundblock. <br/><br/>Ergänze 0 mit „wütend“.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-16": "Wählen Sie einen letzten Block <b/>Setze Martys Gefühle auf 0</b> und platzieren Sie ihn wie gezeigt vor dem letzten Soundblock. <br/><br/>Ergänze 0 mit „aufgeregt“.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-17": "Damit unsere Variablen Martys Ausdrücke und Laute synchronisieren, platzieren wir vor jedem Ausdruck einen <b/>Warten bis</b>-Block. <br/><br/>Platzieren Sie drei <b/>Warten bis</b>-Blöcke, wie unten gezeigt:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-18": "Wir möchten, dass Marty <b/>wartet, bis</b> Marty überrascht ist, sodass er beispielsweise die Augen weitet. <br/><br/>Wählen Sie drei Gleichheitsoperatoren aus und füllen Sie sie wie unten gezeigt aus. <br/>Sie können die Blöcke <b/>Marty fühlt</b> auf der orangefarbenen Registerkarte „Variablen“ abrufen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-19": "Zum Schluss fügen wir die Warteblöcke mit den entsprechenden Gleichheitsblöcken wie unten gezeigt ein:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.description": "Lassen Sie uns den Unplugged-Modus mit allem, was wir bisher gelernt haben, nachbilden! If-Anweisungen, Schleifen, paralleler Code, Operatorblöcke und mehr ...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-1": "In diesem Tutorial werden wir den Unplugged-Modus mit allem, was wir bisher gelernt haben, nachbilden!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-2": "Bevor Sie mit diesem Tutorial beginnen, probieren Sie den Akku-losen Modus aus, um sich mit seiner Funktionsweise vertraut zu machen. <br/><br/>Trennen Sie Ihren Marty von der App und tippen Sie auf der Rückseite Ihres Marty auf „Modus“, um in den Akku-losen Modus zu wechseln.<br/><br/>Sammeln Sie je eine Kachel jeder Farbe, um den Farbsensor Ihres Marty zu testen und die Funktionsweise des Akku-losen Modus kennenzulernen. Verbinden Sie Ihren Marty anschließend wieder und kehren Sie zu diesem Tutorial zurück!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-4": "Platzieren Sie zunächst 5 grüne Flaggenblöcke im Skriptbereich, einen für jede Farbkachel im nicht angeschlossenen Zustand.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-6": "Für jeden Codeblock möchten wir sagen:<br/><br/><i/><b/>Wenn</b> Marty die Farbe Grün/Blau/Rot/Violett/Gelb wahrnimmt, <b/>dann</b> führe die entsprechende Aktion aus.</i><br/><br/>Fügen wir also in jede Forever-Schleife eine if-Anweisung ein.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-8": "Um jede if-Anweisung zu vervollständigen, platzieren Sie wie gezeigt einen Farberkennungsblock in jedem Gleichheitsoperator. <br/><br/>Stellen Sie sicher, dass Sie im Dropdown-Menü <i/>LeftColorSensor</i> auswählen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-10": "Um den Wiederholungsblock auszufüllen, möchten wir beispielsweise Folgendes angeben: <br/><br/><i/>Wiederhole, bis <b/>Nicht</b> Farbsensor = Grün</i>. <br/><br/>Füge in jedem Codeblock einen NOT-Operator wie unten gezeigt hinzu:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-11": "Um jeden Nicht-Operator auszufüllen, kopieren wir im Wesentlichen den Inhalt der If-Anweisung, wie unten gezeigt. <br/><br/>Wir erhalten am Ende Code, der besagt: <i/>wiederholen, bis <b/>Nicht</b> Farbsensor = grün</i> usw. <br/><br/>Das geht schnell, indem Sie mit der linken Maustaste auf den grünen Gleichheitsblock in der If-Anweisung klicken, auf „Duplizieren“ klicken und ihn nach unten in den <b/>Nicht</b>-Operator ziehen. <br/><br/><br/><i/>Alternativ können Sie zu den Schritten 7 und 8 zurückkehren, um einen Hinweis zum korrekten Ausfüllen zu erhalten!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-12": "Gut gemacht! Platzieren wir nun die richtige Aktion in jedem Codeblock. <br/><br/>Platzieren Sie im Codeblock, der Grün erkennt, <b/>zwei Schritte vorwärts gehen</b> im Block „Wiederholen bis“, wie hier gezeigt:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-13": "Fügen Sie innerhalb des Codeblocks, der Lila erkennt, den Befehl `<b/>1 Mal nach rechts schieben</b>` innerhalb des `repeat until`-Blocks ein, wie hier gezeigt. <br/><br/><br/><i/>Vergessen Sie nicht, die Dropdown-Liste zu verwenden, um von links nach rechts zu wechseln!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-15": "Platzieren Sie innerhalb des Codeblocks, der Gelb erkennt, <b/>zwei Schritte rückwärts gehen</b> innerhalb des Blocks „Wiederholen bis“, wie hier gezeigt:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-16": "Fast fertig!<br/><br/>Platzieren Sie innerhalb des Codeblocks, der Rot erkennt, einen <b/>Bewegungspause</b> und einen <b/>Tanz</b>-Block innerhalb des Wiederholungsblocks bis, wie hier gezeigt:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-18": "Schließlich möchten wir, dass Marty den gesamten Code stoppt, sobald er mit dem Feiern fertig ist.<br/><br/>Platzieren Sie nach dem Tanzblock einen <b/>Alles stoppen</b>-Block.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-20": "Platzieren Sie einen Block <b/>Setzen Sie LED-Augen auf</b> <b/>innerhalb der if-Anweisung, aber über dem Block „Wiederholen bis“</b> in jedem Codeabschnitt. <br/><br/>Ändern Sie die LED-Farbe in die entsprechende Farbe für diesen Block und stellen Sie sicher, dass Sie das Dropdown-Feld verwenden, um <b/>beide Augen</b> auszuwählen. <br/><br/>Ihr Code sollte folgendermaßen aussehen:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-21": "Wir finden Martys „Beep Beep!“-Geräusch in der Soundbibliothek unter dem Namen <b/>Arcade Beep</b>.<br/><br/>Kopieren Sie den Clip unten, um die Funktion <b/>Arcade Beep</b> in den Sounds zu finden.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-22": "Platzieren Sie einen <b/>Startsound: Arcade Beep</b>-Block nach jedem LED-Augenblock und vor jedem Wiederholungsblock. <br/><br/>Ihr Code sollte folgendermaßen aussehen:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-23": "Du hast es geschafft! Fantastisch!<br/><br/>Du hast Parallelprogramme, Variablen, Operatoren, Sensoren, Schleifen und vieles mehr verwendet, um den Unplugged-Modus ganz allein nachzubauen!<br/><br/><i/>Als zusätzliche Herausforderung: Was kannst du Marty noch tun lassen, wenn er die einzelnen Farben sieht?",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.description": "Lassen Sie uns lernen, wie Programmierer Listen verwenden, um so viele coole Dinge zu tun!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-1": "In diesem Tutorial lernen wir alles über Listen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-2": "Was ist also eine Liste in der Programmierung? <b/>Programmierer verwenden Listen, manchmal auch Arrays genannt, um Daten in einer bestimmten Reihenfolge zu speichern. <br/><br/>Programmierer können steuern, wie Daten der Liste hinzugefügt, daraus entfernt und in ihr gespeichert werden, und sie können Daten anhand ihrer Nummer in der Liste (Index genannt) bezeichnen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-3": "In dieser Liste könnten wir beispielsweise sagen: <br/><br/><i/>Person Nummer 2 entfernen</i>, anstatt <i/>Marty entfernen</i>. <br/><br/><i/>Person Nummer 3 und Nummer 4 tauschen</i>, anstatt <i/>Sam und Kirsty tauschen</i>. <br/><br/>Listen helfen Programmierern, Informationen einfach zu verwalten und zu speichern, auch wenn diese sich ändern.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-4": "In diesem Tutorial verwenden wir eine Liste, um Marty dabei zu helfen, sich eine Reihe von Farbkacheln einzuprägen, auf denen er läuft.<br/><br/>Bevor wir mit dem Programmieren beginnen, benötigen Sie 4 Kacheln für den nicht angeschlossenen Modus, die in einer Reihe wie dieser angeordnet sind:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-6": "Jedes Mal, wenn Marty zu einer neuen Kachel geht, fügen wir die Farbe aus seinem Farbsensor zu unserer „Farben“-Liste hinzu.<br/><br/>Wählen Sie den Block <b/>Ding zu Farben hinzufügen</b> aus.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-7": "Wählen Sie einen Farbsensorblock aus und platzieren Sie ihn im Block „Farben hinzufügen“. <br/><br/> Unser Code besagt nun: <i/>Die von Marty erfasste Farbe wird der Liste „Farben“ hinzugefügt.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-9": "Bevor Marty seinen Farbsensor überprüft, sollten wir ihn bitten, eine Pause einzulegen, um einen genauen Messwert zu erhalten. Fügen Sie einen <b/>Bewegungspausenblock</b> wie unten gezeigt hinzu:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-12": "Super! Jetzt lassen wir Martys LEDs alle Farben unserer Liste anzeigen. <br/><br/>Wechseln Sie zum Tab „Variablen“ und wählen Sie den Block „<b/>Farben 1</b>“ aus. <br/><br/>Ersetzen Sie den farbigen Kreis durch „Farben 1“ und ändern Sie die Zahl in 1, 2, 3 und 4, wie hier gezeigt:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-13": "Fast fertig! <br/><br/>Fügen Sie vor jedem LED-Block einen <b/>wait 1 seconds</b>-Block wie unten gezeigt ein, um genügend Zeit für jeden Farbwechsel zu gewährleisten.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-14": "Du hast es geschafft! <br/><br/>Stelle deinen Marty nun an den Anfang deiner Fliesenreihe, wie hier gezeigt, und beobachte, wie Marty sich jede Farbe merkt!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.description": "Lassen Sie uns lernen, wie Programmierer Listen verwenden, um so viele coole Dinge zu tun!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-1": "In diesem Tutorial verwenden wir eine Liste, um Martys Einkaufsliste zu schreiben. Anschließend schreiben wir Code in einer Schleife, damit Marty seine Einkaufsliste laut vorliest!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-2": "Lassen Sie uns zunächst unsere Liste erstellen. <br/><br/> Navigieren Sie zur Registerkarte „Variablen“ und klicken Sie auf „Liste erstellen“. <br/><br/>Nennen Sie die Liste „Farben“ und klicken Sie auf „OK“.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-4": "Als Nächstes braucht Marty Kabel!<br/><br/>Behalte den gleichen Block wie zuvor bei, tausche <b/>Batterien</b> gegen <b/>Kabel</b> aus und klicke auf den Block.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-5": "Marty braucht auch Schrauben und Muttern! <br/><br/>Verwenden Sie denselben Block, um Schrauben und Muttern zur Liste hinzuzufügen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-6": "Marty sagt, das Wichtigste, was er kaufen muss, sind Süßigkeiten!<br/><br/>Wählen Sie den Block <b/>Ding an 1 von Martys Einkaufsliste einfügen</b>.<br/><br/>Schreiben Sie statt <b/>Ding</b> <b/>Süßigkeiten</b>, klicken Sie auf den Block und sehen Sie zu, wie Süßigkeiten an Nummer 1 der Liste erscheinen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-7": "Das Tolle an Listen ist, dass sie das Programmieren super einfach machen! <br/><br/>Beide Codeblöcke lesen Martys Einkaufsliste aus. <br/><br/>Ohne Liste, wie im linken Beispiel, müssten wir den Code jedes Mal ändern, wenn sich Martys Einkaufsliste ändert. <br/><br/>Mit einer Liste, wie im rechten Beispiel, können wir Code schreiben, der immer funktioniert – egal wie lang die Liste ist oder was hinzugefügt oder entfernt wird!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-9": "Um unsere iterative Schleife zu starten, wählen Sie einen \"Wiederhole bis\"-Block aus.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-11": "Lassen Sie uns die wiederholte Aufgabe in unserer iterativen Schleife einrichten: Marty liest Elemente aus seiner Liste vor. <br/><br/>Navigieren Sie zur Registerkarte „Sprechen“, wählen Sie einen Block „<b/>Marty spricht</b>“ aus und platzieren Sie ihn in der Wiederholungsschleife.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-14": "Zum Schluss legen wir die Bedingung für unsere iterative Schleife fest: <i/>Wiederhole bis: Artikelnummer ist größer als Martys Einkaufsliste</i> <br/><br/>Fügen Sie einen Größer-als-Operator innerhalb der Wiederholungs-bis-Anweisung ein, wie gezeigt.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-17": "Super! Klicke jetzt auf deinen Code und hör dir an, wie Marty uns seine Einkaufsliste vorliest! <br/><br/>Du hast alles über Listen gelernt, wie man Elemente hinzufügt und entfernt, wie man ihre Nummern im Code verwendet und sogar, wie man sie durchläuft!",
  "gui.menuBar.sensorsDashboard": "Sensoren-Dashboard",
  "gui.menuBar.showCode": "Code anzeigen",
  "gui.gui.toggleMartyMachineTab": "Maschinelles Lernen",
  "gui.gui.toggleSaveLoadTab": "Speichern/Laden",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.name": "Cog und Marty Interaktion",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.description": "Erfahren Sie, wie <b>Cog</b> und <b>Marty</b> miteinander interagieren können",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1": "In diesem Tutorial erfahren wir, wie <b>Cog</b> und <b>Marty</b> miteinander interagieren können. Klicken Sie auf „Weiter“, um zu beginnen!",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1": "Als Erstes stellen wir eine Verbindung zu Cog her. Klicken Sie auf die Schaltfläche „Gerät verbinden“ und wählen Sie dann Cog aus.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1.1": "Super! Klicken Sie nun auf die Schaltfläche „Verbinden“, um eine Verbindung zu Cog herzustellen.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2": "Als Nächstes verbinden wir uns mit Marty. Klicken Sie auf die Schaltfläche „Gerät verbinden“ und wählen Sie dann Marty aus.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2.1": "Super! Klicke jetzt auf „Verbinden“, um dich mit Marty zu verbinden.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-2": "Jetzt, da wir mit den Robotern verbunden sind, können wir mit dem Programmieren beginnen! Um die Blöcke von Cog zu sehen, klicken Sie auf die Schaltfläche „Cog-Gerät“.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3.hint": "Der Ereignisblock „On Click Cog“ befindet sich in der Kategorie „Ereignis“. Ziehen Sie ihn in den Skriptbereich, um mit dem Programmieren zu beginnen.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5": "Ziehen Sie nun den Block „Nachricht senden“ aus der Kategorie „Ereignisse“ in den Skriptbereich. Dieser Block sendet eine Nachricht, wenn Cogs Taste gedrückt wird.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5.hint": "Der Block „Broadcast-Nachricht“ befindet sich in der Kategorie „Ereignisse“. Ziehen Sie ihn in den Skriptbereich, um mit der Programmierung zu beginnen.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-6": "Kommen wir nun zu Marty. Wir müssen Marty auswählen, um die Marty-Blöcke anzuzeigen. Klicken Sie auf die Schaltfläche Marty-Gerät",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7": "Sobald Sie sich im Marty-Modus befinden, ziehen Sie den Block „Wenn ich eine Nachricht erhalte“ aus der Kategorie „Ereignisblöcke“ in den Skriptbereich. Dieser Block überwacht gesendete Nachrichten.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-9": "Wir sind fast da! Ziehe den Block „Tanzen!“ in den Skriptbereich. Dieser Block lässt Marty tanzen, wenn die Nachricht empfangen wird.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-10": "Super gemacht! Du hast Cog und Marty erfolgreich so programmiert, dass sie miteinander interagieren. Klicke jetzt auf Cogs Knopf, um Marty tanzen zu sehen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.name": "Einführung in die Zahnradlichter und -geräusche",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.description": "Lerne, wie du Cog mit Blöcken programmierst und durch Interaktion mit Cog Töne und Lichter auslöst.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-1": "Lasst uns lernen, wie man Cog mit Blöcken programmiert! <br /><br />Wir verbinden uns mit Cog und lassen es leuchten und Geräusche machen, wenn der Knopf gedrückt wird!<br /><br />Wir lernen außerdem <b>Seriencode</b> kennen, der nacheinander ausgeführt wird, und <b>Parallelcode</b>, der gleichzeitig ausgeführt wird.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-3": "Super! Klicke nun auf die Schaltfläche „Verbinden“, um dich mit Cog zu verbinden.<br /><br>Auch diesen Schritt kannst du überspringen, wenn du bereits mit einem Cog verbunden bist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-4": "Super! Sie sollten jetzt ein Zahnrad hinzugefügt haben, und es sollte mit Ihrem Zahnrad verbunden sein",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-5": "Wählen Sie die Kategorie „Veranstaltungen“ aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6": "Fügen Sie einen Block <b>Beim Tastendruck</b> hinzu",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-7": "Wählen Sie die Kategorie „Looks“ aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8.hint": "Der Block „[Ring]-LEDs auf [Farbe] einstellen“ befindet sich in der Kategorie „Aussehen“. Ziehen Sie ihn in den Skriptbereich und verbinden Sie ihn mit dem Block „Bei Tastendruck“",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-10": "Ändern Sie die Farbe der LEDs, indem Sie auf den Farbklecks klicken oder drücken und dann den Farbbalken ziehen. <br /><br />Sie können auch die Sättigung (wie lebendig eine Farbe ist) und die Helligkeit ändern – wenn Sie diese auf 0 setzen, sind die LEDs ausgeschaltet",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12": "Fügen Sie einen <b>Beim Schütteln</b>-Block hinzu",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12.hint": "Der Ereignisblock „Beim Schütteln“ befindet sich in der Kategorie „Ereignis“. Ziehen Sie ihn in den Skriptbereich, weg vom bereits vorhandenen Code.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13": "Füge unter dem Block „Beim Schütteln“ einen <b>LEDs ausschalten</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13.hint": "Der Block „LEDs ausschalten“ befindet sich in der Kategorie „Aussehen“. Ziehen Sie ihn in den Skriptbereich und verbinden Sie ihn mit dem Block „Beim Schütteln“.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-14": "Probier es aus! <br /><br />Schüttel das Zahnrad, dann sollten die Lichter ausgehen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-16": "Probieren Sie es aus! <br /><br />Drücken Sie den Knopf am Cog und jetzt sollte das Licht im Knopf angehen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-17": "Schütteln Sie das Zahnrad, um die LEDs auszuschalten.<br /><br />Ändern Sie nun dasselbe Dropdown-Menü, um stattdessen „Alle“ auszuwählen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-18": "Probieren Sie es aus! <br /><br />Drücken Sie den Knopf auf Cog und alle Lichter sollten angehen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19": "Füge unter dem Block „LED-Farbe einstellen“ einen <b>Set [ring] LEDs auf Muster [Flash] einstellen</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-21": "Ändere das Muster auf „Spin1“ und probiere es aus!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-22": "Probieren Sie die anderen Muster in der Liste aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23": "Füge unter dem vorherigen Block einen weiteren <b>Set [ring] LEDs auf Muster [Blinken]</b> ein und ändere ihn so, dass der Knopf blinkt.<br /><br />Probiere es aus, indem du den Knopf auf dem Zahnrad drückst.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25": "Fügen Sie einen Block <b>LEDs mit dem Farbwähler einstellen</b> hinzu, der mit dem Block „Beim Tastendruck“ verbunden ist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25.hint": "Der Block „LEDs mit dem ColorPicker einstellen“ befindet sich in der Kategorie „Looks“. Ziehen Sie ihn in den Skriptbereich und verbinden Sie ihn mit dem Ereignis „Bei Tastendruck“",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27": "Legen Sie auch die Farbe der Schaltfläche fest, indem Sie einen Block <b>[Ring]-LEDs auf [Farbe] einstellen</b> hinzufügen und ihn ändern, um die Schaltfläche auf Ihre bevorzugte Farbe einzustellen",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27.hint": "Der Block „Setze [Ring]-LEDs auf [Farbe]“ befindet sich in der Kategorie „Looks“. Ziehe ihn in den Skriptbereich und verbinde ihn mithilfe des Blocks „ColorPicker“ mit dem Block „Setze LEDs“.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-28": "Probieren Sie es aus! Drücken Sie die Taste und die Lichter wechseln jeweils in die von Ihnen gewählte Farbe",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-29": "Wählen Sie die Kategorie „Steuerung“",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31": "Fügen Sie unter dem Warteblock einen weiteren Block <b>LEDs mit dem Farbwähler einstellen</b> hinzu und ändern Sie dann die Farben nach Wunsch",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32": "Ändern Sie auch die Farbe der Schaltfläche, indem Sie einen Block <b>[Ring]-LEDs auf [Farbe] einstellen</b> hinzufügen und ihn ändern, um die Schaltfläche auf Ihre Lieblingsfarbe einzustellen",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32.hint": "Der Block „[Ring]-LEDs auf [Farbe] einstellen“ befindet sich in der Kategorie „Looks“. Ziehen Sie ihn in den Skriptbereich und verbinden Sie ihn mit dem letzten Block „LEDs einstellen“ mithilfe des Farbauswahl-Blocks. Wählen Sie anschließend im Dropdown-Menü „Schaltfläche“ aus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-33": "Probier es aus! Drück den Knopf, die Lichter schalten sich ein und wechseln dann nach 1 Sekunde!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34": "Füge einen weiteren <b>Bei Tastendruck</b>-Block hinzu",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36": "Füge unter dem soeben hinzugefügten „Bei Tastendruck“-Block einen <b>Spiele Note [C4] für [1] Sekunden</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-37": "Ändern Sie die Note in C5 und probieren Sie es aus, indem Sie die Taste auf Cog drücken!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38": "Fügen Sie zwischen dem Block „Beim Tastendruck“ und dem Block „Note abspielen“ einen Block <b>Ton von [200] bis [300] Hz für [3] Sekunden abspielen</b> hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-39": "Ändern Sie die Zahlen im Block „Ton abspielen“, um 1 Sekunde lang von 260 auf 523 Hz zu wechseln.<br /><br />Jede Musiknote hat eine Frequenz, und 523 Hz ist die Frequenz von C5 – C in der fünften Oktave.<br /><br />Probieren Sie es aus, indem Sie die Taste auf Cog drücken",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-40": "Wenn Sie den Knopf drücken, ereignen sich die Töne und Lichter gleichzeitig – wir sagen, sie laufen parallel.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-41": "Die einzelnen Töne und Lichter treten nacheinander auf – wir sagen, sie laufen in einer <b>Reihe</b> oder Sequenz ab.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-42": "Super gemacht! Du hast gelernt, Cog zu programmieren, sodass es auf Knopfdruck und Schütteln reagiert und Geräusche und Lichter erzeugt!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.name": "Stelle einen 13-seitigen Würfel her!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.description": "Wir verwandeln Cog in einen Würfel, der bei jedem Schütteln eine andere Anzahl von Lichtern anzeigt!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-1": "Lasst uns Cog so programmieren, dass es etwas Nützliches ist – ein Würfel!<br /><br />Wir lassen Cog auf Schütteln reagieren, indem es eine zufällige Anzahl von Lichtern anzeigt und die gleiche Anzahl von Pieptönen ausgibt.<br /><br />Dafür lernen wir <b>Variablen</b> kennen – spezielle Blöcke, deren Wert sich ändern kann – und <b>Bedingungen</b> – Blöcke, die eine Entscheidung treffen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-2": "Stellen Sie zunächst sicher, dass Sie mit einem Zahnrad verbunden sind.<br /><br />Falls nicht, fügen Sie eines hinzu, wie im letzten Tutorial, indem Sie im Gerätebereich auf die Schaltfläche „Hinzufügen“ klicken, ein Zahnrad auswählen und dann auf „Verbinden“ klicken. Springen Sie bei Bedarf zurück zum letzten Tutorial, um zu sehen, wie",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-4": "Wählen Sie die Kategorie <b>Variablen</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-5": "Klicken Sie auf die Schaltfläche <b>Variable erstellen</b>.<br /><br />Geben Sie als Namen für die neue Variable <b>ledID</b> ein und klicken Sie auf OK.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-6": "Wählen Sie die Kategorie <b>Steuerung</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7": "Füge einen <b>Wiederholungsblock</b> hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7.hint": "Der Block „Wiederholen“ befindet sich in der Kategorie „Steuerung“. Ziehen Sie ihn in den Skriptbereich und verbinden Sie ihn mit dem Block „Beim Schütteln“.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8": "Gehen Sie zur Kategorie <b>Looks</b> und fügen Sie innerhalb des Wiederholungsblocks einen Block <b>LED [1] auf [Farbe] einstellen</b> hinzu.<br /><br />Ändern Sie die Farbe in Ihre Lieblingsfarbe :-)",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8.hint": "Der Block „Setze LED [1] auf [Farbe]“ befindet sich in der Kategorie „Looks“. Ziehe ihn in den Skriptbereich und platziere ihn so, dass er im Wiederholungsblock einrastet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-9": "Probieren Sie es aus! <br /><br />Was passiert, wenn Sie das Zahnrad schütteln?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10.hint": "Der Block „Ändere [ledID] um [1]“ befindet sich in der Kategorie „Variablen“. Ziehen Sie ihn in den Skriptbereich und platzieren Sie ihn so, dass er im Wiederholungsblock direkt nach dem Block „LED setzen“ einrastet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-11": "Ziehen Sie die Variable <b>ledID</b> in den Block <b>Set LED</b>, sodass dort <b>Set LED <i>ledID</i> to [color]</b> steht.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-12": "Probier es aus!<br /><br />Was passiert, wenn du Cog schüttelst?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14": "Fügen Sie direkt nach dem Block „Bei Schütteln“ und vor dem Wiederholungsblock einen <b>Setze [ledID] auf [0]</b>-Block ein.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14.hint": "Der Block „Setze [ledID] auf [0]“ befindet sich in der Kategorie „Variablen“. Ziehen Sie ihn in den Skriptbereich und platzieren Sie ihn so, dass er direkt nach dem Block „Bei Schütteln“ und vor dem Wiederholungsblock einrastet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15": "Fügen Sie außerdem einen Block <b>Alle LEDs ausschalten</b> aus der Kategorie <b>Aussehen</b> hinzu.<br /><br />Fügen Sie ihn direkt vor dem Wiederholungsblock hinzu, nach dem Block <i>[ledID] auf [0] setzen</i>, den Sie gerade hinzugefügt haben.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-17": "Gehen Sie zur Kategorie <b>Operatoren</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-19": "Cog verfügt über 13 programmierbare LEDs – 12 im Ring und eine im Knopf.<br /><br />Ändere den <b>Zufallsauswahl</b>-Block so, dass er eine Zahl zwischen 1 und <b>13</b> auswählt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-20": "Probieren Sie es aus! <br /><br />Jetzt leuchtet jedes Mal, wenn Sie Cog schütteln, eine andere Anzahl von Lichtern auf.<br /><Br />Sie haben Cog als Würfel programmiert!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22.hint": "Der Block „Note [C4] für [1] Sekunden spielen“ befindet sich in der Kategorie „Sounds“.<br /><br />Achten Sie darauf, ihn innerhalb der Wiederholungsschleife einzufügen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23": "Fügen Sie außerdem eine kurze Pause hinzu, indem Sie einen Block <b>Warten [1] Sekunden</b> aus der Kategorie <b>Steuerung</b> hinzufügen.<br /><br />Ändern Sie die Länge der Pause ebenfalls auf <b>0,1 Sekunden</b>.<br /><br />Wenn wir keine Pause hinzufügen, können wir nicht erkennen, wie viele Pieptöne es gibt, da sie alle zu einem langen Piepton verschmelzen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23.hint": "Der Block „Warte [1] Sekunden“ befindet sich in der Kategorie „Steuerung“. Füge ihn dem Code hinzu, indem du ihn in die Wiederholungsschleife ziehst.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25.hint": "Der „if __ then“-Block befindet sich in der Kategorie „Steuerung“. Fügen Sie ihn per Drag & Drop so in den Code ein, dass er nach der Wiederholungsschleife anschließt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-26": "Gehen Sie zur Kategorie <b>Operatoren</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27": "Ziehen Sie den Block <b>=</b> <b>in den Block <i>if</i></b><br /><br />Hier legen wir die <b>Bedingung</b> fest.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27.hint": "Der Block „=“ befindet sich in der Kategorie „Operatoren“. Ziehen Sie ihn auf die entsprechende Form im Block „if“",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-28": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-29": "Der Code in diesem <b>if</b>-Block wird nur ausgeführt, <b>wenn</b> die <b>Variable</b> ledID <b>gleich</b> 13 ist.<br /><br />Dies wird überprüft, nachdem der <b>repeat</b>-Block die Wiederholung beendet hat, während der Code in der Sequenz fortgesetzt wird.<br /><br />Wenn die <b>Variable</b> ledID etwas anderes als 13 ist, wird der gesamte <b>if</b>-Block und jeglicher darin enthaltener Code übersprungen.<br /><br />Der <b>if</b>-Block ist eine Art <b>Bedingung</b> – der darin enthaltene Code wird nur ausgeführt, wenn die von Ihnen festgelegte <b>Bedingung</b> erfüllt ist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30": "Fügen wir etwas in den <b>if</b>-Block ein!<br /><br />Gehe zur Kategorie <b>Sounds</b> und füge einen <b>Spielmelodie</b>-Block hinzu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30.hint": "Der Block „Melodie abspielen“ befindet sich in der Kategorie „Sounds“. Fügen Sie ihn per Drag & Drop in den Code ein, sodass er innerhalb der if-Bedingung verbunden ist.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-31": "Ändern Sie die Melodie im Dropdown-Menü auf <b>Pfeife</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32.hint": "Der Block „[Ring]-LED auf Muster [Blinken] einstellen“ befindet sich in der Kategorie „Aussehen“. Fügen Sie zwei davon innerhalb der if-Bedingung hinzu und ändern Sie einen, um das Tastenmuster festzulegen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-33": "Probieren Sie es aus!<br /><br />Versuchen Sie, eine 13 zu würfeln, indem Sie Cog schütteln!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-42": "Loading...",
  "gui.spriteSelector.sprites": "SPRITES",
  "gui.deviceSelector.devices": "GERÄTE",
  "gui.spriteSelector.addSpriteFromLibrary": "Wähle einen Sprite",
  "gui.spriteSelector.addSpriteFromPaint": "Malen",
  "gui.spriteSelector.addSpriteFromSurprise": "Überraschung",
  "gui.spriteSelector.addSpriteFromFile": "Sprite hochladen",
  "gui.deviceSelector.addDeviceByConnecting": "Verbindung zu einem Gerät herstellen",
  "gui.deviceSelector.addDeviceFromLibrary": "Wählen Sie ein Gerät aus",
  "gui.spriteSelector.noSpritesInUse": "Loading...",
  "gui.deviceSelector.noDevicesInUse": "Loading...",
  "gui.saveLoad.localStorageTitle": "In der App",
  "gui.saveLoad.localStorageSubtitle": "Lokaler Speicher",
  "gui.saveLoad.cloudStorageTitle": "Loading...",
  "gui.saveLoad.cloudStorageSubtitle": "Loading...",
  "gui.saveLoad.portableFileStorageTitle": "Loading...",
  "gui.saveLoad.portableFileStorageSubtitle": "Loading...",
  "gui.saveLoad.createNewSaveFile": "Erstellen Sie eine neue Sicherungsdatei:",
  "gui.saveLoad.savedFilesTitle": "Loading...",
  "gui.saveLoad.deleteFile": "Löschen",
  "gui.saveLoad.loadFile": "Laden",
  "gui.saveLoad.saveFile": "Loading...",
  "gui.saveLoad.saveFileNamePlaceholder": "Loading...",
  "gui.saveLoad.fileLoadError": "Das Laden des Projekts ist fehlgeschlagen.",
  "gui.saveLoad.fileSaveError": "Projekt konnte nicht gespeichert werden.",
  "gui.saveLoad.overwriteFile": "Loading...",
  "gui.saveLoad.copyToClipboard": "In die Zwischenablage kopieren",
  "gui.saveLoad.copied": "Loading...",
  "gui.saveLoad.saveProject": "Projekt speichern",
  "gui.saveLoad.projectSaved": "Projekt erfolgreich gespeichert!",
  "gui.saveLoad.projectSaveFailed": "Projekt konnte nicht gespeichert werden",
  "gui.saveLoad.projectLoaded": "Projekt erfolgreich geladen!",
  "gui.saveLoad.projectLoadFailed": "Projekt konnte nicht geladen werden",
  "gui.saveLoad.loadProjectPlaceholder": "Geben Sie hier den Namen der Cloud-Speicherdatei ein, die Sie laden möchten...",
  "gui.saveLoad.createNewCloudSave": "Loading...",
  "gui.saveLoad.saveFileCode": "Ihr automatisch generierter Save File Code lautet:",
  "gui.saveLoad.saveFilePlaceholder": "Ihr automatisch generierter Save File Code lautet:",
  "gui.saveLoad.loadProjectTitle": "Projekt laden",
  "gui.saveLoad.tipsTitle": "Loading...",
  "gui.saveLoad.tips1": "Notieren Sie sich den automatisch generierten Code, der bei jedem Speichern einer neuen Datei bereitgestellt wird. Sie benötigen ihn, um die Datei später laden zu können.",
  "gui.saveLoad.tips2": "Die Marty the Robot-App speichert Dateien weiterhin automatisch lokal, jedoch gibt es keine automatische Speicherfunktion für Cloud-Dateien. Bitte speichern Sie Ihre Datei jedes Mal manuell neu, wenn Sie sie in der Cloud herunterladen möchten.",
  "gui.saveLoad.tips3": "Jedes Mal, wenn Sie eine Datei in der Cloud speichern, erhalten Sie einen neuen Speichercode. Bitte notieren Sie sich diesen.",
  "gui.saveLoad.saveToFile": "In Datei speichern",
  "gui.saveLoad.loadFromFile": "Loading...",
  "gui.saveLoad.fileSaved": "Datei gespeichert!",
  "gui.martyMachineModelEditor.model": "Loading...",
  "gui.martyMachineModelEditor.className": "Loading...",
  "gui.martyMachineModelEditor.createNewClass": "Klasse erstellen",
  "gui.martyMachineModelEditor.samples": "Proben",
  "gui.MartyMachineModelEditor.record": "Loading...",
  "gui.MartyMachineModelEditor.stop": "Loading...",
  "gui.MartyMachineModelEditor.train": "Zug",
  "gui.MartyMachineModelEditor.run": "Laufen",
  "gui.MartyMachineModelEditor.save": "Loading...",
  "gui.MartyMachineModelEditor.saving": "Loading...",
  "gui.martyMachineTab.addNew": "Neues Modell hinzufügen",
  "gui.martyMachineTab.newImageModelMarty": "Neues Imagemodell (Marty)",
  "gui.martyMachineTab.newImageModelDevice": "Neues Bildmodell (Gerät)",
  "gui.martyMachineTab.newAccelerometerModel": "Neues Beschleunigungsmessermodell",
  "gui.martyMachineTab.newAudioModel": "Loading...",
  "gui.martyMachineTab.loadTMModel": "TM-Modell laden",
  "gui.martyMachineTab.tutorials": "Anleitungen",
  "gui.martyMachineTab.alertSelectDevice": "Loading...",
  "gui.martyMachineTab.alertConnectDevice": "Hoppla! Bitte schließen Sie das Gerät an, um das Beschleunigungsmessermodell zu verwenden.",
  "gui.martyMachineTab.alertModelNameExists": "Dieser Modellname ist bereits vergeben, bitte wählen Sie einen anderen Namen.",
  "martyMachine.modelNameExists": "Hoppla! Der Modellname ist bereits vorhanden. Bitte wählen Sie einen anderen Namen.",
  "martyMachine.backgroundNoiseClassNeedsSamples": "Ups! Die Klasse für Hintergrundgeräusche benötigt mindestens 10 Trainingsbeispiele. Bitte fügen Sie der Klasse für Hintergrundgeräusche weitere Beispiele hinzu.",
  "martyMachine.classNameExists": "Loading...",
  "martyMachine.selectClassAlert": "Bitte fügen Sie eine Klasse hinzu oder wählen Sie eine bestehende aus, bevor Sie die Sprachaufnahmen starten.",
  "gui.MartyMachineNewModelConfirmationModal.label": "Nicht gespeicherte Änderungen gehen verloren.",
  "gui.MartyMachineNewModelConfirmationModal.headsUp": "Nur zur Info! Änderungen am aktuellen Modell werden nicht gespeichert. Möchten Sie fortfahren?",
  "gui.MartyMachineNewModelConfirmationModal.close": "Loading...",
  "gui.MartyMachineNewModelConfirmationModal.continue": "Weitermachen",
  "gui.TfVisChart.loadingTitle": "Loading...",
  "gui.TfVisChart.loadingSubtitle": "Dies kann eine Weile dauern, bitte warten Sie …",
  "gui.MartyMachineModelEditor.requiresAtLeast10Samples": "Loading...",
  "gui.MartyMachineModelEditor.createNewClass": "Neue Klasse erstellen",
  "gui.howtos.marty-machine-create-model.name": "KI-Modell erstellen",
  "gui.howtos.marty-machine-create-model.step_create-model": "Neues Modell erstellen",
  "gui.howtos.marty-machine-create-audio-model.step_visit-user-guide": "Weitere Informationen finden Sie in unserem Benutzerhandbuch.",
  "gui.howtos.marty-machine-create-image-model.name": "Loading...",
  "gui.howtos.marty-machine-create-image-model.step_create-image-model": "Loading...",
  "gui.howtos.marty-machine-create-image-model.step_change-model-name": "Modellnamen ändern",
  "gui.howtos.marty-machine-create-image-model.step_collect-data": "Daten sammeln",
  "gui.howtos.marty-machine-create-image-model.step_train-model": "Loading...",
  "gui.howtos.marty-machine-create-image-model.step_run-model": "Modell ausführen",
  "gui.howtos.marty-machine-create-image-model.step_save-model": "Modell speichern",
  "gui.howtos.marty-machine-create-audio-model.name": "Audiomodell erstellen",
  "gui.howtos.marty-machine-create-audio-model.step_create-audio-model": "Neues Audiomodell erstellen",
  "gui.howtos.marty-machine-create-audio-model.step_change-model-name": "Modellnamen ändern",
  "gui.howtos.marty-machine-create-audio-model.step_collect-data": "Daten sammeln",
  "gui.howtos.marty-machine-create-audio-model.step_train-model": "Loading...",
  "gui.howtos.marty-machine-create-audio-model.step_run-model": "Modell ausführen",
  "gui.howtos.marty-machine-create-audio-model.step_save-model": "Modell speichern",
  "gui.howtos.marty-machine-load-tm-model.name": "Lehrbares Maschinenmodell laden",
  "gui.howtos.marty-machine-load-tm-model.step_load-tm-model": "Lehrbares Maschinenmodell laden",
  "gui.howtos.marty-machine-load-and-run-image-model.name": "Image-Modell laden und ausführen",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-and-run-image-model": "Rufen Sie die KI-Blöcke auf",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-model": "Modell laden",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classification-on": "Klassifizierung aktivieren",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classify-image": "Bild klassifizieren",
  "gui.howtos.marty-machine-load-and-run-audio-model.name": "Audiomodell laden und ausführen",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-and-run-audio-model": "Rufen Sie die KI-Blöcke auf",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-model": "Modell laden",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classification-on": "Klassifizierung aktivieren",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classify-audio": "Loading..."
}