{
  "gui.menuBar.sensorsDashboard": "Πίνακας Αισθητήρων",
  "gui.menuBar.showCode": "Εμφάνιση κωδικού",
  "gui.gui.toggleMartyMachineTab": "Μηχανική Μάθηση",
  "gui.gui.toggleSaveLoadTab": "Αποθήκευση/Φόρτωση",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.name": "Αλληλεπίδραση Cog και Marty",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.description": "Μάθετε πώς το <b>Cog</b> και ο <b>Marty</b> μπορούν να αλληλεπιδράσουν μεταξύ τους",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1": "Σε αυτό το σεμινάριο θα μάθουμε πώς το <b>Cog</b> και ο <b>Marty</b> μπορούν να αλληλεπιδράσουν μεταξύ τους. Πατήστε «Επόμενο» για να ξεκινήσετε!",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1": "Αρχικά, ας συνδεθούμε στο Cog. Κάντε κλικ στο κουμπί «Επιλέξτε συσκευή» και, στη συνέχεια, επιλέξτε το Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1.1": "Τέλεια! Τώρα κάντε κλικ στο κουμπί «Connect» για να συνδεθείτε στο Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2": "Στη συνέχεια, ας συνδεθούμε με τον Μάρτυ. Κάντε κλικ στο κουμπί «Επιλέξτε συσκευή» και, στη συνέχεια, επιλέξτε Marty",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2.1": "Τέλεια! Τώρα κάντε κλικ στο κουμπί 'Connect' για να συνδεθείτε με τον Marty",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-2": "Τώρα που συνδεθήκαμε με τα ρομπότ, ας ξεκινήσουμε την εγγραφή κώδικα! Για να δείτε τα μπλοκ του Cog, κάντε κλικ στο κουμπί συσκευής Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3": "Αφού επιλέξετε τα μπλοκ Cog, σύρετε το μπλοκ συμβάντων 'με το πάτημα του κουμπιού' στην περιοχή του κώδικα. Αυτό το μπλοκ θα εκτελεστεί όταν πατηθεί το κουμπί του Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3.hint": "Το μπλοκ συμβάντων \"με το πάτημα του κουμπιού\" βρίσκεται στην κατηγορία Συμβάντα. Σύρετε το στην περιοχή του κώδικα",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5": "Τώρα σύρετε το μπλοκ \"μετάδοσε μήνυμα\" από την κατηγορία Συμβάντα στην περιοχή του κώδικα. Αυτό το μπλοκ θα μεταδώσει ένα μήνυμα όταν πατηθεί το κουμπί του Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5.hint": "Το μπλοκ \"μετάδοσε μήνυμα\" βρίσκεται στην κατηγορία Συμβάντα. Σύρετε το στην περιοχή του κώδικα",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-6": "Τώρα ας περάσουμε στον Μάρτυ. Πρέπει να επιλέξουμε τον Marty για να δούμε τα μπλοκ του Marty. Κάντε κλικ στο κουμπί συσκευής Marty",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7": "Μόλις μπείτε στη λειτουργία Marty, σύρετε το μπλοκ \"Όταν λάβω μήνυμα\" από την κατηγορία Μπλοκ συμβάντων στην περιοχή του κώδικα. Αυτό το μπλοκ περιμένει να ακούσει μηνύματα που μεταδίδονται",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7.hint": "Το μπλοκ \"όταν λάβω μήνυμα\" βρίσκεται στην κατηγορία Συμβάντα. Σύρετε το στην περιοχή του κώδικα",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-9": "Είμαστε σχεδόν έτοιμοι! Σύρετε το μπλοκ \"Χόρεψε!\" στην περιοχή του κώδικα. Αυτό το μπλοκ θα κάνει τον Marty να χορέψει όταν ληφθεί το μήνυμα",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-10": "Τέλεια! Έχεις κάνει με επιτυχία τον Cog και τον Marty να αλληλεπιδρούν μεταξύ τους. Τώρα κάντε κλικ στο κουμπί του Cog για να δεις τον Marty να χορεύει!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.name": "Εισαγωγή στους ήχους και στα φώτα του Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.description": "Μάθετε πώς να προγραμματίζετε το Cog με μπλοκ, να κάνετε ήχους και φώτα που ενεργοποιούνται από την αλληλεπίδραση με το Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-1": "Ας μάθουμε πώς να προγραμματίζουμε το Cog με μπλοκ! <br /><br />Θα συνδεθούμε στο Cog και θα το κάνουμε να ανάβει και να κάνει ήχους όταν πατηθεί το κουμπί!<br /><br />Θα μάθουμε επίσης για τον κώδικα <b>σειράς</b> που εκτελείται ως ακολουθία και τον <b>παράλληλο</b> κώδικα που εκτελείται ταυτόχρονα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-2": "Αρχικά, ας συνδεθούμε στο Cog. Κάντε κλικ στο κουμπί «Επιλέξτε συσκευή» και, στη συνέχεια, επιλέξτε Cog. <br /><br /> Μπορείτε να παραλείψετε αυτό το βήμα εάν το Cog είναι ήδη συνδεδεμένο",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-3": "Τέλεια! Τώρα κάντε κλικ στο κουμπί 'Connect' για να συνδεθείτε στο Cog<br /><br>Ξανά, μπορείτε να το παραλείψετε εάν είστε ήδη συνδεδεμένοι σε ένα Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-4": "Τέλεια! Θα πρέπει τώρα να υπάρχει ενα Cog και να έχετε συνδεθεί μαζί του",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-5": "Επιλέξτε την κατηγορία Συμβάντα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6": "Προσθέστε ένα μπλοκ <b>με το πάτημα του κουμπιού</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6.hint": "Το μπλοκ συμβάντων «με το πάτημα του κουμπιού» βρίσκεται στην κατηγορία Συμβάντα. Σύρετε το στην περιοχή του κώδικα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-7": "Επιλέξτε την κατηγορία Όψεις",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8": "Προσθέστε ένα μπλοκ <b>Ρύθμισε τις λυχνίες LED [ring] σε [χρώμα]</b>, σύροντάς το για να συνδεθεί με το μπλοκ 'με το πάτημα του κουμπιού'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8.hint": "Το μπλοκ \"Ρύθμισε τις λυχνίες LED [ring] σε [χρώμα]\" ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το μπλοκ με 'το πάτημα του κουμπιού'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-9": "Δοκιμάστε το! <br /><br />Πατήστε το κουμπί του Cog και τα φώτα θα ανάψουν!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-10": "Αλλάξτε το χρώμα των λυχνιών LED κάνοντας κλικ στο χρώμα και στη συνέχεια σύροντας τη γραμμή χρώματος. <br /><br />Μπορείτε επίσης να αλλάξετε τον Κορεσμό (πόσο ζωντανό είναι ένα χρώμα) και τη Φωτεινότητα - εάν το ορίσετε στο 0, τα LED θα είναι απενεργοποιημένα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-11": "Δοκιμάστε το! <br /><br />Πατήστε το κουμπί στο Cog και τα φώτα θα αλλάξουν στο νέο χρώμα που επιλέξατε!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12": "Προσθέστε ένα μπλοκ <b>σε κίνηση</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12.hint": "Το μπλοκ συμβάντων \"σε κίνηση\" ανήκει στην κατηγορία Συμβάντα. Σύρετε το στην περιοχή του κώδικα μακριά από τον κώδικα που υπάρχει ήδη",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13": "Προσθέστε ένα μπλοκ <b>Απενεργοποιήστε όλες τις λυχνίες LED</b> κάτω από το μπλοκ σε κίνηση",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13.hint": "Το μπλοκ \"Απενεργοποιήστε όλες τις λυχνίες LED\" ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το μπλοκ 'σε κίνηση'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-14": "Δοκιμάστε το! <br /><br />Κουνήστε το Cog και τα φώτα πρέπει να σβήσουν!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-15": "Αλλάξτε το μπλοκ <b>Ρύθμισε τις λυχνίες LED [ring] σε [χρώμα]</b> για να ελέγξετε τη λυχνία LED του κουμπιού, επιλέγοντας «button» από το αναπτυσσόμενο μενού",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-16": "Δοκιμάστε το! <br /><br />Πατήστε το κουμπί στο Cog και τώρα το φως στο κουμπί πρέπει να ανάψει!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-17": "Ανακινήστε το Cog για να απενεργοποιήσετε τα LED<br /><br />Τώρα αλλάξτε το ίδιο αναπτυσσόμενο μενού για να επιλέξετε \"όλα\".",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-18": "Δοκιμάστε το! <br /><br />Πατήστε το κουμπί στο Cog και όλα τα φώτα πρέπει να ανάψουν!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19": "Προσθέστε ένα μπλοκ <b>Ρυθμίστε τις [ring] LED σε μοτίβο [Flash]</b> κάτω από το μπλοκ χρώματος 'Ρύθμισε τις λυχνίες LED [ring] σε [χρώμα]'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19.hint": "Το μπλοκ 'Ρυθμίστε τις [ring] LED σε μοτίβο [Flash]' ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το μπλοκ που ορίζει τα χρώματα LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-20": "Δοκιμάστε το! <br /><br />Πατήστε το κουμπί στο Cog και τώρα ο δακτύλιος των LED θα αρχίσει να αναβοσβήνει!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-21": "Αλλάξτε το μοτίβο σε 'Spin1' και δοκιμάστε το!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-22": "Δοκιμάστε τα άλλα μοτίβα στη λίστα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23": "Προσθέστε άλλα <b>Ρυθμίστε τις λυχνίες LED [δαχτυλιδιού] σε μοτίβο [Flash]</b> κάτω από το προηγούμενο και αλλάξτε το έτσι ώστε το κουμπί να αναβοσβήνει.<br /><br />Δοκιμάστε το πατώντας το κουμπί στο Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23.hint": "Το μπλοκ 'Ρυθμίστε [δακτυλίου] LED σε μοτίβο [Flash]' ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το μπλοκ που ορίζει τα χρώματα LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-24": "Διαγράψτε τον κωδικό κάτω από το μπλοκ 'με το πάτημα του κουμπιού' σύροντάς τον πίσω στην παλέτα με τα μπλοκ",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25": "Προσθέστε ένα μπλοκ <b>Ρυθμίστε τις λυχνίες LED χρησιμοποιώντας το ColorPicker</b> κάτω απο το μπλοκ με 'το πάτημα του κουμπιού'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25.hint": "Το μπλοκ «Ρυθμίστε τις λυχνίες LED χρησιμοποιώντας το ColorPicker» βρίσκεται στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το μπλοκ 'με το πάτημα του κουμπιού'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-26": "Αλλάξτε τα μεμονωμένα χρώματα LED χρησιμοποιώντας το ColorPicker».<br /><br />Πρώτα επιλέξτε ένα χρώμα χρησιμοποιώντας τον τροχό χρώματος και τα ρυθμιστικά κορεσμού και φωτεινότητας και, στη συνέχεια, επιλέξτε τα LED που θέλετε να ορίσετε σε αυτό το χρώμα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27": "Ρυθμίστε επίσης το χρώμα του κουμπιού προσθέτοντας ένα μπλοκ <b>Ορίστε τα LED [δαχτυλιδιού] στο [χρώμα]</b> και αλλάζοντας το για να ορίσετε το κουμπί στο αγαπημένο σας χρώμα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27.hint": "Το μπλοκ \"Ρυθμίστε [δακτυλίου] LED σε [χρώμα]\" ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το με τα LED Set χρησιμοποιώντας το μπλοκ ColorPicker",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-28": "Δοκιμάστε το! Πατήστε το κουμπί και τα φώτα θα αλλάξουν το καθένα στα χρώματα που επιλέξατε",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-29": "Επιλέξτε την κατηγορία Έλεγχος",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30": "Προσθέστε ένα μπλοκ <b>αναμονής [1] δευτερόλεπτα</b> κάτω από τα μπλοκ LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30.hint": "Το μπλοκ «αναμονή [1] δευτερόλεπτα» ανήκει στην κατηγορία Έλεγχος. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το κάτω από τα δύο μπλοκ που ορίζουν τα χρώματα LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31": "Προσθέστε άλλα <b>Ορίστε LED χρησιμοποιώντας το μπλοκ ColorPicker</b> κάτω από το μπλοκ αναμονής και, στη συνέχεια, αλλάξτε τα χρώματα σε ό,τι επιλέξετε",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31.hint": "Το μπλοκ «Ρυθμίστε τις λυχνίες LED χρησιμοποιώντας το ColorPicker» βρίσκεται στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το στο μπλοκ αναμονής που μόλις προσθέσατε και, στη συνέχεια, αλλάξτε τα χρώματα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32": "Αλλάξτε επίσης το χρώμα του κουμπιού προσθέτοντας ένα μπλοκ <b>Ρύθμισε τις λυχνίες LED [ring] σε [χρώμα]</b> και αλλάζοντας το για να ορίσετε το κουμπί στο αγαπημένο σας χρώμα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32.hint": "Το μπλοκ \"Ρυθμίστε [δακτυλίου] LED σε [χρώμα]\" ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το με τα τελευταία LED Set χρησιμοποιώντας το μπλοκ ColorPicker και, στη συνέχεια, επιλέξτε «κουμπί» από το αναπτυσσόμενο μενού",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-33": "Δοκιμάστε το! Πατήστε το κουμπί και τα φώτα θα ανάψουν και μετά θα αλλάξουν μετά από 1 δευτερόλεπτο!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34": "Προσθέστε ένα άλλο μπλοκ <b>με το πάτημα του κουμπιού</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34.hint": "Το μπλοκ συμβάντων «πάτημα κουμπιού» βρίσκεται στην κατηγορία Συμβάν. Σύρετε το στην περιοχή του κώδικα για να ξεκινήσετε την κωδικοποίηση",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-35": "Επιλέξτε την κατηγορία Ήχος",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36": "Προσθέστε ένα μπλοκ <b>Αναπαραγωγή σημείωσης [C4] για [1] δευτερόλεπτα</b> κάτω από το μπλοκ με το πάτημα του κουμπιού που μόλις προσθέσατε",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36.hint": "Το μπλοκ «Αναπαραγωγή σημείωσης [C4] για [1] δευτερόλεπτα» ανήκει στην κατηγορία Ήχος. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το στο νέο μπλοκ με το πάτημα του κουμπιού που προσθέσατε στο τελευταίο βήμα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-37": "Αλλάξτε τη σημείωση σε C5 και δοκιμάστε την πατώντας το κουμπί στο Cog!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38": "Προσθέστε έναν τόνο <b>Αναπαραγωγή από [200] έως [300] Hz για [3] δευτερόλεπτα</b> μεταξύ του μπλοκ On Button Push και του Play Note",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38.hint": "Το μπλοκ «Ήχος αναπαραγωγής από [200] έως [300] Hz για [3] δευτερόλεπτα» ανήκει στην κατηγορία Ήχος. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το μεταξύ του μπλοκ με το πάτημα του κουμπιού και της σημείωσης αναπαραγωγής που προσθέσατε στο τελευταίο βήμα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-39": "Αλλάξτε τους αριθμούς στο μπλοκ Play Tone για να μεταβείτε από τα 260 στα 523 Hz για 1 δευτερόλεπτο.<br /><br />Κάθε μουσική νότα έχει μια συχνότητα και τα 523 Hz είναι η συχνότητα C5 - C στην πέμπτη οκτάβα.<br /><br />Δοκιμάστε το πατώντας το κουμπί στο Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-40": "Όταν πατάτε το κουμπί, οι ήχοι και τα φώτα εμφανίζονται ταυτόχρονα - λέμε ότι τρέχουν <b>παράλληλα</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-41": "Οι μεμονωμένοι ήχοι και τα φώτα συμβαίνουν ο ένας μετά τον άλλο - λέμε ότι εκτελούνται σε <b>σειρά</b> ή σε μια σειρά",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-42": "Μεγάλη δουλειά! Έχετε μάθει πώς να προγραμματίζετε το Cog, να το κάνετε να ανταποκρίνεται στα πατήματα και τα κουνήματα των κουμπιών και να κάνει ήχους και φώτα!».",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.name": "Φτιάξτε ένα ζάρι 13 όψεων!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.description": "Θα μετατρέψουμε το Cog σε ζάρι, δείχνοντας διαφορετικό αριθμό φώτων κάθε φορά που το κουνάτε!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-1": "Ας προγραμματίσουμε το Cog να είναι κάτι χρήσιμο - ένα ζάρι!<br /><br />Θα κάνουμε το γρανάζι να αντιδρά στο κούνημα δείχνοντας έναν τυχαίο αριθμό φώτων και κάνοντας τον ίδιο αριθμό μπιπ<br /><br />Για να το κάνουμε αυτό, θα μάθουμε για τις <b>Μεταβλητές</b> - ειδικά μπλοκ που μπορούν να <i>αλλάξουν την τιμή, την τιμή</i> και την τιμή <b> μια απόφαση!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-2": "Πρώτα, βεβαιωθείτε ότι είστε συνδεδεμένοι σε ένα γρανάζι.<br /><br />Εάν όχι, προσθέστε ένα όπως κάνατε στον προηγούμενο σεμινάριο πατώντας το κουμπί Προσθήκη στον πίνακα συσκευών και επιλέγοντας ένα γρανάζι και, στη συνέχεια, κάνοντας κλικ στη σύνδεση. Εάν χρειάζεται, επιστρέψτε στον τελευταίο οδηγό για να δείτε πώς",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-3": "Προσθέστε ένα μπλοκ συμβάντων <b>σε κίνηση</b> από την κατηγορία <b>Εκδηλώσεις</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-4": "Επιλέξτε την κατηγορία <b>Μεταβλητές</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-5": "Κάντε κλικ στο κουμπί <b>Δημιουργία μεταβλητής</b><br /><br />Ορίστε το όνομα της νέας μεταβλητής σε <b>ledID</b> και πατήστε OK",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-6": "Επιλέξτε την κατηγορία <b>Έλεγχος</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7": "Προσθέστε ένα μπλοκ <b>επανάληψης</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7.hint": "Το μπλοκ \"επανάληψη\" βρίσκεται στην κατηγορία Έλεγχος. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το στο μπλοκ σε κίνηση",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8": "Μεταβείτε στην κατηγορία <b>Όψεις</b> και προσθέστε ένα μπλοκ <b>Ρύθμιση LED [1] σε [χρώμα]</b> μέσα στο μπλοκ επανάληψης<br /><br />Αλλάξτε το χρώμα στο αγαπημένο σας χρώμα :-)",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8.hint": "Το μπλοκ «ορισμός LED [1] σε [χρώμα]» ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα και τοποθετήστε το έτσι ώστε να ασφαλίσει μέσα στο μπλοκ επανάληψης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-9": "Δοκιμάστε το! <br /><br />Τι θα συμβεί αν κουνήσετε το γρανάζι;",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10": "Επιστρέψτε στην κατηγορία <b>Μεταβλητές</b> και προσθέστε ένα μπλοκ <b>Αλλαγή [ledID] κατά [1]</b> αμέσως μετά το μπλοκ LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10.hint": "Το μπλοκ 'Change [ledID] by [1]' ανήκει στην κατηγορία Variables. Σύρετε το στην περιοχή του κώδικα και τοποθετήστε το έτσι ώστε να κουμπώσει μέσα στο μπλοκ επανάληψης, ακριβώς μετά το μπλοκ Set LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-11": "Σύρετε τη μεταβλητή <b>ledID</b> στο μπλοκ <b>Ορισμός LED</b>, ώστε να διαβάζει <b>Ορισμός LED <i>ledID</i> σε [χρώμα]</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-12": "Δοκιμάστε το!<br /><br />Τι θα συμβεί αν τινάξετε το Cog;",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-13": "Δοκιμάστε το ξανά - θα ανάψουν περισσότερες λυχνίες LED!<br /><br />Αλλά αν ανακινήσετε το Cog <i>ξανά</i> μετά από αυτό, δεν θα συμβεί τίποτα νέο. Ας το αλλάξουμε!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14": "Προσθέστε ένα μπλοκ <b>Ορίστε το [ledID] σε [0]</b> αμέσως μετά το μπλοκ <b>σε κίνηση</b>, πριν από το μπλοκ επανάληψης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14.hint": "Το μπλοκ 'Set [ledID] to [0]' ανήκει στην κατηγορία Variables. Σύρετε το στην περιοχή του κώδικα και τοποθετήστε το έτσι ώστε να κουμπώνει ακριβώς μετά το μπλοκ \"σε κίνηση\", πριν από το μπλοκ επανάληψης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15": "Προσθέστε επίσης ένα μπλοκ <b>Απενεργοποίηση όλων των LED</b> από την κατηγορία <b>Όψεις</b><br /><br />Προσθέστε το ακριβώς πριν από το μπλοκ επανάληψης, αφού το μπλοκ <i>ορίστε το [ledID] σε [0]</i> που μόλις προσθέσατε",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15.hint": "Το μπλοκ \"Απενεργοποίηση όλων των LED\" ανήκει στην κατηγορία \"Όψεις\".<br /><Br />Βεβαιωθείτε ότι το έχετε προσθέσει μεταξύ του μπλοκ \"ορισμός [ledID] σε [0]\" και του μπλοκ \"επανάληψη\"",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-16": "Τώρα δοκιμάστε το ξανά! <br /><br />Τώρα, όταν κουνάτε το γρανάζι, θα επαναφέρει και τα φώτα και την <i>τιμή</i> της <b>μεταβλητής</b> <i>ledID</i>, έτσι ώστε να μετράει από το 1 έως το 10",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-17": "Μεταβείτε στην κατηγορία <b>Χειριστές</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-18": "Σύρετε το μπλοκ <b>επιλογή τυχαίας [1] σε [10]</b> για να αντικαταστήσετε τον αριθμό στο μπλοκ επανάληψης<br /><br />Τώρα, το μπλοκ επανάληψης θα κάνει βρόχο τυχαίο αριθμό φορών από 1 έως 10, αλλάζει κάθε φορά!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-19": "Το Cog διαθέτει 13 προγραμματιζόμενα LED - 12 στο δαχτυλίδι και ένα στο κουμπί<br /><br />Αλλάξτε το μπλοκ <b>επιλογή τυχαίας</b> για να επιλέξετε έναν αριθμό μεταξύ 1 και <b>13</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-20": "Δοκιμάστε το! <br /><br />Τώρα κάθε φορά που κουνάτε το Cog θα λαμβάνετε διαφορετικό αριθμό φώτων<br /><Br />Έχετε προγραμματίσει το Cog να είναι ζάρι!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-21": "Η <i>ledID</i> είναι μια <b>μεταβλητή</b> - έχει μια τιμή που μπορεί να αλλάξει ή να <i>μεταβλητή</i><br /><br />Σε αυτόν τον κώδικα μετράει μέχρι να ανάψει μια διαφορετική λυχνία LED κάθε φορά μέσω του βρόχου!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22": "Ας προσθέσουμε και κάποια ηχητικά σχόλια.<br /><Br />Μεταβείτε στην κατηγορία <b>Ήχοι</b> και προσθέστε ένα μπλοκ <b>Αναπαραγωγή σημείωσης [C4] για [1] δευτερόλεπτα</b><br /><br />Αλλάξτε το για αναπαραγωγή της νότας για <b>0,1 δευτερόλεπτα</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22.hint": "Το μπλοκ \"Αναπαραγωγή σημείωσης [C4] για [1] δευτερόλεπτα\" ανήκει στην κατηγορία Ήχοι.<br /><Br />Βεβαιωθείτε ότι το έχετε προσθέσει στον βρόχο Επανάληψης!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23": "Προσθέστε επίσης μια σύντομη παύση προσθέτοντας ένα μπλοκ <b>Περιμένετε [1] δευτερόλεπτα</b> από την κατηγορία <b>Έλεγχος</b><br /><br />Αλλάξτε τη διάρκεια της παύσης σε <b>0,1 δευτερόλεπτα</b> επίσης<br /><br />Εάν δεν προσθέσουμε μια παύση, τότε δεν θα μπορούμε να πούμε πόσα είναι όλα, όσο είναι τα μπιπ!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23.hint": "Το μπλοκ «Αναμονή [1] δευτερόλεπτα» ανήκει στην κατηγορία Έλεγχος. Προσθέστε το στον κώδικα σύροντάς το μέσα στον βρόχο επανάληψης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-24": "Δοκιμάστε το!<br /><Br />Τώρα θα ακούσετε επίσης έναν αριθμό μπιπ που ταιριάζει με τον αριθμό των φώτων!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25": "Ας κάνουμε κάτι ξεχωριστό <b>αν</b> κερδίσετε την πρώτη βαθμολογία - 13<br /><br />Μεταβείτε στην κατηγορία <b>Control</b> και προσθέστε ένα μπλοκ <b>If __ then</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25.hint": "Το μπλοκ \"αν __ τότε\" βρίσκεται στην κατηγορία Έλεγχος. Προσθέστε τον στον κώδικα σύροντάς τον έτσι ώστε να συνδεθεί μετά τον βρόχο επανάληψης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-26": "Μεταβείτε στην κατηγορία <b>Χειριστές</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27": "Σύρετε το μπλοκ <b>=</b> <b>στο μπλοκ <i>if</i></b><br /><br />Εδώ θα ορίσουμε την <b>συνθήκη</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27.hint": "Το μπλοκ '=' ανήκει στην κατηγορία Χειριστές. Σύρετε το στο αντίστοιχο σχήμα στο μπλοκ if",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-28": "Επιστρέψτε στην κατηγορία <b>Μεταβλητές</b> και σύρετε τη μεταβλητή <b>ledID</b> στο <b>πρώτο πλαίσιο του μπλοκ ίσων</b><br /><br />Στη συνέχεια <b>ορίστε το δεύτερο πλαίσιο σε 13</b>, έτσι ώστε ολόκληρη η γραμμή να διαβάζει <b>αν ledID = 13 τότε</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-29": "Ο κώδικας μέσα σε αυτό το μπλοκ <b>if</b> θα εκτελεστεί μόνο <b>αν</b> η <b>μεταβλητή</b> ledID είναι <b>ίση</b> με 13<br /><br />Θα το ελέγξει αφού ολοκληρωθεί η επανάληψη του μπλοκ <b>repeat</b>, καθώς ο κώδικας συνεχίζει με τη σειρά<br /><br /> οτιδήποτε άλλο <br /><br /> 13 τότε ολόκληρο το μπλοκ <b>if</b> και οποιοσδήποτε κωδικός σε αυτό θα παραλειφθεί<br /><br />Το μπλοκ <b>if</b> είναι ένας τύπος <b>υπό όρους</b> - ο κωδικός μέσα σε αυτό θα εκτελεστεί μόνο εάν η <b>συνθήκη</b> που έχετε ορίσει είναι αληθής",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30": "Ας προσθέσουμε κάτι μέσα στο μπλοκ <b>if</b>!<br /><br />Μεταβείτε στην κατηγορία <b>ήχοι</b> και προσθέστε ένα μπλοκ <b>Play tune</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30.hint": "Το μπλοκ \"Play tune\" ανήκει στην κατηγορία Ήχοι. Προσθέστε το στον κώδικα σύροντάς τον ώστε να συνδεθεί μέσα στην συνθήκη if",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-31": "Αλλάξτε τη μελωδία σε <b>σφύριγμα</b> από το αναπτυσσόμενο μενού",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32": "Προσθέστε επίσης κάποια εφέ φωτισμού από το μενού Όψειςς<br /><br />Για παράδειγμα, μπορούμε να κάνουμε τα LED του δακτυλίου και των κουμπιών να δείχνουν ένα μοτίβο",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32.hint": "Το μπλοκ «Ρύθμιση [δαχτυλιδιού] LED σε μοτίβο [Flash]» ανήκει στην κατηγορία Όψεις. Προσθέστε δύο από αυτά μέσα στη συνθήκη if και αλλάξτε ένα για να ορίσετε το μοτίβο του κουμπιού",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-33": "Δοκιμάστε το!<br /><br />Δείτε αν μπορείτε να ρίξετε ένα 13 στα ζάρια κουνώντας το Cog!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-42": "Μπράβο!<br /><br />Έχετε μάθει ότι μια <b>μεταβλητή</b> είναι κάτι που μπορεί να αλλάξει στην <b>τιμή</b>. Μπορούμε να τα χρησιμοποιήσουμε για να κάνουμε τον κώδικά μας να κάνει διαφορετικά πράγματα χωρίς να χρειάζεται να αλλάξουμε τον κωδικό<br /><br />Μάθαμε για τα μπλοκ <b>if</b> - αυτά μπορούν να χρησιμοποιηθούν για την εκτέλεση κώδικα μόνο εάν πληρούται μια συγκεκριμένη <b>συνθήκη</b><br /><br />Και μάθαμε πώς να χρησιμοποιούμε έναν επαναλαμβανόμενο <b>βρόχο</b> για να κάνουμε κάτι πολλές φορές - σε αυτήν την περίπτωση ανάβει διαφορετική λυχνία LED",
  "gui.spriteSelector.sprites": "SPRITES",
  "gui.deviceSelector.devices": "ΣΥΣΚΕΥΕΣ",
  "gui.spriteSelector.addSpriteFromLibrary": "Επιλέξτε ένα Sprite",
  "gui.spriteSelector.addSpriteFromPaint": "Χρώμα",
  "gui.spriteSelector.addSpriteFromSurprise": "Εκπληξη",
  "gui.spriteSelector.addSpriteFromFile": "Ανεβάστε το Sprite",
  "gui.deviceSelector.addDeviceByConnecting": "Σύνδεση σε Συσκευή",
  "gui.deviceSelector.addDeviceFromLibrary": "Επιλέξτε Συσκευή",
  "gui.spriteSelector.noSpritesInUse": "Δεν χρησιμοποιούνται sprites",
  "gui.deviceSelector.noDevicesInUse": "Προσθήκη συσκευής",
  "gui.saveLoad.localStorageTitle": "Στην εφαρμογή",
  "gui.saveLoad.localStorageSubtitle": "Τοπική αποθήκευση",
  "gui.saveLoad.cloudStorageTitle": "Στο Σύννεφο",
  "gui.saveLoad.cloudStorageSubtitle": "Αποθήκευση στο Σύννεφο",
  "gui.saveLoad.portableFileStorageTitle": "Φορητός",
  "gui.saveLoad.portableFileStorageSubtitle": "Αποθήκευση αρχείων",
  "gui.saveLoad.createNewSaveFile": "Δημιουργήστε ένα νέο αρχείο αποθήκευσης:",
  "gui.saveLoad.savedFilesTitle": "Τα αποθηκευμένα αρχεία σας:",
  "gui.saveLoad.deleteFile": "Διαγραφή",
  "gui.saveLoad.loadFile": "Φόρτωση",
  "gui.saveLoad.saveFile": "Αποθήκευση",
  "gui.saveLoad.saveFileNamePlaceholder": "Πληκτρολογήστε αυτό που θέλετε να ονομάσετε το νέο σας αρχείο αποθήκευσης εδώ...",
  "gui.saveLoad.fileLoadError": "Η φόρτωση του έργου απέτυχε.",
  "gui.saveLoad.fileSaveError": "Αποτυχία αποθήκευσης έργου.",
  "gui.saveLoad.overwriteFile": "Είστε βέβαιοι ότι θέλετε να αντικαταστήσετε αυτό το αρχείο;",
  "gui.saveLoad.copyToClipboard": "Αντιγραφή στο Πρόχειρο",
  "gui.saveLoad.copied": "Αντιγράφηκε!",
  "gui.saveLoad.saveProject": "Αποθήκευση έργου",
  "gui.saveLoad.projectSaved": "Το έργο αποθηκεύτηκε με επιτυχία!",
  "gui.saveLoad.projectSaveFailed": "Αποτυχία αποθήκευσης έργου",
  "gui.saveLoad.projectLoaded": "Το έργο φορτώθηκε με επιτυχία!",
  "gui.saveLoad.projectLoadFailed": "Η φόρτωση του έργου απέτυχε",
  "gui.saveLoad.loadProjectPlaceholder": "Πληκτρολογήστε το όνομα του αρχείου αποθήκευσης cloud που θέλετε να φορτώσετε εδώ...",
  "gui.saveLoad.createNewCloudSave": "Δημιουργήστε ένα νέο αρχείο αποθήκευσης cloud:",
  "gui.saveLoad.saveFileCode": "Ο κωδικός αρχείου αποθήκευσης που δημιουργείται αυτόματα είναι:",
  "gui.saveLoad.saveFilePlaceholder": "Ο κωδικός αρχείου αποθήκευσης που δημιουργείται αυτόματα είναι:",
  "gui.saveLoad.loadProjectTitle": "Φόρτωση έργου",
  "gui.saveLoad.tipsTitle": "Συμβουλές για την αποθήκευση στο cloud:",
  "gui.saveLoad.tips1": "Φροντίστε να σημειώσετε ή να καταγράψετε τον κώδικα που δημιουργείται αυτόματα που παρέχεται κάθε φορά που αποθηκεύετε ένα νέο αρχείο. Θα χρειαστείτε αυτό για να το φορτώσετε στο μέλλον.",
  "gui.saveLoad.tips2": "Αν και η εφαρμογή Marty the Robot θα συνεχίσει να αποθηκεύει αυτόματα αρχεία στον τοπικό χώρο αποθήκευσης, δεν υπάρχει λειτουργία αυτόματης αποθήκευσης για αρχεία αποθήκευσης cloud. Αποθηκεύστε ξανά με μη αυτόματο τρόπο το αρχείο σας κάθε φορά, εάν θέλετε να είναι διαθέσιμο για λήψη μέσω αποθήκευσης cloud.",
  "gui.saveLoad.tips3": "Κάθε φορά που αποθηκεύετε ξανά ένα αρχείο στο χώρο αποθήκευσης cloud, θα σας παρέχεται ένας ΝΕΟΣ ΚΩΔΙΚΟΣ ΑΠΟΘΗΚΕΥΣΗΣ ΑΡΧΕΙΟΥ. Παρακαλώ σημειώστε αυτό.",
  "gui.saveLoad.saveToFile": "Αποθήκευση στο Αρχείο",
  "gui.saveLoad.loadFromFile": "Φόρτωση από το αρχείο",
  "gui.saveLoad.fileSaved": "Το αρχείο αποθηκεύτηκε!",
  "gui.martyMachineModelEditor.model": "Όνομα μοντέλου",
  "gui.martyMachineModelEditor.className": "Συλλέξτε δεδομένα για",
  "gui.martyMachineModelEditor.createNewClass": "Δημιουργία τάξης",
  "gui.martyMachineModelEditor.samples": "Δείγματα",
  "gui.MartyMachineModelEditor.record": "Καταγραφή Δεδομένων",
  "gui.MartyMachineModelEditor.stop": "Στάση",
  "gui.MartyMachineModelEditor.train": "Τρένο",
  "gui.MartyMachineModelEditor.run": "Τρέξιμο",
  "gui.MartyMachineModelEditor.save": "Εκτός",
  "gui.MartyMachineModelEditor.saving": "Οικονομία...",
  "gui.martyMachineTab.addNew": "Προσθήκη νέου μοντέλου",
  "gui.martyMachineTab.newImageModelMarty": "Νέο μοντέλο εικόνας (Marty)",
  "gui.martyMachineTab.newImageModelDevice": "Νέο μοντέλο εικόνας (συσκευή)",
  "gui.martyMachineTab.newAccelerometerModel": "Νέο μοντέλο επιταχυνσιόμετρου",
  "gui.martyMachineTab.newAudioModel": "Νέο μοντέλο ήχου",
  "gui.martyMachineTab.loadTMModel": "Φόρτωση μοντέλου TM",
  "gui.martyMachineTab.tutorials": "Φροντιστήρια",
  "gui.martyMachineTab.alertSelectDevice": "Ωχ! Επιλέξτε μια συσκευή Marty ή Cog για να χρησιμοποιήσετε το μοντέλο επιταχυνσιόμετρου.",
  "gui.martyMachineTab.alertConnectDevice": "Ωχ! Συνδέστε τη συσκευή για να χρησιμοποιήσετε το μοντέλο επιταχυνσιόμετρου.",
  "gui.martyMachineTab.alertModelNameExists": "Το όνομα μοντέλου υπάρχει ήδη, επιλέξτε άλλο όνομα.",
  "martyMachine.modelNameExists": "Ωχ! Το όνομα μοντέλου υπάρχει ήδη, επιλέξτε διαφορετικό όνομα.",
  "martyMachine.backgroundNoiseClassNeedsSamples": "Ωχ! Η κατηγορία θορύβου περιβάλλοντος χρειάζεται τουλάχιστον 10 δείγματα για εκπαίδευση. Προσθέστε περισσότερα δείγματα στην κατηγορία θορύβου φόντου.",
  "martyMachine.classNameExists": "Ωχ! Το όνομα της τάξης υπάρχει ήδη, επιλέξτε διαφορετικό όνομα.",
  "martyMachine.selectClassAlert": "Προσθέστε ή επιλέξτε μια υπάρχουσα τάξη πριν από την εγγραφή δειγμάτων.",
  "gui.MartyMachineNewModelConfirmationModal.label": "Οι μη αποθηκευμένες αλλαγές θα χαθούν.",
  "gui.MartyMachineNewModelConfirmationModal.headsUp": "Απλά ένα heads-up! Εάν έχετε κάνει αλλαγές στο τρέχον μοντέλο, δεν θα αποθηκευτούν. Είσαι καλά για να συνεχίσεις;",
  "gui.MartyMachineNewModelConfirmationModal.close": "Κοντά",
  "gui.MartyMachineNewModelConfirmationModal.continue": "Συνεχίζω",
  "gui.TfVisChart.loadingTitle": "Φόρτωση Οικόπεδο απώλειας",
  "gui.TfVisChart.loadingSubtitle": "Αυτό μπορεί να διαρκέσει λίγο, περιμένετε...",
  "gui.MartyMachineModelEditor.requiresAtLeast10Samples": "Απαιτεί τουλάχιστον 10 δείγματα",
  "gui.MartyMachineModelEditor.createNewClass": "Δημιουργία νέας τάξης",
  "gui.howtos.marty-machine-create-model.name": "Δημιουργία μοντέλου AI",
  "gui.howtos.marty-machine-create-model.step_create-model": "Δημιουργία νέου μοντέλου",
  "gui.howtos.marty-machine-create-audio-model.step_visit-user-guide": "Επισκεφθείτε τον Οδηγό χρήσης μας για περισσότερες πληροφορίες",
  "gui.howtos.marty-machine-create-image-model.name": "Δημιουργία μοντέλου εικόνας",
  "gui.howtos.marty-machine-create-image-model.step_create-image-model": "Δημιουργία νέου μοντέλου εικόνας",
  "gui.howtos.marty-machine-create-image-model.step_change-model-name": "Αλλαγή ονόματος μοντέλου",
  "gui.howtos.marty-machine-create-image-model.step_collect-data": "Συλλέξτε Δεδομένα",
  "gui.howtos.marty-machine-create-image-model.step_train-model": "Μοντέλο τρένου",
  "gui.howtos.marty-machine-create-image-model.step_run-model": "Εκτέλεση μοντέλου",
  "gui.howtos.marty-machine-create-image-model.step_save-model": "Αποθήκευση μοντέλου",
  "gui.howtos.marty-machine-create-audio-model.name": "Δημιουργία μοντέλου ήχου",
  "gui.howtos.marty-machine-create-audio-model.step_create-audio-model": "Δημιουργία νέου μοντέλου ήχου",
  "gui.howtos.marty-machine-create-audio-model.step_change-model-name": "Αλλαγή ονόματος μοντέλου",
  "gui.howtos.marty-machine-create-audio-model.step_collect-data": "Συλλέξτε Δεδομένα",
  "gui.howtos.marty-machine-create-audio-model.step_train-model": "Μοντέλο τρένου",
  "gui.howtos.marty-machine-create-audio-model.step_run-model": "Εκτέλεση μοντέλου",
  "gui.howtos.marty-machine-create-audio-model.step_save-model": "Αποθήκευση μοντέλου",
  "gui.howtos.marty-machine-load-tm-model.name": "Φόρτωση μοντέλου μηχανής με δυνατότητα διδασκαλίας",
  "gui.howtos.marty-machine-load-tm-model.step_load-tm-model": "Φόρτωση μοντέλου μηχανής με δυνατότητα διδασκαλίας",
  "gui.howtos.marty-machine-load-and-run-image-model.name": "Φόρτωση και εκτέλεση μοντέλου εικόνας",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-and-run-image-model": "Φέρτε τα μπλοκ AI",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-model": "Μοντέλο φόρτωσης",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classification-on": "Ενεργοποιήστε την ταξινόμηση",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classify-image": "Ταξινόμηση εικόνας",
  "gui.howtos.marty-machine-load-and-run-audio-model.name": "Φόρτωση και εκτέλεση μοντέλου ήχου",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-and-run-audio-model": "Φέρτε τα μπλοκ AI",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-model": "Μοντέλο φόρτωσης",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classification-on": "Ενεργοποιήστε την ταξινόμηση",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classify-audio": "Ταξινόμηση ήχου"
}