{
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.description": "Πρόοδος από το BlocksJr στο MartyBlocks!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-1": "Καλώς ορίσατε στο MartyBlocks! <br /><br /> Ας ανακεφαλαιώσουμε όσα γνωρίζουμε από το MartyBlocks Jr για να συνηθίσουμε αυτή τη νέα ρύθμιση.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-2": "Μπορούμε να βρούμε το \"κουμπί έναρξης\" στα Συμβάντα. <br /><br /> Σύρετε το στην περιοχή σεναρίων για να ξεκινήσετε τον προγραμματισμό",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-4": "Μπορείτε να αναδημιουργήσετε αυτήν την ακολουθία του MartyBlocks Jr στο MartyBlocks; <br /><br /> Έχουμε ήδη την πράσινη σημαία και ετοιμαστείτε μπλοκ, ας κάνουμε τα υπόλοιπα!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-5": "Μπορείτε να βρείτε το μπλοκ \"περπάτημα προς τα εμπρός\" στην ενότητα \"Κίνηση\". <br /><br /> Προσθέστε το μπλοκ μετά το \"Ετοιμαστείτε!\" και αλλάξτε τον αριθμό των βημάτων που κάνει ο Marty στον κενό χώρο. Πληκτρολογήστε \"4\" για να ταιριάζει με τον κώδικα BlocksJr.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-6": "Μπορείτε να βρείτε το μπλοκ διαφάνειας και στην Κίνηση. <br /><br /> Προσθέστε το μπλοκ μετά το \"Περπατήστε 4 βήματα μπροστά\", ορίστε το αναπτυσσόμενο πλαίσιο σε \"δεξιά\" και πληκτρολογήστε \"3\" ώστε να ταιριάζει με τον κώδικα BlocksJr.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-7": "Χρησιμοποιήστε το ίδιο μπλοκ για να κάνετε τον Marty να σύρει αριστερά. <br /><br /> Προσθέστε το μπλοκ μετά το \"Σύρσιμο 3 φορές δεξιά\", ορίστε το αναπτυσσόμενο πλαίσιο σε \"αριστερά\" και πληκτρολογήστε \"2\" ώστε να ταιριάζει με τον κώδικα BlocksJr.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-8": "Τέλος, θα προσθέσουμε το μπλοκ \"walk backwards\". <br /><br /> Προσθέστε το μπλοκ μετά το \"Slide 2 times left\" και πληκτρολογήστε \"1\" για να ταιριάζει με τον κώδικα BlocksJr.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-9": "<b/>Τα κατάφερες! Μετάβαση από το BlocksJr στο MartyBlocks με επιτυχία.</b> <br /><br /> Τώρα είσαι έτοιμος να εξερευνήσεις το MartyBlocks και να κάνεις τόσα πολλά ωραία πράγματα με τον Marty!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-2": "Διάλεξε ένα sprite για να δουλέψεις - μπορείς να επιλέξεις ένα sprite από τη βιβλιοθήκη ή να πάρεις ένα sprite έκπληξη!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-4": "Ας χρησιμοποιήσουμε τον βρόχο «forever» έτσι ώστε το sprite να συνεχίζει να ακολουθεί μέχρι να του πούμε να σταματήσει με το κόκκινο κουμπί διακοπής.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-5": "Στην Κίνηση, επιλέξτε το σημείο προς το μπλοκ του δείκτη του ποντικιού. <br /><br /> Προσθέστε το ως το πρώτο μας μπλοκ στον βρόχο forever.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-6": "Επίσης, στην Κίνηση, επιλέξτε το μπλοκ περπατήματος 10 βημάτων. <br /><br /> Ας το προσθέσουμε αυτό κάτω από το μπλοκ σημείου προς τα εμπρός και ας αλλάξουμε τον αριθμό των βημάτων σε 5.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-7": "Μπορείτε επίσης να αλλάξετε το φόντο στο οποίο βρίσκεται το sprite σας. <br /><br />Αυτά μπορούν να μας βοηθήσουν να κάνουμε ακόμη περισσότερα πράγματα με τα sprites. <br /><br /> Επιλέξτε δέκα διαφορετικά φόντα (θα ξέρετε ότι το έχετε κάνει αυτό όταν λέει backdrops: 10)",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-8": "Ας βοηθήσουμε το sprite μας να εναλλάσσεται μεταξύ αυτών των φόντων για εξερεύνηση! <br /><br />Επιλέξτε ένα μπλοκ εναλλαγής φόντου και χρησιμοποιήστε το αναπτυσσόμενο μενού για να επιλέξετε \"τυχαίο φόντο\".<br /><br />Τοποθετήστε το ανάμεσα στο μπλοκ \"όταν γίνει κλικ στην πράσινη σημαία\" και τον βρόχο forever, όπως φαίνεται στο δείγμα κώδικα εδώ:",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-9": "Τα κατάφερες! <br /><br /> <b/>Τώρα κάθε φορά που κάνουμε κλικ στην πράσινη σημαία, μπορούμε να εξερευνήσουμε ένα νέο φόντο με το sprite μας! </b><br/><br /> Μπορείτε να χρησιμοποιήσετε το κουμπί με τα τέσσερα βέλη για να παρακολουθήσετε το sprite σας σε πλήρη οθόνη!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.description": "Ας εξερευνήσουμε τα Γεγονότα και τα Σπράιτ, και πώς μπορούν να ελέγξουν τις κινήσεις του Μάρτι!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-1": "Τώρα που ξέρουμε πώς να ελέγχουμε ένα Sprite, ας χρησιμοποιήσουμε ένα Sprite, ένα φόντο και μερικά μπλοκ Event για να ελέγξουμε τον Marty στην Αρκτική!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-2": "Πρώτα απ' όλα, ας ανοίξουμε το μενού του sprite για να επιλέξουμε το sprite της Αρκτικής μας. <br /><br /><b/>Αναζητήστε \"polar-bear\"</b> και επιλέξτε το sprite για να το τοποθετήσετε στο φόντο.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-3": "Τέλεια! Τώρα ας βεβαιωθούμε ότι η πολική αρκούδα μας νιώθει σαν στο σπίτι της. <br /><br />Ανοίξτε το μενού Φόντα και, στη συνέχεια, επιλέξτε το αρκτικό φόντο για να δώσετε στην πολική αρκούδα μας ένα σπίτι!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-4": "Κάντε κλικ στην πολική αρκούδα στο μενού του sprite για να εμφανιστεί ο κώδικά της.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-5": "Στη συνέχεια, μεταβείτε στα συμβάντα. <br /><br />Αυτά τα μπλοκ λένε <b/>\"όταν συμβεί αυτό, κάνε εκείνο\"</b>. Μπορούν να μας βοηθήσουν να διασφαλίσουμε ότι ο κώδικάς μας εκτελείται μόνο όταν το θέλουμε.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-7": "Θέλουμε να γράψουμε κώδικα που να λέει: <br /> <br /> <i> Όταν κάνει κλικ σε αυτό το sprite, αλλάζει το φόντο σε αρκτικό. <br /> Όταν κάνει κλικ στην πράσινη σημαία, αλλάζει το φόντο πίσω στο προεπιλεγμένο.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-8": "Ας πάρουμε δύο μπλοκ \"εναλλαγής φόντου\" από το Looks και ας τα προσθέσουμε κάτω από τα μπλοκ συμβάντων όπως φαίνεται. <br /><br />Χρησιμοποιήστε το αναπτυσσόμενο μενού για να επιλέξετε arctic για το ένα και backdrop1 (το προεπιλογή) για το άλλο.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-11": "Στα συμβάντα, επιλέξτε ένα μπλοκ \"όταν το φόντο αλλάζει σε\". <br /> Χρησιμοποιήστε το αναπτυσσόμενο μενού για να επιλέξετε την Αρκτική.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-12": "Τέλος, μεταβείτε στην επιλογή Motion (Κίνηση), επιλέξτε το μπλοκ \"Wiggle!\" και τοποθετήστε το όπως φαίνεται στο δείγμα κώδικα:",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-1": "Μπορούμε να χρησιμοποιήσουμε sprites για να επικοινωνήσουμε με τον Marty, αλλά και μεταξύ μας, μεταδίδοντας μηνύματα.<br /><br />Θα χρησιμοποιήσουμε ένα sprite για να πούμε στον Marty ότι είναι ώρα για πάρτι!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-2": "Αρχικά, ας επιλέξουμε ένα φόντο για πάρτι. <br/>Ανοίξτε το μενού φόντου και αναζητήστε <b/>πάρτι</b> για να ορίσετε το σκηνικό.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-3": "Τώρα το πάρτι μας χρειάζεται λίγη μουσική! <br/> Κάντε κλικ στην επιλογή «Επιλογή Sprite» και αναζητήστε <b/>ηχείο</b> για να ολοκληρώσετε το σκηνικό του πάρτι μας.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-4": "Κάντε κλικ στον ομιλητή στο μενού των sprites για να μεταβείτε στον κώδικα του ομιλητή. Θέλουμε να γράψουμε κώδικα που να λέει: <br /><br /><i> όταν γίνει κλικ σε αυτό το sprite, να μεταδοθεί η φράση \"ώρα για πάρτι!\"</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-5": "Σύρετε αυτό το μπλοκ στην περιοχή κωδικοποίησης για να ξεκινήσετε τον κώδικα του sprite μας.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-6": "Σύρετε το μπλοκ \"broadcast message1\" στη θέση του όπως φαίνεται. <br /><br />",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-8": "Αυτός θα πρέπει να είναι ο ολοκληρωμένος κώδικας sprite ομιλητή σας.<br/><br/>Τώρα ας πούμε στον Marty τι να κάνει όταν ακούσει το μήνυμα <i/>ώρα για πάρτι!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-9": "Πλοηγηθείτε στα μπλοκ του Marty σας κάνοντας κλικ στον Marty στο μενού συσκευών.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.description": "Μάθετε να χρησιμοποιείτε δηλώσεις if για να διατηρείτε τον Marty ασφαλή!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-1": "Σε αυτό το σεμινάριο, θα μάθουμε πώς λειτουργούν οι εντολές <b/> ​​if</b> και οι αισθητήρες εμποδίων του Marty! <br /><br /> Θα τα χρησιμοποιήσουμε μαζί σε έναν αέναο βρόχο για να βοηθήσουμε τον Marty να σταματήσει να περπατάει αν κάτι εμποδίζει την πορεία του.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-2": "Αυτό είναι ένα μπλοκ πρότασης if. <br /><br />Οι προτάσεις If είναι πραγματικά σημαντικές στον προγραμματισμό. Μας βοηθούν να ελέγχουμε πότε εκτελείται ένας κώδικας.<br/><br/>Μερικές φορές θέλουμε να εκτελεστεί μόνο ένα μέρος του κώδικα <b /> εάν <b /> ισχύει κάτι άλλο.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-3": "Ο κώδικας μέσα στην εντολή if θα εκτελεστεί μόνο εάν ο κώδικας στο διαμάντι είναι αληθής - μπορούμε να κάνουμε τόσα πολλά με τις εντολές if!<br /><br /> Σύρετε ένα μπλοκ εντολής if στην περιοχή scripting για να ξεκινήσετε τον κώδικά μας.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-4": "Θα χρησιμοποιήσουμε τους αισθητήρες εμποδίων του Μάρτι για αυτήν τη δραστηριότητα - μπορείτε να τους δείτε εδώ στους κόκκινους κύκλους.<br /><br />Μπορούν να καταλάβουν αν κάτι εμποδίζει την πορεία του Μάρτι χρησιμοποιώντας ένα ειδικό είδος αόρατου φωτός που ονομάζεται υπέρυθρη (IR).",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-5": "Οι αισθητήρες υπερύθρων αποτελούνται από δύο μέρη: <b />πομπούς και δέκτες.</b> <br /><br />Ο <b />πομπός</b> στέλνει αόρατο φως, το οποίο ανακλάται πίσω εάν υπάρχει κάποιο εμπόδιο στο δρόμο. <br /> Ο <b />δέκτης</b> αναζητά υπέρυθρο φως που αναπηδά πίσω από ένα εμπόδιο. <br /><br />Εάν ο δέκτης ανιχνεύσει ανακλώμενο φως, τότε ο αισθητήρας γνωρίζει ότι υπάρχει κάτι στο δρόμο. <br /><br />Οι αισθητήρες υπερύθρων χρησιμοποιούνται για το άνοιγμα αυτόματων θυρών, τη στάθμευση αυτοκινήτων και την υποβοήθηση των ρομπότ Marty να αποφεύγουν εμπόδια! <br/><br/><br/><i/>Κάντε κλικ στην εικόνα για να αναπτύξετε το διάγραμμα.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-6": "Μεταβείτε στην επιλογή Ανίχνευση και επιλέξτε το μπλοκ \"επιλογή ανίχνευσης εμποδίου ποδιού\".<br /><br />Σε αυτό το παράδειγμα, μπορείτε να επιλέξετε είτε τον αριστερό είτε τον δεξιό αισθητήρα εδάφους από το αναπτυσσόμενο μενού - αλλά πρέπει να επιλέξετε έναν, αλλιώς το μπλοκ δεν θα λειτουργήσει!!<br /><br />τοποθετήστε το μπλοκ ανίχνευσης μέσα στο διαμάντι του μπλοκ δήλωσης if όπως φαίνεται παρακάτω. Αυτός ο κώδικας λέει τώρα, αν <i />η \"ανίχνευση εμποδίου ποδιού\" είναι αληθής, τότε κάντε κάτι.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-8": "Δεν θέλουμε ο Μάρτι να ελέγχει για εμπόδια μόνο μία φορά, θέλουμε να συνεχίζει να ελέγχει ξανά και ξανά, οπότε ας βάλουμε την εντολή if μέσα σε έναν βρόχο forever.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-9": "Τέλεια! Τώρα ας δοκιμάσουμε τον κώδικα της δήλωσης if κάνοντας τον Marty να περπατάει μπροστά για πάντα, εκτός αν βλέπει κάποιο εμπόδιο.<br /><br />Επιλέξτε το μπλοκ «περπατήστε 2 βήματα μπροστά» και τοποθετήστε το μόνο του, έτοιμο να εκτελεστεί παράλληλα με τον κώδικα της δήλωσης if.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-10": "Ας τοποθετήσουμε το τουβλάκι μας μέσα σε έναν αέναο βρόχο, έτσι ώστε ο Μάρτι να συνεχίζει να περπατάει εκτός αν δει κάποιο εμπόδιο.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-11": "Τα κατάφερες!<br /><br /> Τώρα τοποθέτησε τον Μάρτι στο έδαφος μπροστά από ένα εμπόδιο, κάνε κλικ και στους δύο αέναους βρόχους για να ξεκινήσεις τον κώδικά σου και δες αν ο Μάρτι είναι ασφαλής!<br /><br /> Δοκίμασε να αφαιρέσεις το εμπόδιο και τσέκαρε αν ο Μάρτι ξέρει ότι είναι ασφαλές να συνεχίσει να περπατάει.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.description": "Μάθετε να χρησιμοποιείτε τις εντολές if else για να διατηρείτε τον Marty ασφαλή!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-1": "Σε αυτό το σεμινάριο, θα μάθουμε πώς λειτουργούν οι εντολές <b/> ​​if-else</b>! <br /><br /> Θα χρησιμοποιήσουμε τους αισθητήρες εδάφους του Marty σε μια εντολή if-else για να εμποδίσουμε τον Marty να βγει από μια άκρη.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-3": "Επιλέξτε μια πρόταση if-else. <br /><br /> Σύρετέ την στην περιοχή scripting για να ξεκινήσετε τον κώδικά μας.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-4": "Θα χρησιμοποιήσουμε τους αισθητήρες εδάφους του Marty για αυτήν τη δραστηριότητα. Μπορούν να καταλάβουν αν το πόδι του Marty βρίσκεται σε μια επιφάνεια ή όχι.<br /><br /> Θέλουμε να βεβαιωθούμε ότι περπατάει προς τα εμπρός <b/> ​​μόνο αν ΚΑΙ ΤΑ ΔΥΟ πόδια είναι στο έδαφος.<b/> <br /><br /> Επιλέξτε <b/>δύο</b> μπλοκ \"επιλογή αισθητήρα ποδιού στο έδαφος\". Χρησιμοποιήστε το αναπτυσσόμενο μενού για να ορίσετε ένα στο δεξί πόδι και ένα προς τα αριστερά. <br /><br /> Θέλουμε να πούμε στον Marty να περπατήσει προς τα εμπρός <b/>ΑΝ</b> είναι σωστό να έχει και τα δύο πόδια του στο έδαφος.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-5": "Για να βεβαιωθούμε ότι ο κώδικά μας ελέγχει και τους δύο αισθητήρες ταυτόχρονα, θα χρησιμοποιήσουμε το μπλοκ και στους Τελεστές. <br /><br />Τοποθετήστε και τα δύο μπλοκ αισθητήρων μέσα στο μπλοκ και όπως φαίνεται στο δείγμα κώδικα:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-6": "Τώρα ας βάλουμε το μπλοκ και στο μπλοκ if-else, ώστε να ταιριάζει με το παρακάτω δείγμα κώδικα.<br /><br />Αυτός ο κώδικας λέει τώρα: <i/>Εάν η συνάρτηση \"αριστερό πόδι και δεξί πόδι στο έδαφος\" είναι αληθής, κάντε κάτι. Εάν αυτό δεν είναι αληθές, κάντε κάτι άλλο.<i/>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-7": "Ας συμπληρώσουμε την πρόταση if-else. Αν και τα δύο πόδια είναι στο έδαφος, θέλουμε ο Marty να περπατήσει μπροστά. Τοποθετήστε ένα μπλοκ περπατήματος μπροστά στην επάνω θέση όπως φαίνεται.<br /><br /> Εφόσον θέλουμε ο Marty να ελέγχει ότι και τα δύο πόδια είναι με ασφάλεια στο έδαφος μετά από <b/>κάθε βήμα</b>, αλλάξτε το \"2\" σε \"1\" στο μπλοκ περπατήματος.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-8": "Αν το ένα ή και τα δύο πόδια είναι εκτός εδάφους, θέλουμε να σταματήσουμε τον Μάρτι με ασφάλεια - για να το κάνουμε αυτό, θα χρησιμοποιήσουμε το μπλοκ ετοιμότητας για να ισιώσουμε τα πόδια του. <br /><br />Τοποθετήστε ένα μπλοκ ετοιμότητας μετά το \"αλλιώς\", όπως φαίνεται παρακάτω:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-9": "Σχεδόν τελείωσε! Εκτός του ότι δεν θέλουμε ο κώδικάς μας να εκτελείται μόνο μία φορά, θέλουμε να εκτελείται ξανά και ξανά, οπότε ας τα βάλουμε όλα μέσα σε έναν <b/>βρόχο για πάντα</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.name": "Παιχνίδι δοκιμής αντίδρασης!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.description": "Ας φτιάξουμε ένα παιχνίδι δοκιμής αντίδρασης!<br /><br />Θα προγραμματίσουμε το Cog να ανάβει τυχαία και ο παίκτης θα έχει λίγο χρόνο για να πατήσει το κουμπί και να κερδίσει έναν πόντο<br /><br />Θα χρησιμοποιήσουμε μια <i>μεταβλητή</i> για να κρατήσουμε το σκορ και ένα χρονόμετρο για να ελέγξουμε αν είναι αρκετά γρήγοροι",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-1": "Ας φτιάξουμε ένα παιχνίδι δοκιμής αντίδρασης!<br /><br />Θα προγραμματίσουμε το Cog να ανάβει τυχαία και ο παίκτης θα έχει λίγο χρόνο για να πατήσει το κουμπί και να κερδίσει έναν πόντο<br /><br />Θα χρησιμοποιήσουμε μια <i>μεταβλητή</i> για να κρατήσουμε το σκορ και ένα χρονόμετρο για να ελέγξουμε αν είναι αρκετά γρήγοροι",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-2": "Αρχικά, βεβαιωθείτε ότι είστε συνδεδεμένοι σε ένα γρανάζι.<br /><br />Εάν όχι, προσθέστε ένα όπως κάνατε στο προηγούμενο εκπαιδευτικό βίντεο πατώντας το κουμπί Προσθήκη στον πίνακα συσκευών και επιλέγοντας ένα γρανάζι και, στη συνέχεια, κάνοντας κλικ στην επιλογή σύνδεση. Εάν χρειάζεται, επιστρέψτε στο τελευταίο εκπαιδευτικό βίντεο για να δείτε πώς",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-3": "Προσθέστε ένα μπλοκ <b>Όταν έγινε κλικ στη σημαία</b> από την κατηγορία <b>Συμβάντα</b><br /><br />Αυτή θα είναι η έναρξη του προγράμματός μας και θα εκτελεστεί όταν πατήσουμε την πράσινη σημαία στο επάνω μέρος της οθόνης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-4": "<b>Προσθέστε ένα</b> <i>ορίστε τα LED [δακτυλίου] σε [χρώμα]</i> <b>μπλοκ</b> από την κατηγορία <b>Εμφάνιση</b>,<br /><br />Αλλάξτε το για να ορίσετε το χρώμα του <i>κουμπιού</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-5": "Προσθήκη ενός μπλοκ <b>αναμονής [1] δευτερολέπτων</b> από την κατηγορία <b>Έλεγχος</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-6": "Επιστρέψτε στην κατηγορία <b>Εμφάνιση</b> και προσθέστε ένα μπλοκ <b>Απενεργοποίηση όλων των LED</b><br /><br />Προσθέστε το αμέσως μετά το μπλοκ αναμονής, έτσι ώστε το Cog να σβήσει το LED του κουμπιού μετά από 1 δευτερόλεπτο",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-7": "<b>Δοκιμάστε το!</b> Κάντε κλικ στην πράσινη σημαία για να ξεκινήσετε το πρόγραμμα! Το κουμπί στο Cog θα ανάψει για 1 δευτερόλεπτο και στη συνέχεια θα απενεργοποιηθεί.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-8": "<b>Ελέγξτε αν μπορείτε να πατήσετε το κουμπί εγκαίρως!</b> Μεταβείτε στην κατηγορία <b>Συμβάντα</b> και προσθέστε ένα μπλοκ <b>Με το πάτημα του κουμπιού</b><br /><br />",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-9": "Προσθέστε ένα μπλοκ <b>Εάν __ τότε</b> κάτω από το μπλοκ <b>Πατήθηκε το κουμπί στο κουμπί</b> από την κατηγορία <b>Έλεγχος</b><br /><br />Θα χρησιμοποιήσουμε αυτό το μπλοκ if για να ελέγξουμε αν ο παίκτης έχει πατήσει το κουμπί εγκαίρως",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-10": "Σύρετε ένα μπλοκ < στο μπλοκ if από την κατηγορία <b>Τελεστές</b><br /><br />Το σύμβολο < σημαίνει 'μικρότερο από' και θα ισχύει μόνο εάν ο αριθμός στα αριστερά είναι μικρότερος από τον αριθμό στα δεξιά",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-13": "Προσθέστε ένα μπλοκ <b>Επαναφορά χρονοδιακόπτη</b> κάτω από το μπλοκ <b>Όταν γίνει κλικ στη σημαία</b><br /><br />Αυτό θα επαναφέρει τη μεταβλητή χρονοδιακόπτη πίσω στο 0 λίγο πριν ανάψει η λυχνία LED του κουμπιού",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-15": "Προσθέστε ένα μπλοκ <b>Παρασκευή νότας [C4] για [1] δευτερόλεπτα</b> από την κατηγορία <b>Ήχος</b><br /><br />Τοποθετήστε το αμέσως μετά το μπλοκ <b>Ορισμός LED</b> και αλλάξτε το ώστε να παίζει <b>C6</b> για <b>0,25 δευτερόλεπτα</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-16": "Προσθέστε ένα μπλοκ <b>Απενεργοποίηση όλων των LED</b> μετά το μπλοκ <b>Παρασκευή νότας</b><br /><br />Ο κώδικας μέσα στην πρόταση if θα εκτελεστεί μόνο (και έτσι το Cog θα ανάψει και θα κάνει μπιπ) μόνο εάν πατηθεί το κουμπί εντός 1 δευτερολέπτου από την επαναφορά του χρονομέτρου",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-17": "<b>Δοκιμάστε το!</b> Πατήστε την πράσινη σημαία για να ξεκινήσετε και, στη συνέχεια, αν πατήσετε το κουμπί εντός 1 δευτερολέπτου, τα φώτα θα ανάψουν και θα ακούσετε το ηχητικό σήμα!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-19": "Προσθέστε επίσης ένα ακόμη μπλοκ <b>Περιμένετε [1] δευτερόλεπτα</b> μέσα στον βρόχο επανάληψης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-20": "Μεταβείτε στην κατηγορία <b>Χειριστές</b> και αλλάξτε τον χρόνο σε αυτό το μπλοκ αναμονής σε έναν τυχαίο αριθμό μεταξύ 1 και 5 δευτερολέπτων",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-21": "Τώρα, όταν πατάτε την πράσινη σημαία, θα έχετε 10 ευκαιρίες να πατήσετε το κουμπί όσο είναι αναμμένο!<br /><br />Θα υπάρχει μια τυχαία παύση μεταξύ κάθε μιας και, κατά τη διάρκεια κάθε επανάληψης στον βρόχο, ο χρονοδιακόπτης μηδενίζεται, επομένως δεν χρειάζεται να αλλάξουμε τον κώδικα που αντιδρά στο πάτημα του κουμπιού. <br /><br />Δοκιμάστε το! Πόσα από τα φώτα μπορείτε να πιάσετε;",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-22": "Το να κρατάς το σκορ σου στο μυαλό σου είναι λίγο βαρετό. Ας προσθέσουμε κώδικα για να κρατάμε το σκορ αυτόματα!<br /><br />Μεταβείτε στην κατηγορία <b>Μεταβλητές</b> και δημιουργήστε μια μεταβλητή που ονομάζεται <b>βαθμολογία</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-23": "Προσθέστε ένα μπλοκ <b>Ορισμός [η μεταβλητή μου] σε [0]</b> αμέσως μετά το μπλοκ <b>Όταν έγινε κλικ στη σημαία</b>, πριν από τον βρόχο επανάληψης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-25": "Μέσα στην εντολή if, προσθέστε μια μεταβλητή change [my variable] κατά 1 μπλοκ και επιλέξτε τη μεταβλητή <b>score</b> από το μενού, ώστε να λέει 'change score κατά 1'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-26": "Δοκιμάστε το!<br /><br />Τώρα κάθε φορά που πατάτε το κουμπί στο χρόνο, το σκορ θα αυξάνεται κατά 1!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-27": "Τώρα ας το κάνουμε λίγο πιο δύσκολο!<br /><br />Τι θα γινόταν αν τα φώτα ανάβουν πιο γρήγορα καθώς εσύ ανάβεις;<br /><br />Δημιουργήστε μια άλλη μεταβλητή και ονομάστε την <i>καθυστέρηση</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-28": "Ορίστε την «καθυστέρηση» σε 1 στην αρχή του προγράμματος, αμέσως μετά την επαναφορά της βαθμολογίας",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-29": "Ας μειώνουμε την καθυστέρηση κάθε φορά μέσω του βρόχου επανάληψης!<br /><br />Προσθέστε ένα μπλοκ <b>Αλλαγή [καθυστέρησης] κατά [1]</b> μέσα στον βρόχο επανάληψης.<br /><br />Δεν περιμένουμε να μειωθεί πολύ η καθυστέρηση, οπότε ορίστε την να αλλάζει την «καθυστέρηση» κατά -0,05. Αυτό θα τη μειώνει κατά 1/20 του δευτερολέπτου κάθε φορά.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-30": "Κατά τη διάρκεια των 10 επαναλήψεων του βρόχου επανάληψης, η καθυστέρηση θα μειωθεί από 1 δευτερόλεπτο σε 0,5 (ή μισό δευτερόλεπτο)",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-31": "Ας χρησιμοποιήσουμε τώρα τη μεταβλητή καθυστέρησης<br /><br />Ένα καλό πράγμα σχετικά με τις μεταβλητές είναι ότι μπορούμε να τις χρησιμοποιήσουμε σε περισσότερα από ένα σημεία<br /><br />Σύρετε τη μεταβλητή καθυστέρησης στο μπλοκ '<' έτσι ώστε να λέει <i>αν χρονιστής <delay then</i><br /><br />Σύρετέ την επίσης στο μπλοκ 'wait [1] second', έτσι ώστε να λέει 'wait [delay] seconds'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-32": "Δοκιμάστε το!<br /><br />Παρατηρείτε την επιτάχυνση του παιχνιδιού;",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-33": "Ας κάνουμε το γρανάζι να δείχνει το σκορ στον παίκτη στο τέλος.<br /><br />Μπορούμε να το κάνουμε αυτό όπως κάναμε με τα ζάρια στην προηγούμενη δραστηριότητα.<br /><br />Πρώτα απ 'όλα, δημιουργήστε μια μεταβλητή που ονομάζεται <b>ledID</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-34": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-35": "Στη συνέχεια, μεταβείτε στην κατηγορία <b>Έλεγχος</b> και προσθέστε έναν ακόμη βρόχο <b>επανάληψης</b>.<br /><br />Αντικαταστήστε τον αριθμό σε αυτόν με τη μεταβλητή 'βαθμολογία', έτσι ώστε να λέει 'επανάληψη [βαθμολογία]'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-36": "Προσθέστε ένα μπλοκ <b>Ορισμός LED [1] σε [χρώμα]</b> μέσα σε αυτόν τον νέο βρόχο επανάληψης<br /><br />Αντικαταστήστε τον αριθμό με τη μεταβλητή 'ledID', έτσι ώστε να λέει 'Ορισμός LED [ledID] σε [χρώμα]'<br /><br />Στη συνέχεια, ορίστε το χρώμα σε όποιο χρώμα θέλετε!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-38": "Δοκιμάστε το!<br /><br />Τώρα, όταν τελειώσετε, το Cog θα εμφανίσει το σκορ σας!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-39": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-2": "Αρχικά, βεβαιωθείτε ότι είστε συνδεδεμένοι σε ένα γρανάζι.<br /><br />Εάν όχι, προσθέστε ένα όπως κάνατε στο προηγούμενο εκπαιδευτικό βίντεο πατώντας το κουμπί Προσθήκη στον πίνακα συσκευών και επιλέγοντας ένα γρανάζι και, στη συνέχεια, κάνοντας κλικ στην επιλογή σύνδεση. Εάν χρειάζεται, επιστρέψτε στο τελευταίο εκπαιδευτικό βίντεο για να δείτε πώς",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-4": "Μεταβείτε στην κατηγορία <b>Εμφάνιση</b> και προσθέστε ένα <b>σετ LED χρησιμοποιώντας το μπλοκ επιλογής χρώματος</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-5": "Ρυθμίστε τα χρώματα σε ό,τι θέλετε.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-7": "Προσθέστε ένα ακόμη μπλοκ <b>σε αντικείμενο που ανιχνεύθηκε</b> από την κατηγορία <b>Συμβάντα</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-8": "Αλλάξτε τον αισθητήρα προς τα δεξιά, χρησιμοποιώντας το αναπτυσσόμενο μενού.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-10": "Δοκίμασέ το! Βάλε ένα αντικείμενο στον δεξιό αισθητήρα εμποδίων.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-12": "Αυτή η κινούμενη εικόνα αποτελούνταν από 9 <b>καρέ</b>, το καθένα σε ξεχωριστό μπλοκ επιλογής χρώματος, με ένα μπλοκ απενεργοποίησης LED στο τέλος.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-15": "Μέχρι στιγμής, κάθε φορά που χρησιμοποιούμε το κουμπί στο Cog, ανιχνεύει αν είναι πατημένο ή όχι.<br /><br />Αυτόν τον τύπο πληροφορίας τον ονομάζουμε <b>λογική</b> τιμή - κάτι που είναι είτε αληθές είτε ψευδές.<br /><br />Εκτός από το να θεωρούμε το κουμπί ως λογικό εισόδημα, μπορούμε επίσης να το χρησιμοποιήσουμε ως <b>αναλογικό</b> εισόδημα - ένα εισόδημα που μπορεί να έχει πολλές διαφορετικές τιμές.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-16": "Μεταβείτε στην κατηγορία <b>Αίσθηση</b> και επιλέξτε το πλαίσιο δίπλα στο μπλοκ <b>Τιμή δύναμης κουμπιού %</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-18": "Μεταβείτε στην κατηγορία <b>Συμβάντα</b> και προσθέστε ένα μπλοκ <b>Όταν έγινε κλικ στη σημαία</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-19": "Τώρα μεταβείτε στην κατηγορία <b>Έλεγχος</b> και προσθέστε έναν βρόχο <b>για πάντα</b>.<br /><br />Σε αντίθεση με τον βρόχο <b>επανάληψη</b> που επαναλαμβανόταν μόνο έναν συγκεκριμένο αριθμό φορών, ο βρόχος <b>για πάντα</b> θα συνεχίσει να επαναλαμβάνεται μέχρι να πατήσετε το κόκκινο κουμπί διακοπής.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-20": "Μεταβείτε στην κατηγορία <b>Εμφάνιση</b> και προσθέστε ένα μπλοκ <b>ορίστε τα LED [δακτυλίου] σε [χρώμα]</b> στον βρόχο forever.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-21": "Τώρα σύρετε το μπλοκ που λέει <b>απόχρωση [360] κορεσμός [100] φωτεινότητα [100]</b> στο σημείο για το χρώμα στο μπλοκ <b>ορισμός των LED [δακτυλίου] σε [χρώμα]</b>.<br /><br />Υπάρχουν μερικοί διαφορετικοί τρόποι για να περιγράψετε τα χρώματα και η Απόχρωση, ο Κορεσμός και η Φωτεινότητα (ή Τιμή) είναι ένας από αυτούς.<br /><br />Με αυτούς τους τρεις αριθμούς μπορούμε να περιγράψουμε οποιοδήποτε χρώμα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-22": "Η <b>Απόχρωση</b> είναι ένας αριθμός μεταξύ 0 και 360 (όπως οι μοίρες σε έναν κύκλο) που λέει ποιο βασικό χρώμα θέλουμε.<br /><br />Μπορεί να εμφανιστεί σε έναν κύκλο - και το έχετε ήδη δει αυτό όταν χρησιμοποιείτε τον επιλογέα χρωμάτων!<br /><br />Οι 0 μοίρες βρίσκονται στην κορυφή και αντιπροσωπεύουν το κόκκινο. Οι 90 μοίρες είναι ένα πρασινοκίτρινο, οι 180 μοίρες είναι ένα κυανό μπλε, οι 270 μοίρες είναι μοβ και οι 360 μοίρες είναι πίσω στο κόκκινο!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-24": "Τέλος, η <b>φωτεινότητα</b> (ή φωτεινότητα ή τιμή) υποδεικνύει πόσο φωτεινό θέλετε να είναι το χρώμα.<br /><br />Σε αυτό το παράδειγμα, με απόχρωση 360 και κορεσμό 100, μια φωτεινότητα 100 δίνει και πάλι το πιο κόκκινο κόκκινο.<br /><br />Μια φωτεινότητα 0 δεν δίνει καθόλου κόκκινο - σε αυτήν την περίπτωση, η λυχνία LED στο Cog απλώς θα σβήσει!<br /><br />Μια φωτεινότητα 50 θα είναι στη μέση - ένα σκούρο κόκκινο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-26": "Ας ανάψουμε και το φως στο κουμπί στο Cog για πλάκα!<br /><br />Προσθέστε ένα μπλοκ <b>Ορίστε τα LED [δακτυλίου] σε [χρώμα]</b> πριν από τον βρόχο για πάντα και αλλάξτε το για να ορίσετε το <b>κουμπί</b>. Διαλέξτε όποιο χρώμα θέλετε.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-27": "Δοκιμάστε το! Καθώς πατάτε το κουμπί, οι λυχνίες LED θα ανάβουν όλο και πιο έντονα με κόκκινο χρώμα!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-28": "Δοκιμάστε το με τη δύναμη του κουμπιού για να ρυθμίσετε τον κορεσμό αντί για την φωτεινότητα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-29": "Τώρα τα φώτα θα αλλάζουν από λευκό σε κόκκινο καθώς πατάτε το κουμπί!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-30": "Τέλος, δοκιμάστε να ορίσετε την απόχρωση.<br /><br />Η τιμή για την απόχρωση πρέπει να κυμαίνεται από 0 έως 360, επομένως θα χρειαστεί να κάνουμε μερικούς υπολογισμούς.<br /><br />Μεταβείτε στην κατηγορία <b>Τελεστές</b> και σύρετε ένα μπλοκ <b>πολλαπλών</b> στην τιμή απόχρωσης.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-31": "Ρυθμίστε το ώστε να πολλαπλασιάσει την τιμή δύναμης του κουμπιού επί 3,6.<br /><br />Αυτό σημαίνει ότι αντί να δίνουμε αριθμούς από 0 έως 100, θα λαμβάνουμε αριθμούς από 0 έως 360 (3,6 x 100).<br /><br />Δοκιμάστε το!<br /><br />Τώρα, καθώς πατάτε το κουμπί, το χρώμα των φώτων θα αλλάξει από κόκκινο σε πράσινο, σε μπλε και ξανά σε κόκκινο!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-32": "Δες αν μπορείς να αλλάξεις και το χρώμα του κουμπιού!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-33": "Στη συνέχεια, ας δούμε αν μπορούμε να κάνουμε το Cog να αντιδρά στα έντονα φώτα λάμποντας για λίγο.<br /><br />Διαγράψτε τον κώδικα που δημιουργήσατε για να αλλάξετε τα χρώματα με βάση τη δύναμη του κουμπιού, σύροντάς τον στην παλέτα μπλοκ.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-34": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-36": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-37": "Στη συνέχεια, μεταβείτε στους <b>Τελεστές</b> και προσθέστε ένα μπλοκ <b>μεγαλύτερο από</b> στο μπλοκ <b>αναμονή μέχρι</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-38": "Επιστρέψτε στην κατηγορία <b>Ανίχνευση</b> και σύρετε το μπλοκ <b>Τιμή φωτισμού περιβάλλοντος</b> στην αριστερή πλευρά του μπλοκ <b>&gt;</b>.<br /><br />Αλλάξτε τη δεξιά πλευρά σε έναν αριθμό που θα επιτευχθεί μόνο όταν φωτίσετε με φακό το Cog.<br /><br />Δεν χρειάζεται να εισάγετε τον μέγιστο αριθμό, μόνο έναν που είναι μεγαλύτερος από αυτόν που βλέπετε χωρίς φακό.<br /><br />Εδώ έχω επιλέξει 1500, οπότε ολόκληρη η γραμμή γράφει <b>περιμένετε μέχρι η τιμή φωτισμού περιβάλλοντος να γίνει >1500</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-39": "Προσθέστε ένα μπλοκ <b>Ορισμός των LED [δακτυλίου] σε [χρώμα]</b> κάτω από το μπλοκ <b>αναμονή μέχρι</b>.<br /><br />Προσθέστε επίσης ένα μπλοκ <b>Απενεργοποίηση όλων των LED</b> στην κορυφή, για να βεβαιωθείτε ότι έχουν γίνει επαναφορές.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-40": "Δοκιμάστε το!<br /><br />Κάντε κλικ στην πράσινη σημαία για να ξεκινήσετε τον κώδικα.<br /><br />Στη συνέχεια, όταν φωτίσετε το Cog με έναν φακό, τα φώτα θα ανάψουν!<br /><br />Το μπλοκ <b>αναμονή μέχρι</b> θα σταματήσει την εκτέλεση του κώδικα μέχρι να ικανοποιηθεί η συνθήκη που έχετε θέσει.<br /><br />Σε αυτήν την περίπτωση, ελέγχεται εάν η τιμή του αισθητήρα φωτός είναι αρκετά φωτεινή.<br /><br />Μόλις η συνθήκη είναι αληθής, το μπλοκ <b>αναμονή μέχρι</b> να ικανοποιηθεί και η εκτέλεση μετακινείται στο μπλοκ <b>ορισμός των LED [δακτυλίου] σε [χρώμα]</b> για να ενεργοποιηθούν τα LED.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-41": "Ας ανάψουμε σταδιακά τα φώτα στο Cog όταν ανιχνεύσει έναν φακό.<br /><br />Για να το κάνουμε αυτό, θα χρησιμοποιήσουμε ξανά μια μεταβλητή!<br /><br />Μεταβείτε στην κατηγορία <b>Μεταβλητές</b> και δημιουργήστε μια μεταβλητή που ονομάζεται <b>φωτεινότητα</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-42": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-43": "Τώρα προσθέστε ένα μπλοκ <b>επανάληψη μέχρι</b> κάτω από το μπλοκ <b>αναμονή μέχρι</b> και κάντε το να περιβάλλει το μπλοκ <b>Ορισμός LED [δακτυλίου] σε [χρώμα]</b>.<br /><br />Μπορείτε να βρείτε το μπλοκ <b>επανάληψη μέχρι</b> στην κατηγορία <b>Έλεγχος</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-44": "Χρησιμοποιώντας τη μεταβλητή <b>φωτεινότητα</b> που μόλις δημιουργήσατε, αλλάξτε την έτσι ώστε η γραμμή να διαβάζεται <b>επαναλαμβάνεται μέχρι η φωτεινότητα να γίνει >100</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-45": "Τώρα προσθέστε ένα μπλοκ <b>αλλαγής φωτεινότητας κατά 10</b> μέσα στο μπλοκ <b>επανάληψη μέχρι</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-46": "Αλλάξτε το μπλοκ <b>set [ring] LEDs σε [color]</b> για να χρησιμοποιήσετε ένα μπλοκ <b>απόχρωση, κορεσμός, φωτεινότητα</b>.<br /><br />Χρησιμοποιήστε τη μεταβλητή <b>φωτεινότητα</b> για φωτεινότητα.<br /><br />Επίσης, αλλάξτε το χρώμα σε ένα ωραίο μπλε ορίζοντας την απόχρωση σε 180.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-47": "Στη συνέχεια, προσθέστε ένα μπλοκ <b>αναμονή</b> από την κατηγορία <b>Έλεγχος</b> και αλλάξτε το σε <b>αναμονή 0,1 δευτερολέπτων</b>.<br /><br />Αυτό θα επιβραδύνει λίγο το fade.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-48": "Το μπλοκ <b>επανάληψη μέχρι</b> μοιάζει λίγο με έναν συνδυασμό του μπλοκ <b>επανάληψη</b> που χρησιμοποιήσατε προηγουμένως, το οποίο επαναλήφθηκε έναν συγκεκριμένο αριθμό φορών, και του μπλοκ <b>αναμονή μέχρι</b> που μόλις χρησιμοποιήσατε.<br /><br />Σε αυτήν την περίπτωση, θα συνεχίσει να επαναλαμβάνεται μέχρι να ικανοποιηθεί η συνθήκη και στη συνέχεια θα σταματήσει να επαναλαμβάνεται και η εκτέλεση κώδικα θα προχωρήσει.<br /><br />Σε αυτό το παράδειγμα, θα συνεχίσει να επαναλαμβάνει τον βρόχο και θα αυξάνει σταδιακά τη φωτεινότητα μέχρι η φωτεινότητα να φτάσει στη μέγιστη τιμή 100.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-49": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-50": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-51": "Τώρα προσθέστε ένα ακόμη μπλοκ <b>επανάληψη μέχρι</b> και επαναλάβετε το μέχρι η φωτεινότητα να γίνει μικρότερη από (<) 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-52": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-53": "Αυτός ο κώδικας σχεδόν θα λειτουργήσει, αλλά μπορείτε να εντοπίσετε το σφάλμα;<br /><br />Η φωτεινότητα θα συνεχίσει να αυξάνεται αντί να μειώνεται!<br /><br />Αλλάξτε τον έτσι ώστε να λέει <b>αλλαγή φωτεινότητας κατά -5</b>.<br /><br />Το <b>-5</b> εδώ θα αφαιρεί 5 από τη μεταβλητή φωτεινότητας κάθε φορά.<br /><br />Αυτό θα σβήσει σταδιακά τα φώτα με τη μισή ταχύτητα από αυτήν που τα βάλαμε σταδιακά.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-54": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-55": "Ας το κάνουμε έτσι ώστε να μην χρειάζεται να κάνετε κλικ στην πράσινη σημαία κάθε φορά που θέλετε να αντιδρά το Cog.<br /><br />Προσθέστε έναν βρόχο <b>για πάντα</b> έτσι ώστε να ξεκινά μετά το μπλοκ <b>Απενεργοποίηση όλων των LED</b> και να περιβάλλει όλο τον άλλο κώδικα.<br /><br />Τώρα το Cog θα συνεχίσει να αντιδρά στα έντονα φώτα μέχρι να πατήσετε το κόκκινο σήμα στοπ!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-56": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-57": "Επόμενα βήματα - αν βρίσκεστε σε μια τάξη με άλλα άτομα με Cogs ή αν έχετε περισσότερα από ένα, δοκιμάστε να συνδυάσετε πολλά από αυτά ενώ εκτελούν τον κώδικα που μόλις φτιάξατε.<br /><br />Μπορείτε να χρησιμοποιήσετε έναν φακό για να γράψετε πράγματα πάνω τους και να ζωγραφίσετε με φως;",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.description": "Ας φτιάξουμε ένα ακόμη χρήσιμο πράγμα με το Cog! <br /><br />Αυτή τη φορά θα χρησιμοποιήσουμε την ανίχνευση κλίσης του Cog για να φτιάξουμε ένα αλφάδι - κάτι που δείχνει αν κάτι είναι επίπεδο ή αν έχει κλίση. <br /><br />Πολλά αλφάδια λειτουργούν μόνο σε μία διάσταση, αλλά εμείς θα κάνουμε το δικό μας να λειτουργεί σε δύο!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-2": "Αρχικά, βεβαιωθείτε ότι είστε συνδεδεμένοι σε ένα γρανάζι.<br /><br />Εάν όχι, προσθέστε ένα όπως κάνατε στο προηγούμενο εκπαιδευτικό βίντεο πατώντας το κουμπί Προσθήκη στον πίνακα συσκευών και επιλέγοντας ένα γρανάζι και, στη συνέχεια, κάνοντας κλικ στην επιλογή σύνδεση. Εάν χρειάζεται, επιστρέψτε στο τελευταίο εκπαιδευτικό βίντεο για να δείτε πώς",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-3": "Μεταβείτε στην κατηγορία <b>Συμβάντα</b> και προσθέστε ένα μπλοκ συμβάντος <b>σε κλίση [αριστερά]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-4": "Τώρα μεταβείτε στην κατηγορία <b>Εμφάνιση</b> και προσθέστε ένα <b>σετ LED χρησιμοποιώντας το μπλοκ επιλογής χρώματος</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-6": "Στη συνέχεια, ρυθμίστε μόνο ένα LED στα αριστερά να είναι αναμμένο.<br /><br />Δοκιμάστε το! Γείρετε το γρανάζι προς τα αριστερά.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-7": "Προσθέστε ένα άλλο μπλοκ <b>σε κλίση [αριστερά]</b> από την κατηγορία ελέγχου και αλλάξτε το έτσι ώστε να λέει <b>σε κλίση [δεξιά]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-9": "Δοκιμάστε το!<br /><br />Γείρετε το γρανάζι αριστερά και δεξιά.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-11": "Τέλος, προσθέστε ένα τέταρτο σετ μπλοκ και ρυθμίστε τα σε <b>κλίση [προς τα εμπρός]</b> και για να ενεργοποιήσετε τη λυχνία LED στο μπροστινό μέρος του γραναζιού.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-12": "Δοκιμάστε το!<br /><br />Γείρετε το γρανάζι και προς τις τέσσερις κατευθύνσεις και δείτε πώς κινείται το φως!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-13": "Ας εμφανίσουμε αυτές τις πληροφορίες και στην οθόνη!<br /><br />Μεταβείτε στην κατηγορία <b>Αισθητήρες</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-14": "Επιλέξτε το πλαίσιο ελέγχου δίπλα στο <b>Επιταχυνσιόμετρο X</b>.<br /><br />Στη συνέχεια, αλλάξτε το X σε Y από το αναπτυσσόμενο μενού και επιλέξτε το πλαίσιο ελέγχου δίπλα σε αυτό.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-16": "Ας το δούμε αυτό λίγο πιο λεπτομερώς, κάνοντας κλικ στο κουμπί <b>Πίνακας ελέγχου αισθητήρων</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-18": "Και επιλέξτε το Cog σας.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-19": "Θα εμφανιστεί ένα γράφημα!<br /><br />Πρέπει να επιλέξουμε τους αισθητήρες που θέλουμε να εμφανίσουμε. Κάντε κλικ για να αναπτύξετε την κατηγορία <b>Επιταχυνσιόμετρο</b> και, στη συνέχεια, επιλέξτε τα πλαίσια δίπλα στα <b>X</b> και <b>Y</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-20": "Πατήστε το κουμπί <b>αναπαραγωγή</b> για να ξεκινήσετε την εμφάνιση των δεδομένων του αισθητήρα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-21": "Γείρετε το γρανάζι κλίσης και δείτε πώς αλλάζουν οι τιμές για τον άξονα Χ και τον άξονα Υ.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-23": "Ας κάνουμε λίγη επιστήμη! Θα χρειαστείτε λίγο χαρτί για να κρατήσετε μερικές σημειώσεις.<br /><br />Γείρετε το γρανάζι προς τα δεξιά και σημειώστε την αξία που έχουν ο άξονας του επιταχυνσιόμετρου και οι αισθητήρες ay του επιταχυνσιόμετρου.<br /><br />Στη συνέχεια, κάντε το ίδιο για την κλίση προς τα εμπρός, προς τα πίσω και προς τα αριστερά.<br /><br />Θα χρησιμοποιήσουμε αυτά τα δεδομένα σε λίγο!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-24": "Τώρα μεταβείτε στην κατηγορία <b>Μεταβλητές</b> και δημιουργήστε δύο μεταβλητές που ονομάζονται <b>ax</b> (για το επιταχυνσιόμετρο x) και <b>ay</b> (για το επιταχυνσιόμετρο y).",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-25": "Προσθέστε αυτά τα μπλοκ στο έργο σας:<br /><br /><ul><li>Όταν κάνετε κλικ στη σημαία:</li><ul><li>Για πάντα:</li><ul><li>Ορίστε το ax σε Επιταχυνσιόμετρο X</li><li>Ορίστε το ay σε Επιταχυνσιόμετρο Y</li></ul></ul></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-26": "Τώρα μεταβείτε στην κατηγορία <b>Εκδηλώσεις</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-28": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-30": "Τώρα κάντε κλικ στην καρτέλα <b>Sprites</b> στο επάνω μέρος.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-31": "Κάντε κλικ στο κουμπί <b>Προσθήκη αντικειμένου</b> και επιλέξτε το αντικειμενικό αντικείμενο <b>Μπάλα</b> (ή οποιοδήποτε άλλο αντικειμενικό αντικείμενο θέλετε).",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-32": "Ο κώδικά σας θα εξαφανιστεί! Μην ανησυχείτε - είναι ακόμα εκεί, απλώς συνδεδεμένος με το cog και όχι με αυτό το sprite.<br /><br />Μεταβείτε στην κατηγορία <b>Συμβάντα</b> και προσθέστε ένα μπλοκ <b>όταν λαμβάνω [ενημέρωση θέσης]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-33": "Αλλάξτε το έτσι ώστε να λέει <b>όταν λαμβάνω [ενημέρωση θέσης]</b> - αυτό είναι το μήνυμα που μόλις δημιουργήσαμε.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-34": "Τώρα μεταβείτε στην κατηγορία <b>Κίνηση</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-35": "Προσθήκη ενός μπλοκ <b>μετάβαση σε x: [] y: []</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-36": "Το μέσο της οθόνης έχει τις συντεταγμένες [0,0].<br /><br />Οι συντεταγμένες στα δεξιά του μέσου έχουν τιμές x πάνω από 0.<br />Οι συντεταγμένες στα αριστερά του μέσου έχουν τιμές x κάτω από 0.<br />Οι συντεταγμένες πάνω από το μέσο έχουν τιμές y πάνω από 0.<br />Οι συντεταγμένες κάτω από το μέσο έχουν τιμές y κάτω από 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-37": "Θέλουμε να μετακινήσουμε την μπάλα για να δείξουμε πόσο έχει κλίση το Cog.<br /><br />Δείτε ξανά τις σημειώσεις που κάνατε σχετικά με τις μετρήσεις του επιταχυνσιόμετρου που λάβατε όταν γείρατε το γρανάζι προς καθεμία από τις τέσσερις κατευθύνσεις.<br /><br />Θέλουμε η μπάλα να κινείται αριστερά και δεξιά όταν γείρετε το γρανάζι αριστερά και δεξιά. Για το sprite, το αριστερό και το δεξί ορίζονται από τη συντεταγμένη x του.<br /><br />Θα πρέπει να δείτε ότι όταν γείρατε το γρανάζι προς τα δεξιά, η τιμή ay ήταν πάνω από 0, ενώ η τιμή ax ήταν σχεδόν 0. Όταν γείρατε προς τα αριστερά, η τιμή ay ήταν κάτω από 0.<br /><br />Αυτό σημαίνει ότι πρέπει να χρησιμοποιήσουμε την τιμή ay για να ορίσουμε τη συντεταγμένη x του sprite.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-39": "Μεταβείτε στην κατηγορία <b>Μεταβλητές</b> και προσθέστε τη μεταβλητή <b>ay</b> στο μπλοκ πολλαπλασιασμού.<br /><br />Πληκτρολογήστε <b>100</b> στην άλλη πλευρά του μπλοκ πολλαπλασιασμού.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-41": "Θα πρέπει να δείτε ότι το <b>ax</b> άλλαξε - επομένως θα το χρησιμοποιήσουμε για να ορίσουμε τη συντεταγμένη y.<br /><br />Προσθέστε ένα άλλο μπλοκ πολλαπλασιασμού και τοποθετήστε τη μεταβλητή <b>ax</b> μέσα σε αυτό.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-42": "Αλλά υπάρχει ένα πρόβλημα! Θέλουμε το sprite να κινείται προς τα πάνω όταν γείρετε το γρανάζι προς τα εμπρός, πράγμα που σημαίνει ότι χρειαζόταν μια συντεταγμένη y πάνω από το 0.<br /><br />Αλλά όταν γείρατε το γρανάζι προς τα εμπρός, η τιμή ay ήταν κάτω από το 0!<br /><br />Για να το διορθώσουμε αυτό, θα πρέπει να το πολλαπλασιάσουμε με <b>-100</b> αντί για <b>100</b>. Το επιπλέον σύμβολο μείον θα το μετατρέψει από κάτω από το 0 σε πάνω από το 0 και αντίστροφα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-43": "Επιστρέψτε στον κωδικό γρανάζι σας κάνοντας κλικ στο σύμβολο γρανάζι στον πίνακα συσκευών.<br /><br />Το γρανάζι θα ανάψει και θα κάνει ένα ηχητικό σήμα όταν το επιλέξετε!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-44": "Τώρα πατήστε την <b>πράσινη σημαία</b> για να εκτελέσετε τον κώδικά σας.<br /><br />Θα πρέπει να δείτε την μπάλα να κινείται καθώς γέρνετε το γρανάζι!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-45": "Ας προσθέσουμε ένα φόντο πίσω από την μπάλα για να υποδείξουμε καλύτερα τι δείχνουμε.<br /><br />Επιλέξτε το <b>Στάδιο</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-46": "Στη συνέχεια, επιλέξτε την καρτέλα <b>Φόντα</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-47": "Σχεδιάστε μερικούς κύκλους γύρω από το μεσαίο σημείο.<br /><br />Μπορείτε να τους κάνετε πολύχρωμους αν θέλετε!<br /><br />Υπόδειξη - αν χρησιμοποιείτε υπολογιστή, μπορείτε να κρατήσετε πατημένο το Shift για να βεβαιωθείτε ότι θα έχετε έναν κύκλο αντί για έλλειψη.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-48": "Μπορείτε να επιλέξετε την καρτέλα <b>Κώδικας</b> στο επάνω μέρος για να επιστρέψετε στην οθόνη κωδικοποίησης και να επιλέξετε ξανά Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-49": "Δοκιμάστε το!<br /><br />Τώρα, καθώς γέρνετε το Cog, θα μπορείτε να δείτε έναν οδηγό για το πόσο κοντά βρίσκεστε στο επίπεδο!<br /><br />Όταν το Cog είναι ακίνητο, ασκείται πάντα 1G βαρύτητας πάνω του. Αν γέρνετε πολύ το cog, θα δείτε ότι μπορείτε να κάνετε το ax ή το ay να είναι ίσα με 1 - αυτό θα συμβεί όταν ο δείκτης βρίσκεται όσο το δυνατόν πιο μακριά από τη μέση.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-50": "Αν γείρετε σε γωνία 45 μοιρών, ο δείκτης θα έχει την ίδια απόσταση από τη μέση, αλλά οι ax και ay θα είναι τώρα περίπου 0,7 - μπορείτε να σκεφτείτε γιατί συμβαίνει αυτό;",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-51": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-52": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-53": "Ας κάνουμε το Cog να δείχνει επίσης πότε είναι επίπεδο!<br /><br />Επιστρέψτε στην κατηγορία <b>Αίσθηση</b> και επιλέξτε το πλαίσιο ελέγχου δίπλα στην επιλογή <b>Κατεύθυνση κλίσης</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-54": "Δείτε τι συμβαίνει στην <b>κατεύθυνση κλίσης</b> καθώς μετακινείτε το Cog.<br /><br />Όταν είναι σχεδόν επίπεδο, η κατεύθυνση κλίσης θα είναι <b>μηδενική</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-55": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-56": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.name": "Ας φτιάξουμε ένα παιχνίδι σκι!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.description": "Ας φτιάξουμε ένα παιχνίδι όπου θα χρησιμοποιούμε Cog και Sprites στην οθόνη!<br /><br />Θα φτιάξουμε ένα παιχνίδι σκι όπου ο παίκτης πρέπει να αποφεύγει να χτυπάει δέντρα και βράχους.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-1": "Ας φτιάξουμε ένα παιχνίδι όπου θα χρησιμοποιούμε Cog και Sprites στην οθόνη!<br /><br />Θα φτιάξουμε ένα παιχνίδι σκι όπου ο παίκτης πρέπει να αποφεύγει να χτυπάει δέντρα και βράχους.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-1.2": "Αρχικά, βεβαιωθείτε ότι είστε συνδεδεμένοι σε ένα γρανάζι.<br /><br />Εάν όχι, προσθέστε ένα όπως κάνατε στο προηγούμενο εκπαιδευτικό βίντεο πατώντας το κουμπί Προσθήκη στον πίνακα συσκευών και επιλέγοντας ένα γρανάζι και, στη συνέχεια, κάνοντας κλικ στην επιλογή σύνδεση. Εάν χρειάζεται, επιστρέψτε στο τελευταίο εκπαιδευτικό βίντεο για να δείτε πώς",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-2": "Μεταβείτε στην κατηγορία Συμβάντα και προσθέστε ένα μπλοκ <b>Σε ανίχνευση αντικειμένου [αριστερά]</b>.<br /><br />Θα το χρησιμοποιήσουμε ως κουμπί έναρξης.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-3": "Προσθέστε έναν βρόχο <b>για πάντα</b> από την κατηγορία Έλεγχος.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-4": "Μεταβείτε στην κατηγορία μεταβλητών και δημιουργήστε μια μεταβλητή που ονομάζεται <b>ay</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-5": "Προσθέστε μπλοκ για να <i>ορίσετε το [ay] σε [accelerometer [Y]]</i> μέσα στον βρόχο forever.<br /><br />Θα χρειαστεί να χρησιμοποιήσετε ένα μπλοκ <b>set</b> από την κατηγορία Μεταβλητές, το μπλοκ <b>Accelerometer</b> από την κατηγορία Αισθητήρες και να αλλάξετε τον άξονα σε <b>Y</b> χρησιμοποιώντας το αναπτυσσόμενο μενού.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-6": "Προσθέστε ένα μπλοκ <b>broadcast [μήνυμα 1]</b> και ορίστε το να μεταδίδει ένα <b>Νέο Μήνυμα</b> που ονομάζεται <i>ενημέρωση θέσης</i>.<br /><br />Θα το χρησιμοποιήσουμε ως σήμα για να μετακινήσουμε το sprite μας.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-7": "Προσθέστε ένα άλλο μπλοκ <b>broadcast [message1]</b> πριν από τον βρόχο forever και ορίστε το να μεταδίδει ένα <b>Νέο Μήνυμα</b> με το όνομα <i>start</i>.<br /><br />Θα το χρησιμοποιήσουμε για να βεβαιωθούμε ότι όλα θα επαναφερθούν στην αρχή ενός παιχνιδιού.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-9": "Προσθέστε το sprite <b>Penguin 2</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-10": "Με επιλεγμένο το sprite πιγκουίνος, προσθέστε ένα μπλοκ <b>όταν λαμβάνω [έναρξη]</b> από την κατηγορία Συμβάντα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-11": "Μεταβείτε στην κατηγορία Εμφανίσεις και προσθέστε ένα <b>ορισμένο μέγεθος σε [100]%</b> μπλοκ.<br /><br />Αλλάξτε το μέγεθος σε 20%.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-12": "Επιστρέψτε στην κατηγορία Συμβάντα και προσθέστε ένα μπλοκ <b>όταν λαμβάνω [ενημέρωση θέσης]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-13": "Μεταβείτε στην κατηγορία Κίνηση και προσθέστε ένα μπλοκ <b>μετάβαση στο x: [] y: []</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-14": "Αλλάξτε το ώστε να λέει <b>go to x: [[ay] x 200] y:0</b>.<br /><br />Θα χρειαστεί να χρησιμοποιήσετε ένα μπλοκ <b>πολλαπλασιασμού (*)</b> από την κατηγορία Τελεστές και τη μεταβλητή <b>ay</b> από την κατηγορία Μεταβλητές.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-15": "Δοκίμασέ το!<br /><br />Κάλυψε τον αριστερό αισθητήρα αντικειμένου για να ξεκινήσει το παιχνίδι και, στη συνέχεια, γείρε το Cog αριστερά και δεξιά για να μετακινήσεις τον πιγκουίνο αριστερά και δεξιά.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-16": "Ας προσθέσουμε μερικά εμπόδια!<br /><br />Προσθέστε το sprite <b>Tree1</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-17": "Με επιλεγμένο το sprite Δέντρο, προσθέστε ένα μπλοκ <b>όταν λαμβάνω [έναρξη]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-19": "Προσθέστε έναν βρόχο <b>για πάντα</b> από την κατηγορία Έλεγχος.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-20": "Μέσα στον βρόχο forever, προσθέστε ένα μπλοκ <b>create clone of [myself]</b>.<br /><br />Ένας κλώνος είναι ένα πανομοιότυπο αντίγραφο κάποιου πράγματος.<br /><br />Σε αυτήν την περίπτωση, το μπλοκ create clone θα δημιουργήσει ένα αντίγραφο του sprite δέντρου και όλου του κώδικα που συνδέεται με αυτό.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-21": "Μετά από αυτό το μπλοκ, προσθέστε ένα μπλοκ <b>αναμονής [1] δευτερολέπτου</b>.<br /><br />Αυτό σημαίνει ότι ένα νέο δέντρο θα δημιουργείται κάθε 1 δευτερόλεπτο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-23": "Προσθέστε ένα μπλοκ <b>μετάβαση σε x: [επιλογή τυχαίας [-240] σε [240] y: [-200]</b>.<br /><br />Μπορείτε να βρείτε το μπλοκ <b>επιλογή τυχαίας</b> στην κατηγορία Τελεστές.<br /><br />Αυτό θα κάνει το νέο κλώνο του δέντρου να ξεκινά από ένα τυχαίο σημείο στο κάτω μέρος της οθόνης.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-24": "Προσθέστε ένα <b>glide [1] δευτ. στο μπλοκ: x[] y:[]</b>.<br /><br />Τα μπλοκ ολίσθησης κάνουν μια ομαλή κίνηση σε ένα συγκεκριμένο χρονικό διάστημα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-26": "Πριν από το μπλοκ ολίσθησης, προσθέστε ένα μπλοκ <b>εμφάνιση</b> από την κατηγορία Εμφανίσεις.<br /><br />Το κλώνο θα ξεκινήσει να είναι κρυφό, καθώς το sprite από το οποίο αντιγράφηκε ήταν κρυφό, επομένως θα πρέπει να το εμφανίσουμε πριν ξεκινήσουμε να το μετακινούμε.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-28": "Δοκιμάστε το!<br /><br />Ένα νέο δέντρο θα εμφανίζεται κάθε δευτερόλεπτο και θα κινείται προς τα πάνω στην οθόνη.<br /><br />Για να σταματήσετε το πρόγραμμα, πατήστε το κόκκινο σύμβολο Stop.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-30": "Προσθέστε ένα μπλοκ <b>if [] then</b> μέσα στον βρόχο forever.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-32": "Μέσα στη συνθήκη if, προσθέστε ένα μπλοκ <b>stop [all]</b>.<br /><br />Αυτό θα ολοκληρώσει το παιχνίδι εάν ο πιγκουίνος χτυπήσει σε ένα δέντρο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-33": "Δοκίμασέ το!<br /><br />Κάλυψε τον αριστερό αισθητήρα αντικειμένου για να ξεκινήσει το παιχνίδι και γείρε το Cog για να κατευθύνεις τον πιγκουίνο ώστε να αποφύγει τα δέντρα.<br /><br />Όταν αγγίξεις ένα δέντρο, το παιχνίδι θα τελειώσει!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-34": "Ας προσθέσουμε μια βαθμολογία!<br /><br />Δημιουργήστε μια άλλη μεταβλητή που ονομάζεται <b>βαθμολογία</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-35": "Με το sprite Δέντρο ακόμα επιλεγμένο, προσθέστε ένα μπλοκ <b>set [score] σε [0]</b> μετά το μπλοκ <b>when I receive [start]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-36": "Και προσθέστε ένα μπλοκ <b>αλλαγή [βαθμολογία] κατά [1]</b> μεταξύ της ολίσθησης και διαγράψτε αυτά τα μπλοκ κλώνου.<br /><br />Αυτό θα αυξήσει τη βαθμολογία κατά 1 για κάθε δέντρο που αποφεύγουμε με επιτυχία.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-38": "Πρόσθεσε αυτά τα μπλοκ μαζί με τα άλλα για το αντικείμενο Δέντρο.<br /><br />Όταν ξεκινήσει το παιχνίδι, η καθυστέρηση θα οριστεί σε 1.<br /><br />Στη συνέχεια, κάθε 5 δευτερόλεπτα η καθυστέρηση θα οριστεί στα ¾ (τρία τέταρτα) από ό,τι ήταν πριν.<br /><br />Θα πάει από 1 δευτερόλεπτο σε 0,75 δευτερόλεπτα (τρία τέταρτα του δευτερολέπτου), σε 0,56 (λίγο πάνω από μισό δευτερόλεπτο), σε 0,42, σε 0,3 δευτερόλεπτα, και ούτω καθεξής!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-39": "Τώρα χρησιμοποιήστε τη μεταβλητή καθυστέρησης για να ορίσετε τον χρόνο μεταξύ των δέντρων που δημιουργούνται.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-40": "Δοκιμάστε το!<br /><br />Θα παρατηρήσετε ότι τα δέντρα αρχίζουν να εμφανίζονται πολύ πιο γρήγορα όσο πιο μακριά προχωράτε!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-41": "Ας προσθέσουμε μερικά φώτα στο Cog για να κάνουμε τα πράγματα πιο συναρπαστικά.<br /><br />Προσθέστε ένα μπλοκ <b>broadcast [stop] and wait</b> πριν από το μπλοκ <b>stop [all]</b>.<br /><br />Θα χρειαστεί να δημιουργήσετε ένα Νέο Μήνυμα με το όνομα <b>stop</b>.<br /><br />Το μπλοκ <b>broadcast [stop] and wait</b> θα διασφαλίσει ότι όποιος κώδικας εκτελείται όταν αποστέλλεται το μήνυμα διακοπής θα ολοκληρωθεί πριν συνεχιστεί ο κώδικας και εκτελεστεί το μπλοκ <b>stop [all]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-42": "Επιλέξτε Γρανάζι.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-43": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-44": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-45": "Μπράβο!<br /><br />Μάθατε πώς να φτιάχνετε ένα παιχνίδι στο Blocks! Χρησιμοποιήσαμε τη λειτουργία κλωνοποίησης για να φτιάξουμε πολλά αντίγραφα δέντρων που πρέπει να αποφεύγετε και κάναμε τον Cog να ελέγχει έναν χαρακτήρα στην οθόνη.<br /><br />Επόμενα βήματα:<ul><li>Μπορείτε να φτιάξετε ένα άλλο είδος εμποδίου που πρέπει να αποφεύγετε - ίσως βράχους;</li><li>Μπορείτε να κάνετε τον πιγκουίνο να πηδήξει όταν πατάτε το κουμπί στο Cog;</li><li>Μπορείτε να το κάνετε έτσι ώστε να μπορείτε να πηδάτε πάνω από τα εμπόδια από βράχους για να κερδίζετε επιπλέον πόντους;</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.description": "Ας μετατρέψουμε το Cog σε μουσικό όργανο!<br /><br />Θα κάνουμε το Cog να παίζει νότες που αλλάζουν ανάλογα με τον τρόπο που αλληλεπιδράτε με αυτό και θα μάθουμε για τα μουσικά κλειδιά.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-1": "Ας μετατρέψουμε το Cog σε μουσικό όργανο!<br /><br />Θα κάνουμε το Cog να παίζει νότες που αλλάζουν ανάλογα με τον τρόπο που αλληλεπιδράτε με αυτό και θα μάθουμε για τα μουσικά κλειδιά.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-7": "Θα χρησιμοποιήσουμε τον σωστό αισθητήρα υπερύθρων για να επιλέξουμε ποια νότα θα παίξουμε. Ας τραβήξουμε μια στιγμιότυπο δημιουργώντας μια μεταβλητή που ονομάζεται <b>reading</b> και ορίζοντας την τιμή του σωστού αισθητήρα υπερύθρων.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-8": "Τώρα πρέπει να χρησιμοποιήσουμε υποθετικές εκφράσεις για να επιλέξουμε ποια νότα θα παίξουμε.<br /><br />Θέλουμε να παίξουμε μόνο μία νότα, επομένως θα χρησιμοποιήσουμε το μπλοκ <b>αν … αλλιώς</b>.<br /><br />Για τη συνθήκη, προσθέστε έναν συγκριτή <b>μικρότερο από</b> (<) και ορίστε τον σε <b>ανάγνωση <b>[2100]</b>. Αντί για 2100, ορίστε αυτόν τον αριθμό σε αυτόν που μετρήσατε όταν το χέρι σας βρισκόταν στη γραμμή των 4 cm.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-9": "Προσθέστε ένα μπλοκ <b>Έναρξη νότας [C4]</b> μέσα στο τμήμα if του μπλοκ if … else.<br /><br />Αυτή είναι η χαμηλότερη νότα που θα βγάλουμε και θα την βγάλουμε όταν η ένδειξη από τον αισθητήρα IR είναι χαμηλή - δηλαδή το χέρι σας είναι μακριά από αυτόν.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-11": "Ας κωδικοποιήσουμε περισσότερες σημειώσεις!<br /><br />Θα προσθέσουμε ένα ακόμη μπλοκ <b>if … else</b> μέσα στο τμήμα else του πρώτου.<br /><br />Η τοποθέτηση υποθετικών όρων ο ένας μέσα στον άλλο με αυτόν τον τρόπο ονομάζεται ένθεση.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-12": "Ορίστε τη συνθήκη του μπλοκ δεύτερου if … else ώστε να λέει <b>[ανάγνωση] <2200</b>, αλλά αντί για 2200 χρησιμοποιήστε τον αριθμό που μετρήσατε με το χέρι σας στη γραμμή των 3 cm.<br /><br />Προσθέστε ένα άλλο μπλοκ <b>Έναρξη νότας</b> μέσα στο μέρος if της δεύτερης συνθήκης και ορίστε το να παίζει τη νότα <b>D4</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-13": "Κάντε το αυτό δύο φορές ακόμα, ώστε να καταλήξετε με τέσσερα μπλοκ if… else.<br /><br />Μπορείτε να το κάνετε αυτό πιο γρήγορα αν κάνετε δεξί κλικ ή πατήσετε παρατεταμένα το τελευταίο μπλοκ if… else και επιλέξετε την επιλογή <b>Αντίγραφο</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-14": "Για την τρίτη υπό όρους, ορίστε τον αριθμό που μετρήσατε στο σημάδι των 2 cm.<br /><br />Για την τέταρτη υπό όρους, ορίστε τον αριθμό που μετρήσατε στο σημάδι του 1 cm.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-15": "Αλλάξτε την τρίτη νότα σε <b>E4</b>.<br /><br />Αλλάξτε την τέταρτη νότα σε <b>G4</b>.<br /><br />Ίσως παρατηρήσετε ότι παραλείψαμε μια νότα! Θα παίξουμε μόνο πέντε νότες και τις επιλέγουμε από κάτι που ονομάζεται πεντατονική κλίμακα Ντο.<br /><br />Πεντατονική σημαίνει ότι έχει 5 νότες ανά οκτάβα και Ντο είναι η μουσική κλίμακα. Μια κλίμακα σας λέει για τις δίεση και την ύφεση που χρησιμοποιούνται σε ένα τραγούδι - είναι οι μαύρες νότες σε ένα πιάνο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-16": "Τώρα είναι η ώρα για την πέμπτη νότα.<br /><br />Δεν χρειάζεται να χρησιμοποιήσετε άλλο μπλοκ if … else, καθώς αυτή είναι η μόνη επιλογή που απομένει!<br /><br />Προσθέστε ένα μπλοκ <b>Έναρξη νότας [A4]</b> στο μέρος else της τελευταίας συνθήκης if … else.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-17": "Δοκίμασέ το!<br /><br />Μπορείς να κάνεις τον Cog να κάνει και τις 5 νότες;<br /><br />Μπορείς να αλλάξεις λίγο τους αριθμούς αν θέλεις να κάνεις οποιεσδήποτε προσαρμογές.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-18": "Ας κάνουμε το Cog να σταματά να παίζει τη νότα όταν σταματάτε να πατάτε το κουμπί.<br /><br />Μετά από όλα τα μπλοκ if .. else, προσθέστε ένα μπλοκ <b>wait until [[button clicked] = [False]]</b> και ένα μπλοκ <b>Stop sounds</b>.<br /><br />Θα πρέπει να αναζητήσετε στην κατηγορία Control το μπλοκ wait until, στην κατηγορία Operators το μπλοκ =, στην κατηγορία Sensing για το μπλοκ button clicked και στην κατηγορία Sounds για το μπλοκ Stop sounds.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-19": "Δοκιμάστε το ξανά!<br /><br />Τώρα το Cog θα σταματήσει να παίζει τη νότα όταν σταματήσετε να πατάτε το κουμπί.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-20": "Θα ήταν διασκεδαστικό αν μπορούσατε να αλλάζετε νότα ενώ κρατάτε πατημένο το κουμπί.<br /><br />Βάλτε ένα μπλοκ <b>επανάληψη μέχρι</b> γύρω από όλο τον κώδικα αμέσως μετά το μπλοκ με το πάτημα του κουμπιού.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-21": "Ορίστε τη συνθήκη στο μπλοκ επανάληψης μέχρι να είναι <b>[[κουμπί κλικ] = False]</b>.<br /><br />Μετακινήστε το μπλοκ <b>Ήχοι διακοπής</b> εκτός του βρόχου επανάληψης μέχρι και αντικαταστήστε το μπλοκ <b>αναμονή μέχρι</b> με ένα μπλοκ <b>αναμονή [0,1] δευτερολέπτων</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-22": "Δοκιμάστε το!<br /><br />Πιάστε το Cog και κινήστε το χέρι σας μπρος-πίσω μπροστά από τον αισθητήρα ενώ έχετε πατημένο το κουμπί - θα πρέπει να ακούσετε τη νότα να ανεβαίνει και να κατεβαίνει!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-23": "Έχουμε κάνει το Cog να παίζει νότες στην κλίμακα του Ντο, οπότε θα πρέπει να μπορούμε να παίζουμε μαζί με οποιοδήποτε τραγούδι είναι επίσης στην κλίμακα του Ντο!<br /><br />Για παράδειγμα, δοκιμάστε να παίξετε μαζί με το \"Let it Be\" των Beatles.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-25": "Αντικαταστήστε κάθε ένα από τα μπλοκ <b>Έναρξη νότας</b> με ένα μπλοκ <b>που ορίζει το [note] σε [notec4]</b>.<br /><br />Θα χρειαστεί να πληκτρολογήσετε <b>notec4</b> ακριβώς έτσι για να λειτουργήσει αυτό. Για τις άλλες νότες θα χρησιμοποιήσετε <b>noted4</b>, <b>notee4</b>, <b>noteg4</b> και <b>notea4</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-28": "Δοκιμάστε το!<br /><br />Τώρα, όταν κινείτε το χέρι σας, η νότα θα πρέπει να αλλάζει πιο γρήγορα!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-30": "Πώς αλλιώς θα μπορούσατε να αλλάξετε τη νότα;<br /><br />Τι θα λέγατε να χρησιμοποιήσετε τον τρόπο με τον οποίο είναι κεκλιμένο το Cog; Τότε θα μπορούσατε να αλλάξετε τη νότα απλώς περιστρέφοντας το Cog αριστερά και δεξιά!<br /><br />Μπορείτε να τροποποιήσετε τον κώδικά σας για να το δοκιμάσετε - ακολουθούν μερικές συμβουλές για το πώς να το κάνετε αυτό:",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.name": "Ρολόι",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.description": "Ας μετατρέψουμε το Cog σε ρολόι!<br /><br />Υπάρχουν 12 LED στο δακτύλιο του Cog, ώστε να μπορούμε να χρησιμοποιήσουμε πράγματα όπως αυτούς τους δείκτες σε ένα ρολόι για να υποδεικνύουμε ώρες, λεπτά και δευτερόλεπτα!<br /><br />Θα σκεφτούμε λίγο τα μαθηματικά που χρειάζονται και θα γίνουμε δημιουργικοί με διαφορετικούς τρόπους για να δείξουμε την ώρα!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-1": "Ας μετατρέψουμε το Cog σε ρολόι!<br /><br />Υπάρχουν 12 LED στο δακτύλιο του Cog, ώστε να μπορούμε να χρησιμοποιήσουμε πράγματα όπως αυτούς τους δείκτες σε ένα ρολόι για να υποδεικνύουμε ώρες, λεπτά και δευτερόλεπτα!<br /><br />Θα σκεφτούμε λίγο τα μαθηματικά που χρειάζονται και θα γίνουμε δημιουργικοί με διαφορετικούς τρόπους για να δείξουμε την ώρα!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-2": "Προσθέστε τα ακόλουθα μπλοκ στον κώδικά σας:<br /><br /><b>όταν κάνετε κλικ στην πράσινη σημαία</b><ul><li>σβήστε όλα τα LED</li><li>ορίστε το LED [1] σε [κόκκινο]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-4": "Η διεπαφή Blocks, όπως και οι περισσότεροι υπολογιστές, χρησιμοποιεί ρολόι 24 ωρών.<br /><br />Αν είναι πρωί, η τρέχουσα ώρα θα είναι μεταξύ 0 και 11.<br /><br />Αν είναι απόγευμα, η τρέχουσα ώρα θα είναι μεταξύ 12 και 23.<br /><br />Τα κανονικά αναλογικά ρολόγια χρησιμοποιούν ρολόι 12 ωρών, όπου υπάρχουν δύο τμήματα 12 ωρών (πμ και μμ) σε μια 24ωρη ημέρα.<br /><br />Το Cog έχει 12 LED στο δακτύλιο, επομένως θα χρησιμοποιήσουμε και εμείς ρολόι 12 ωρών. Πώς μπορούμε να αλλάξουμε τον αριθμό στη διεπαφή Blocks από ένα ρολόι 24 ωρών σε ένα ρολόι 12 ωρών;<br /><br />Θα μπορούσαμε να ελέγξουμε αν η ώρα είναι μεγαλύτερη από 11 και, αν ναι, να αφαιρέσουμε 12.<br /><br />Ή θα μπορούσαμε να χρησιμοποιήσουμε τον τελεστή modulus, ο οποίος σας δίνει το υπόλοιπο αφού κάνετε μια διαίρεση.<br /><br />Έτσι, εδώ, αν διαιρέσουμε το 17 με το 12, παίρνουμε την απάντηση 1 με υπόλοιπο 5 (ή 1r5). 17:00 στο ρολόι 24 ωρών είναι 5:00 μ.μ. στο ρολόι 12 ωρών, οπότε αυτό επιβεβαιώνεται!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-5": "Τοποθετήστε το <b>[[τρέχον [ώρα]] mod [12]]</b> ως αναγνωριστικό LED στο μπλοκ <b>set LED</b>.<br /><br />Δοκιμάστε να εκτελέσετε τον κώδικα πατώντας την πράσινη σημαία - το Cog θα εμφανίσει ένα μόνο κόκκινο φως που δείχνει πού θα βρίσκεται ο ωροδείκτης σε ένα ρολόι!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-6": "Πιθανότατα θέλουμε να εμφανίζουμε κάτι περισσότερο από την ώρα στο ρολόι μας, οπότε ας δούμε πώς να εμφανίζουμε και τα λεπτά.<br /><br />Το μπλοκ <b>τρέχον [λεπτό]</b> θα σας δώσει το λεπτό ως αριθμό μεταξύ 0 και 59!<br /><br />Σύρετε το στην περιοχή κώδικα και κάντε κλικ σε αυτό για να δείτε το τρέχον λεπτό.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-7": "Υπάρχει όμως ένα άλλο πρόβλημα: πρέπει να δείξουμε 60 λεπτά μόνο σε 12 LED!<br /><br />Σε ένα ρολόι, ο λεπτοδείκτης κάνει μία περιστροφή κάθε ώρα, ξεκινώντας από τη θέση 12 η ώρα. Όταν η ώρα είναι 30 λεπτά μετά την ώρα, ο λεπτοδείκτης βρίσκεται στη θέση 6 η ώρα, στα μισά της περιστροφής.<br /><br />Τα LED στο Cog είναι αριθμημένα όπως οι ενδείξεις ώρας σε ένα ρολόι. Ο λεπτοδείκτης μετακινείται 5 λεπτά μεταξύ κάθε αριθμού σε ένα ρολόι. Αυτό έχει νόημα επειδή 60 λεπτά / 12 αριθμοί = 5 λεπτά ανά αριθμό.<br /><br />Έτσι, αν χρησιμοποιήσουμε τον τελεστή διαίρεσης για να διαιρέσουμε το <b>τρέχον [λεπτό]</b> με το 5, θα γνωρίζουμε ποιο LED πρέπει να ανάψουμε για να δείξει τον λεπτοδείκτη στο ρολόι μας.<br /><br />Υπάρχει όμως ένα ακόμη πρόβλημα - η απλή διαίρεση του λεπτού με το 5 κανονικά δεν θα δώσει ακέραιο αριθμό και πρέπει να καθορίσουμε το LED ως ακέραιο αριθμό (ή ακέραιο).<br /><br />Για να πάμε από τον αριθμό με υποδιαστολή σε ακέραιο αριθμό, πρέπει να τον στρογγυλοποιήσουμε. Αν είναι απλώς στρογγυλοποιημένος, τότε τα μπλοκ θα στρογγυλοποιηθούν είτε προς τα πάνω είτε προς τα κάτω, ανάλογα με το αν το κλάσμα είναι κάτω από 0,5 ή 0,5 ή πάνω.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-8": "Για το ρολόι μας, ωστόσο, δεν θέλουμε ο λεπτοδείκτης να μετακινηθεί στην επόμενη θέση μέχρι να βρίσκεται πλήρως εκεί. Για παράδειγμα, στις 5:09 μ.μ., θα θέλαμε ακόμα ο λεπτοδείκτης να βρίσκεται στη θέση \"1\".<br /><br />Για να το κάνουμε αυτό, θα πρέπει πάντα να στρογγυλοποιούμε προς τα κάτω. Υπάρχει ένας τρόπος να το κάνουμε αυτό στα Μπλοκ - χρησιμοποιώντας τον τελεστή <b>floor</b>. Μπορείτε να τον βρείτε στον τελεστή που λέει <b>[abs]</b> από προεπιλογή, στην αναπτυσσόμενη λίστα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-9": "Προσθέστε ένα μπλοκ για να <b>ορίσετε το LED [[δάπεδο] του [[τρέχον [λεπτό]] / [5]] σε [μπλε]</b>.<br /><br />Δοκιμάστε το! Πατήστε την πράσινη σημαία και τώρα το Cog θα εμφανίσει τον λεπτοδείκτη ως μπλε φως, καθώς και τον ωροδείκτη ως κόκκινο φως.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-10": "Πώς θα εμφανίζατε και τα δευτερόλεπτα;<br /><br />Προσθέστε ένα άλλο μπλοκ <b>Ορισμός LED</b> αλλά αυτή τη φορά ορίστε το ως LED <b>[[όροφος] του [[τρέχοντος [δευτερόλεπτου]] / [5]] σε [πράσινο]</b>.<br /><br />Θυμηθείτε ότι μπορείτε να κάνετε δεξί κλικ ή να πατήσετε παρατεταμένα ένα μπλοκ για να έχετε την επιλογή να το αντιγράψετε - αυτό μπορεί να σας εξοικονομήσει πολύ χρόνο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-11": "Δοκιμάστε το!<br /><br />Τώρα θα έχετε τρεις «δείκτες» στο ρολόι - κόκκινο για τις ώρες, μπλε για τα λεπτά και πράσινο για τα δευτερόλεπτα!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-12": "Ας το κάνουμε έτσι ώστε η ώρα να ενημερώνεται αυτόματα. Προσθέστε έναν βρόχο <b>για πάντα</b> και ένα μπλοκ <b>αναμονής [5] δευτερολέπτων</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-14": "Είναι λίγο μπερδεμένο αν τα διαφορετικά χέρια βρίσκονται στο ίδιο σημείο, δοκιμάστε να προσθέσετε μια μικρή παύση μεταξύ κάθε LED και να αλλάξετε την παύση στο τέλος σε μόνο 3 δευτερόλεπτα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-15": "Δοκιμάστε το!<br /><br />Τώρα θα εμφανίζει τις ώρες, τα λεπτά και τα δευτερόλεπτα ένα κάθε φορά.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-16": "Θα ήταν ωραίο να μπορούσαμε να δείξουμε αν ήταν πμ ή μμ.<br /><br />Θα μπορούσαμε να το κάνουμε αυτό αλλάζοντας το χρώμα φόντου του ρολογιού ανάλογα με το αν η ώρα είναι μικρότερη από 12.<br /><br />Αντικαταστήστε το μπλοκ <b>Απενεργοποίηση όλων των LED</b> με ένα μπλοκ <b>αν... αλλιώς</b> που ελέγχει αν η τρέχουσα ώρα είναι < 12.<br /><br />Στη συνέχεια, επιλέξτε δύο διαφορετικά χρώματα για να ρυθμίσετε τα LED δακτυλίου για μμ και πμ. Σε αυτό το παράδειγμα, έχουμε επιλέξει πορτοκαλί για πμ και μοβ για μμ - τα χρώματα πρέπει να είναι διαφορετικά από αυτά που χρησιμοποιείτε για να εμφανίσετε τους δείκτες στο ρολόι.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-19": "Αν έχετε φίλους που έχουν επίσης ένα Cog, μπορείτε να χρησιμοποιήσετε τρία από αυτά για να δείξετε την ώρα - ένα να δείχνει τις ώρες, ένα τα λεπτά και ένα τα δευτερόλεπτα, όπως αυτό;",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-24": "Οι λίστες είναι ειδικές μεταβλητές που μπορούν να περιέχουν μια ταξινομημένη λίστα μεμονωμένων μεταβλητών.<br /><br />Διαγράψτε τον προηγούμενο κώδικά σας και προσθέστε τα μπλοκ που φαίνονται στην εικόνα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-25": "Πατήστε την πράσινη σημαία για να εκτελέσετε τον κώδικα. Η λίστα <b>led</b> θα εισάγει 12 χρωματικούς κωδικούς - έναν για κάθε LED στο Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-26": "Δημιουργήστε δύο νέες μεταβλητές που ονομάζονται <b>ώρα</b> και <b>λεπτό</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-27": "Προσθέστε μπλοκ για να ορίσετε αυτές τις μεταβλητές στις θέσεις των δεικτών της ώρας και των λεπτών, χρησιμοποιώντας τα ίδια μαθηματικά που κάνατε πριν.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-28": "Τώρα θα αλλάξουμε τα στοιχεία στη λίστα για να ορίσουμε τα χρώματα για τους δείκτες της ώρας και των λεπτών.<br /><br />Το μπλοκ <b>αντικατάσταση στοιχείου</b> θα αλλάξει το στοιχείο στην καθορισμένη θέση στη λίστα. Δεδομένου ότι η λίστα αρχίζει να αριθμεί τα στοιχεία της από το 1, πρέπει να προσθέσουμε 1 στις μεταβλητές ώρας και λεπτών.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-32": "Δοκιμάστε το!<br /><br />Οι 12 κωδικοί χρωμάτων στη λίστα <b>led</b> θα εμφανίζονται ως χρώματα στο Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-34": "Στη συνέχεια, τοποθετήστε τον κώδικα σε έναν βρόχο <b>forever</b> έτσι ώστε να εκτελείται επανειλημμένα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-35": "Τώρα ήρθε η ώρα να προσθέσουμε το δεύτερο χέρι!<br /><br />Θα το κάνουμε αυτό σε μια παράλληλη ενότητα κώδικα, οπότε προσθέστε ένα άλλο μπλοκ <b>όταν γίνει κλικ στην πράσινη σημαία</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-36": "Δημιουργήστε μια άλλη μεταβλητή που ονομάζεται <b>δευτερόλεπτο</b> και ορίστε την με τον ίδιο τρόπο που ορίσαμε τη θέση του δευτερολεπτοδείκτη πριν.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-38": "Βάλτε και τον κώδικα από δεύτερο χέρι σε έναν <b>συνεχή</b> βρόχο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-39": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-1": "Σε προηγούμενες δραστηριότητες είδαμε πώς μπορούμε να χρησιμοποιήσουμε το επιταχυνσιόμετρο στο Cog για να μετρήσουμε την κατεύθυνση προς την οποία γέρνει το Cog.<br /><br />Μπορούμε επίσης να χρησιμοποιήσουμε αυτόν τον αισθητήρα για να υπολογίσουμε τη γωνία που σχηματίζει το Cog.<br /><br />Θα τον χρησιμοποιήσουμε για να μετατρέψουμε το Cog σε τροχό - μια συσκευή για τη μέτρηση αποστάσεων κυλώντας έναν τροχό κατά μήκος τους.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-2": "Προσθέστε ένα μπλοκ <b>όταν γίνει κλικ στην πράσινη σημαία</b> και έναν βρόχο <b>για πάντα</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-3": "Δημιουργήστε μια μεταβλητή που ονομάζεται <i>angle</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-4": "<b>Ορίστε</b> τη <b>γωνία</b> σε <b>atan2</b> των [Επιταχυνσιόμετρο [Y]] και [Επιταχυνσιόμετρο [X]].<br /><br />Μπορείτε να βρείτε το μπλοκ <b>atan2</b> στην κατηγορία τελεστών.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-5": "Η Atan2 είναι μια μαθηματική συνάρτηση που χρησιμοποιεί τριγωνομετρία για να υπολογίσει τη γωνία μέσα σε ένα ορθογώνιο τρίγωνο όταν δίνονται τα μήκη των γειτονικών και των απέναντι ποδιών.<br /><br />Εδώ, εισάγουμε την επιτάχυνση του άξονα Y και του άξονα X, οι οποίες είναι κάθετες μεταξύ τους (στις 90 μοίρες), και η συνάρτηση atan2 θα μας πει τη γωνία.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-6": "Δοκιμάστε το!<br /><br />Πατήστε την πράσινη σημαία και στη συνέχεια κρατήστε το Cog κάθετα με το κίτρινο βέλος προς τα πάνω και περιστρέψτε το σαν τιμόνι.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-8": "Για τον τροχό μας, θα προτιμούσαμε να μετράει από 0 έως 360 μοίρες.<br /><br />Προσθέστε αυτά τα μπλοκ μέσα στον <b>βρόχο αέναης μέτρησης</b>:<ul><li><b>Εάν</b> [[γωνία] < [0]] τότε</li><ul><li>Αλλάξτε τη [γωνία] κατά [360]</li></ul></ul><br />Τώρα, αντί για -180 μοίρες, η γωνία μας θα οριστεί σε +180 μοίρες.<br /><br />Θα συνεχίσει να αυξάνεται από εκεί έως τις 360 μοίρες και στη συνέχεια θα επανέλθει στις 0 μοίρες.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-9": "Δοκιμάστε το!<br /><br />Τώρα, όταν περιστρέφετε το γρανάζι, η γωνία θα αλλάζει από 0-360 και στη συνέχεια θα επαναλαμβάνεται.<br /><br />Αυτή η μαθηματική εξίσωση λειτουργεί επειδή οι 360 μοίρες είναι μια πλήρης περιστροφή, οπότε όταν προσθέτουμε επιπλέον 360 μοίρες στην περιστροφή, καταλήγουμε να δείχνουμε προς την ίδια κατεύθυνση, αλλά τώρα με μια θετική γωνία που θα είναι πιο εύκολο να αντιμετωπιστεί καθώς μετράμε τις περιστροφές.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-10": "Ας προσθέσουμε ένα sprite στην οθόνη για να εμφανίσουμε την περιστροφή του Cog.<br /><br />Από το μενού <i>Επιλογή Sprite</i> επιλέξτε την επιλογή <i>ζωγραφική</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-11": "Ας σχεδιάσουμε ένα sprite που να αντιπροσωπεύει το Cog!<br /><br />Ξεκινήστε προσθέτοντας έναν κύκλο και, στη συνέχεια, χρησιμοποιήστε το εργαλείο γραμμής για να φτιάξετε ένα εξάγωνο γύρω του.<br /><br />Ο κύκλος είναι απλώς ένας οδηγός που θα μας βοηθήσει να σχεδιάσουμε σωστά το εξάγωνο - μην ανησυχείτε αν το εξάγωνό σας δεν είναι τέλειο!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-12": "Διαγράψτε τον κύκλο και αντικαταστήστε τον με έναν μικρότερο κύκλο στη μέση για να αναπαραστήσετε το κουμπί στο Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-15": "Με επιλεγμένο το sprite, προσθέστε αυτά τα μπλοκ:<ul><li>Όταν γίνει κλικ στην πράσινη σημαία</li><li>Για πάντα</li><ul><li>Δείγμα προς την κατεύθυνση [γωνία]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-16": "Δοκίμασέ το!<br /><br />Πάτα την πράσινη σημαία και μετά περιστρέψτε το γρανάζι - θα δεις και το sprite να περιστρέφεται!<br /><br />Υπάρχει όμως ένα πρόβλημα - το sprite απέχει 90 μοίρες από το Cog - αυτό συμβαίνει επειδή η διεπαφή Blocks μετράει την κατεύθυνση προς τα αριστερά ως 0 μοίρες, ενώ εμείς αντιμετωπίζουμε την κατεύθυνση προς τα πάνω ως 0 μοίρες.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-19": "Ας προσθέσουμε μια λυχνία LED στο Cog για να δείξουμε ότι η ανίχνευση περιστροφής λειτουργεί.<br /><br />Προσθέστε 2 νέες μεταβλητές που ονομάζονται <i>LED</i> και <i>lastLED</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-20": "Η μεταβλητή γωνίας μας λέει μια περιστροφή από 0 έως 360 μοίρες, αλλά έχουμε μόνο 12 LED γύρω από τον δακτύλιο στο γρανάζι.<br /><br />Αυτό σημαίνει ότι η ανάλυση θα είναι 30 μοίρες ανά LED, αφού 360 μοίρες / 12 LED = 30 μοίρες / LED.<br /><br />Προσθέστε αυτά τα μπλοκ μέσα στον <b>βρόχο αέναης λειτουργίας</b>:<ul><li>Ορίστε το [LED] σε [[στρογγυλοποίηση [γωνία]/[30]] mod [12]]</li></ul><br />Διαιρούμε τη γωνία με το 30 για να λάβουμε έναν αριθμό μεταξύ 0 και 12 και στη συνέχεια τη στρογγυλοποιούμε, αφού χρειαζόμαστε έναν ακέραιο αριθμό (ή ακέραιο) για να καθορίσουμε ποιο LED θα ανάψουμε.<br /><br />Στη συνέχεια, επειδή τα LED μας αριθμούνται μόνο από 0 έως 11, χρησιμοποιούμε το μπλοκ mod όπως κάναμε στη δραστηριότητα ρολογιού. Αυτός είναι ο <i>τελεστής modulus</i> και επιστρέφει το υπόλοιπο όταν οι δύο αριθμοί διαιρεθούν - έτσι αντί να λάβουμε έναν αριθμό 12 για το αναγνωριστικό LED, θα λάβουμε ξανά ένα 0 - κάτι που θέλουμε επειδή το LED 0 βρίσκεται στη θέση 12 της ώρας στο γρανάζι.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-21": "Τώρα προσθέστε αυτά τα μπλοκ μέσα στον <b>βρόχο forever</b> επίσης:<ul><li>Εάν [όχι [[LED] = [lastLED]]] τότε</li><ul><li>Ορίστε το LED [LED] σε [μπλε]</li><li>Ορίστε το LED [lastLED] σε [μαύρο]</li><li>Ορίστε το [lastLED] σε [LED]</li></ul></ul><br />Μπορείτε να καταλάβετε πώς λειτουργεί αυτή η νέα ενότητα κώδικα και τι θα κάνει;<br /><br />Χρησιμοποιούμε τις μεταβλητές LED και lastLED για να παρακολουθούμε ποια LED είναι αναμμένη και αν χρειάζεται να την αλλάξουμε. Όταν η τιμή της LED αλλάζει από τη μία επανάληψη του βρόχου στην επόμενη, η συνθήκη στην πρόταση if θα είναι αληθής.<br /><br />Όταν συμβεί αυτό, ανάβουμε τη νέα LED και σβήνουμε την παλιά (ορίζοντάς την σε μαύρο, το οποίο είναι το ίδιο με το να είναι σβηστή για ένα φως). Τέλος, ενημερώνουμε τη μεταβλητή lastLED έτσι ώστε να οριστεί για την επόμενη φορά γύρω από τον βρόχο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-23": "Αν το καλοσκεφτείτε, αυτό συμβαίνει επειδή το LED περιστρέφεται δεξιόστροφα ταυτόχρονα με την περιστροφή του γραναζιού δεξιόστροφα.<br /><br />Αυτό που θέλουμε στην πραγματικότητα, για να βρίσκεται το LED πάντα στο κάτω μέρος του γραναζιού, είναι να περιστρέφεται προς την αντίθετη κατεύθυνση από αυτήν που περιστρέφουμε εμείς.<br /><br />Πώς θα μπορούσαμε να το κάνουμε αυτό να συμβεί;<br /><br />Αλλάξτε τον κώδικά σας έτσι ώστε να λέει <b>set [LED] to [[round [[360] - [angle]] / [30]] mod [12]]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-24": "Δοκιμάστε το!<br /><br />Τώρα, όταν περιστρέφετε το γρανάζι, το LED θα βρίσκεται πάντα στην κορυφή!<br /><br />Όταν αφαιρούμε τη μεταβλητή [γωνία] από τις 360 μοίρες, αυτό που ουσιαστικά κάνουμε είναι να αλλάξουμε την κατεύθυνση στην οποία περιστρέφουμε γύρω από τον κύκλο.<br /><br />Για παράδειγμα, αν περιστρέψουμε 10 μοίρες δεξιόστροφα από το 0, θα βρισκόμαστε στις 10 μοίρες. Αν περιστρέψουμε 10 μοίρες αριστερόστροφα από το 0, θα βρισκόμαστε στις 350 μοίρες.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-28": "Σχεδιάστε γύρω από την πάνω επιφάνεια του οδοντωτού τροχού και, στη συνέχεια, κόψτε ένα εξάγωνο στη μέση του κύκλου.<br /><br />(δεν χρειάζεται να είστε τέλεια στη μέση)<br /><br />Μετρήστε τη διάμετρο του κύκλου σας.<br /><br />Αυτός εδώ έχει διάμετρο περίπου 200 mm, που σημαίνει ότι η ακτίνα είναι 100 mm.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-30": "Θα χρειαστούμε μερικές ακόμη μεταβλητές για να μας βοηθήσουν να υπολογίσουμε την διανυθείσα απόσταση.<br /><br />Δημιουργήστε αυτές τις νέες μεταβλητές:<ul><li>lastAngle - θα τη χρησιμοποιήσουμε για να παρακολουθήσουμε ποια ήταν η γωνία την τελευταία φορά γύρω από τον βρόχο forever, όπως κάναμε με τη μεταβλητή lastLED</li><li>revolutions - θα τη χρησιμοποιήσουμε για να παρακολουθούμε πόσες πλήρεις περιστροφές έχουν γίνει του τροχού</li><li>totalRotation - θα προσθέσουμε τις πλήρεις και μερικές περιστροφές για να βρούμε τη συνολική ποσότητα περιστροφής σε μοίρες</li><li>distance - θα μετατρέψουμε αυτήν τη συνολική περιστροφή σε απόσταση</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-32": "Πρέπει επίσης να παρακολουθούμε τις περιστροφές στην αντίθετη κατεύθυνση. Όταν συμβεί αυτό, η γωνία θα μεταπηδήσει από 0 σε 360 μοίρες.<br /><br />Προσθέστε αυτά τα μπλοκ μέσα στον <b>βρόχο αέναης περιστροφής</b>:<ul><li>Εάν [[γωνία] - [τελευταία Γωνία]] > [180]] τότε</li><ul><li>Αλλάξτε τις [περιστροφές] κατά [-1]</li></ul></ul><br />Αυτό σημαίνει ότι εάν η γωνία αυξηθεί πολύ ξαφνικά, θα μειώσουμε τον αριθμό των περιστροφών κατά 1.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-33": "Προσθέστε ένα μπλοκ <b>set [lastAngle] σε [angle]</b> μέσα στον <b>βρόχο για πάντα</b>.<br /><br />Αυτό θα προετοιμάσει τη μεταβλητή lastAngle για την επόμενη φορά στον βρόχο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-34": "Τώρα είναι η ώρα να υπολογίσετε την απόσταση που έχει κυλήσει ο τροχός!<br /><br />Προσθέστε αυτό το μπλοκ μέσα στον <b>βρόχο αέναης περιστροφής</b>:<ul><li>Ορίστε το [totalRotation] σε [[[περιστροφές] * [360]] + [[γωνία]]]</li></ul><br />Αυτό θα προσθέσει 360 μοίρες για κάθε περιστροφή στην τρέχουσα μέτρηση γωνίας, για να λάβετε τη συνολική περιστροφή.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-35": "Τώρα προσθέστε αυτό το μπλοκ:<ul><li>Ορίστε την [απόσταση] σε [[[συνολικήΠεριστροφή] / [360]] * [περιφέρεια]]</li></ul><br />Η μεταβλητή συνολικήΠεριστροφή δίνει τη συνολική περιστροφή σε μοίρες, επομένως διαιρώντας την με το 360 παίρνουμε τον αριθμό των περιστροφών ως ρητό αριθμό - έναν αριθμό που μπορεί να έχει στοιχεία μετά την υποδιαστολή αντί μόνο ακέραιους αριθμούς.<br /><br />Πολλαπλασιάζοντας αυτό με την περιφέρεια, μας λέει τη συνολική απόσταση που έχει κυλήσει ο τροχός!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-36": "Δοκιμάστε το!<br /><br />Βάλτε ένα γρανάζι μέσα στον χάρτινο τροχό και δοκιμάστε να τον κυλήσετε!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-37": "Θα ήταν υπέροχο να υπάρχει ένας τρόπος για να μηδενίζεται εύκολα ο μετρητής απόστασης.<br /><br />Προσθέστε αυτά τα μπλοκ:<ul><li>Με το πάτημα του κουμπιού</li><li>Ορίστε το [distance] σε [0]</li><li>Ορίστε το [revolutions] σε [0]</li><li>Ορίστε το [startingAngle] σε [angle]</li><li>Ορίστε το [lastAngle] σε [angle]</li></ul><br />Θα χρειαστεί να δημιουργήσετε μια νέα μεταβλητή που ονομάζεται <i>startingAngle</i>.<br /><br />Θα το χρησιμοποιήσουμε αυτό για να βεβαιωθούμε ότι μπορούμε να ξεκινήσουμε να μετράμε από οποιαδήποτε γωνία βρίσκεται το γρανάζι όταν πατάτε το κουμπί, όχι μόνο όταν το γρανάζι δείχνει προς τα πάνω.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-38": "Θα χρειαστεί να συνυπολογίσουμε την startingAngle στον υπολογισμό της συνολικής περιστροφής, αφαιρώντας την από την τρέχουσα γωνία.<br /><br />Αλλάξτε το μπλοκ που ορίζει τη μεταβλητή totalRotation σε:<ul><li>Ορίστε την [totalRotation] σε [[[revolutions] * [360]] + [[angle] - [startingAngle]]]</li></ul><br />Αυτό θα αφαιρέσει την αρχική γωνία από την τρέχουσα γωνία, έτσι ώστε να μπορέσουμε να ξεκινήσουμε την μέτρηση από οποιαδήποτε γωνία βρίσκεται το γρανάζι όταν πατάτε το κουμπί.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-39": "Δοκιμάστε το!<br /><br />Πάρτε έναν χάρακα και τοποθετήστε τον τροχό με το γρανάζι δίπλα του, στο σημάδι 0.<br /><br />Πατήστε το κουμπί για να επαναφέρετε το γρανάζι και, στη συνέχεια, περιστρέψτε τον τροχό κατά μήκος του χάρακα - θα πρέπει να διαπιστώσετε ότι η μεταβλητή απόστασης παρακολουθεί την απόσταση που έχετε κυλήσει.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-41": "Στη συνέχεια, προσθέστε ένα μπλοκ <b>προσθήκη [απόσταση] στο [αποστάσεις]</b> αμέσως μετά το μπλοκ πατήματος του κουμπιού ενεργοποίησης.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-42": "Δοκιμάστε το!<br /><br />Μπορείτε να μετρήσετε αποστάσεις και να πατήσετε το κουμπί για να τις καταγράψετε στη λίστα για να τις δείτε όταν επιστρέψετε στην οθόνη σας.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-43": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.name": "Παιχνίδι με ιπτάμενες νυχτερίδες",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.description": "Ας φτιάξουμε ένα άλλο παιχνίδι!<br /><br />Αυτή τη φορά θα φτιάξουμε ένα παιχνίδι για μια φρουτοφάγα νυχτερίδα που είναι αρκετά επιλεκτική με το τι τρώει.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-1": "Ας φτιάξουμε άλλο ένα παιχνίδι!<br /><br />Αυτή τη φορά θα φτιάξουμε ένα παιχνίδι για μια φρουτοφάγα νυχτερίδα που είναι αρκετά επιλεκτική με το τι τρώει.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-2": "Θα κάνουμε τη νυχτερίδα να πετάει αριστερά και δεξιά χρησιμοποιώντας ξανά τον αισθητήρα κλίσης στο γρανάζι.<br /><br />Όπως έχετε κάνει και πριν, δημιουργήστε μια μεταβλητή που ονομάζεται <b>ay</b>.<br /><br />Σε αυτό το παιχνίδι θα κρατάμε επίσης σκορ, οπότε δημιουργήστε και μια μεταβλητή που ονομάζεται <b>score</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-3": "Προσθέστε αυτά τα μπλοκ:<ul><li>Όταν κάνετε κλικ στην πράσινη σημαία</li><ul><li>Ορίστε το σκορ σε [0]</li><li>Για πάντα</li><ul><li>Ορίστε το [ay] σε [Επιταχυνσιόμετρο [Y]]</li><li>Μεταδώστε την [ενημέρωση θέσης]</li></ul></ul><br />Θα:<ul><li>Επιτρέψουν στον χρήστη να ξεκινήσει το παιχνίδι πατώντας την πράσινη σημαία</li><li>Επαναφέρουν το σκορ όταν ξεκινήσει το παιχνίδι</li><li>Ενημερώσουν τη μεταβλητή ay στην τιμή του άξονα Y του επιταχυνσιόμετρου σε έναν βρόχο και θα μεταδώσουν το μήνυμα ενημέρωσης θέσης</li></ul><br />Θα χρησιμοποιήσουμε τη μεταβλητή <b>ay</b> και το μήνυμα <b>ενημέρωση θέσης</b> για να αλλάξουμε τη θέση του sprite μας.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-5": "Με επιλεγμένο το sprite Bat, προσθέστε αυτά τα μπλοκ:<ul><li>Όταν λαμβάνω [update position]</li><ul><li>Ορίζω το x σε [[ay] * 200]</li></ul></ul><br />Αυτό σημαίνει ότι κάθε φορά που ενημερώνεται η μεταβλητή <b>ay</b>, θα μετακινούμε και τη θέση της νυχτερίδας.<br /><br />Η μεταβλητή ay θα κυμαίνεται κυρίως μεταξύ -1 και 1, επομένως πολλαπλασιάζοντας με το 200 θα ορίσουμε τη θέση x να είναι μεταξύ -200 και 200.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-7": "Ας κάνουμε το ρόπαλό μας λίγο μικρότερο και ας το κάνουμε να πέφτει στην οθόνη από προεπιλογή.<br /><br />Προσθέστε αυτά τα μπλοκ:<ul><li>Όταν κάνετε κλικ στην πράσινη σημαία</li><li>Ορίστε το μέγεθος σε [50]%</li><li>Για πάντα</li><ul><li>Αλλάξτε το y κατά [-10]</li><li>Περιμένετε [0,1] δευτερόλεπτα</li></ul></ul><br />Τώρα, όταν πατήσετε την πράσινη σημαία και εκτελέσετε το πρόγραμμα, το ρόπαλο θα πέσει αργά στην οθόνη!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-8": "Ας βρούμε έναν τρόπο για να χτυπήσει η νυχτερίδα τα φτερά της και να σκαρφαλώσει ξανά.<br /><br />Επιλέξτε ξανά το Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-15": "Ας προσθέσουμε και ένα πιο διασκεδαστικό φόντο - οι νυχτερίδες συχνά ζουν στο δάσος και τους αρέσει η νύχτα, οπότε ας προσθέσουμε ένα φόντο δάσους.<br /><br />Κάντε κλικ στο κουμπί <b>Επιλογή φόντου</b>.<br /><br />Στη συνέχεια, επιλέξτε το φόντο Δάσος.<br /><br />Τώρα μπορείτε να πετάξετε τη νυχτερίδα σας μέσα στο δάσος!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-16": "Εντάξει - ήρθε η ώρα να το κάνουμε αυτό περισσότερο παιχνίδι!<br /><br />Ας ξεκινήσουμε φτιάχνοντας μια λίστα αγορών για το ρόπαλό μας.<br /><br />Μεταβείτε στην κατηγορία <i>Μεταβλητές</i> και κάντε κλικ στο κουμπί <b>Δημιουργία λίστας</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-18": "Μπορούμε να προσθέσουμε πράγματα στη λίστα χρησιμοποιώντας τα νέα μπλοκ που έχουν εμφανιστεί στην ενότητα μεταβλητών.<br /><br />Πρώτα απ 'όλα, πρέπει να βεβαιωθούμε ότι η νυχτερίδα έχει μια κενή λίστα όταν ξεκινήσει το παιχνίδι.<br /><br />Προσθήκη αυτών των μπλοκ:<ul><li>Όταν γίνει κλικ στην πράσινη σημαία</li><li>Διαγραφή όλων των [φρούτων]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-20": "Κάντε το ίδιο ξανά για να προσθέσετε ένα <b>μήλο</b> στη λίστα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-23": "Βρείτε το <b>αντικείμενο [1] του μπλοκ [φρούτα]</b> και σύρετέ το στην περιοχή κωδικοποίησης.<br /><br />Εάν πατήσετε πάνω του, θα δείτε ότι επιστρέφει (εξάγει) το στοιχείο που βρίσκεται στην καθορισμένη θέση στη λίστα - σε αυτήν την περίπτωση μπανάνα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-24": "Βρείτε το <b>μήκος του μπλοκ [φρούτα]</b> και σύρετέ το στην περιοχή κωδικοποίησης.<br /><br />Αν πατήσετε πάνω του, θα δείτε ότι επιστρέφει τον αριθμό των στοιχείων στη λίστα - σε αυτήν την περίπτωση 2.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-26": "Πώς θα μπορούσαμε να κάνουμε τον κώδικα να επιλέγει ένα τυχαίο στοιχείο από τη λίστα;<br /><br />Χρησιμοποιήστε το μπλοκ <b>επιλογή τυχαίας</b> από την κατηγορία Τελεστές και ορίστε το να επιλέγει έναν τυχαίο αριθμό μεταξύ 1 και <b>μήκους [φρούτου]</b>. Στη συνέχεια, τοποθετήστε ολόκληρο το τυχαίο μπλοκ στο μπλοκ <b>αντικείμενο</b>, ως εξής:<br /><br />Όταν το πατήσετε, θα δείτε ότι επιλέγει τυχαία είτε μπανάνα είτε μήλο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-27": "Προσθέστε αυτά τα μπλοκ κάτω από το μπλοκ <b>προσθήκη [μήλου] σε [φρούτο]</b>:<ul><li>Επανάληψη [10]</li><ul><li>Ορίστε το [φρούτο] σε [αντικείμενο [επιλογή τυχαίας επιλογής [1] σε [μήκος [φρούτου]]] από [φρούτο]]</li><li>Μετάδοση [εμφάνιση φρούτων]</li><li>Σκεφτείτε [φρούτο] για [5] δευτερόλεπτα</li></ul></ul><br />Μπορείτε να βρείτε το μπλοκ σκέψης στην ενότητα Εμφανίσεις και να προσθέσετε τη μεταβλητή φρούτων σε αυτό.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-28": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-29": "Ας προσθέσουμε αυτά τα φρούτα στο παιχνίδι μας.<br /><br />Κάντε κλικ στο κουμπί <b>Επιλογή αντικειμένου</b> και επιλέξτε το αντικειμενικό αντικειμενικό Μπανάνες.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-30": "Σύρετε τις μπανάνες σε ένα καλύτερο σημείο στην οθόνη.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-32": "Αν η νυχτερίδα έχει φτάσει στις μπανάνες, θέλουμε να ελέγξουμε αν αυτό ήταν το φρούτο που ήθελε να πάρει.<br /><br />Προσθέστε μια συνθήκη <b>if … else</b> που να είναι ένθετη μέσα στο μπλοκ if και ορίστε τη συνθήκη σε <b>[fruit] = [banana]</b>, όπου fruit είναι η μεταβλητή που δημιουργήσατε προηγουμένως.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-33": "Αν το φρούτο είναι σωστό, θα αυξήσουμε τη βαθμολογία κατά 1 και θα στείλουμε το σωστό μήνυμα.<br /><br />Διαφορετικά, θα μειώσουμε τη βαθμολογία κατά 1 και θα στείλουμε το λανθασμένο μήνυμα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-34": "Για να αποφύγουμε να σκοράρουμε (ή να χάσουμε!) πόντους περισσότερες από μία φορές, θα κάνουμε τις μπανάνες να κρύβονται μόλις τις φτάσει η νυχτερίδα.<br /><br />Προσθέστε ένα μπλοκ <b>απόκρυψη</b> μετά το μπλοκ if… else - αυτό σημαίνει ότι οι μπανάνες θα κρύβονται πάντα όταν τις αγγίξει η νυχτερίδα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-35": "Εφόσον κρύβουμε τις μπανάνες, πρέπει να έχουμε έναν τρόπο να τις εμφανίζουμε ξανά.<br /><br />Προηγουμένως προσθέσαμε κώδικα για να στέλνουμε ένα μήνυμα <b>εμφάνιση φρούτων</b> κάθε φορά που η νυχτερίδα μαζεύει ένα νέο φρούτο. Θα το χρησιμοποιούμε ως σήμα για να εμφανίζουμε το φρούτο.<br /><br />Προσθέστε αυτά τα μπλοκ:<ul><li>Όταν λαμβάνω [εμφάνιση φρούτων]</li><li>Εμφάνιση</li></ul><br />Τώρα, όταν η νυχτερίδα μαζεύει ένα νέο φρούτο, οι μπανάνες θα εμφανιστούν ξανά.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-36": "Πρόσθεσε ένα ακόμη sprite - αυτή τη φορά το sprite της Apple.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-37": "Μετακίνησε το sprite μήλου ώστε να βρίσκεται στην άλλη πλευρά της σκηνής.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-39": "Με επιλεγμένο το sprite Apple, αλλάξτε τον κώδικα έτσι ώστε να ελέγχει αν η μεταβλητή fruit είναι ίση με <b>apple</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-41": "Ας προσθέσουμε μερικά σχόλια σχετικά με το αν παίρνετε το σωστό φρούτο.<br /><br />Επιλέξτε ξανά Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-42": "Προσθέστε αυτά τα μπλοκ:<ul><li>Όταν λαμβάνω [σωστό]</li><li>Ρυθμίστε τα LED [ring] σε [πράσινο]</li><li>Παίξτε νότα [C6] για [0,5] δευτερόλεπτα</li><li>Απενεργοποιήστε όλα τα LED</li></ul><br />Και<br /><br /><ul><li>Ρυθμίστε τα LED [ring] σε [κόκκινο]</li><li>Όταν λαμβάνω [λανθασμένο]</li><li>Παίξτε νότα [C4] για [0,5] δευτερόλεπτα</li><li>Απενεργοποιήστε όλα τα LED</li></ul><br />Αυτά θα χρησιμοποιήσουν τα σωστά και λανθασμένα μηνύματα που κωδικοποιήσατε προηγουμένως για τα φρούτα και θα κάνουν το Cog να ανάβει και να παίζει έναν ήχο κάθε φορά που συλλέγετε ένα φρούτο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-43": "Δοκίμασέ το!<br /><br />Τώρα θα λαμβάνεις σχόλια από τον Cog καθώς μαζεύεις φρούτα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-44": "Μπράβο!<br /><br />Μάθατε πώς να χρησιμοποιείτε στολές στο Blocks για να ζωντανεύετε sprites.<br /><br />Μάθατε επίσης πώς να φτιάχνετε μια λίστα και να επιλέγετε αντικείμενα από αυτήν, και να τα χρησιμοποιείτε ως μέρος ενός παιχνιδιού.<br /><br />Επόμενα βήματα:<ul><li>Μπορείτε να προσθέσετε περισσότερα φρούτα;</li><li>Μπορείτε να προσθέσετε κάτι που η νυχτερίδα δεν θέλει ποτέ να φάει;</li><li>Μπορείτε να κάνετε το παιχνίδι πιο δύσκολο καθώς περνάει ο χρόνος;</li><li>Μπορείτε να κάνετε τον Cog να εμφανίζει το σκορ στο τέλος;</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.name": "Χρονόμετρο με χρονόμετρο διαστήματος",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-2": "Ξεκινήστε δημιουργώντας μια λίστα με τίτλο <b>φορές</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-3": "Προσθέστε αυτά τα μπλοκ:<br /><ul><li>Με το πάτημα του κουμπιού</li><li>Προσθήκη <b>χρονοδιακόπτη</b> στις <b>φορές</b></li><li>Επαναφορά χρονοδιακόπτη</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-4": "Πατήστε το κουμπί στο γρανάζι - κάθε φορά που το πατάτε, θα προστίθεται μια νέα ώρα στη λίστα!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-5": "Υπάρχουν όμως μερικά προβλήματα. Η πρώτη φορά που προσθέσαμε ήταν λίγο τυχαία, καθώς δεν είχαμε ρυθμίσει πρώτα το χρονόμετρο.<br /><br />Επίσης, δεν έχουμε τρόπο να σταματήσουμε το χρονόμετρο και να διαγράψουμε τη λίστα με τους χρόνους γύρων.<br /><br />Ας το διορθώσουμε αυτό!<br /><br />Προσθέστε μια μεταβλητή που ονομάζεται <b>started</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-6": "Θα κάνουμε το γρανάζι να σταματάει την λειτουργία του χρονοδιακόπτη.<br /><br />Προσθέστε αυτά τα μπλοκ:<br /><ul><li>Σε κούνημα</li><li>Ορίστε το <b>started</b> σε <b>false</b></li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-7": "Τώρα ας αλλάξουμε τι κάνει το κουμπί με βάση την κατάσταση του χρονομέτρου - δηλαδή ανάλογα με το αν έχει ξεκινήσει ή όχι.<br /><br />Αλλάξτε τον κώδικα στο μπλοκ <b>με το πάτημα του κουμπιού</b> ώστε να είναι:<br /><ul><li>Με το πάτημα του κουμπιού</li><li>Εάν <b>ξεκίνησε</b> = <b>αληθές</b> τότε</li><ul><li>Προσθήκη του <b>χρονόμετρου</b> στις <b>φορές</b></li></ul><li>Διαφορετικά</li><ul><li>Διαγραφή όλων των <b>φορών</b></li></ul><li>Επαναφορά του χρονόμετρου</li></ul><br />Έτσι, εάν το χρονόμετρο έχει ξεκινήσει, τότε ο χρόνος γύρου θα προστεθεί στη λίστα. Εάν όχι, η λίστα των παλιών χρόνων θα διαγραφεί και θα είναι έτοιμη να ξεκινήσει μια νέα λίστα.<br /><br />Και στις δύο περιπτώσεις, ο χρονόμετρος θα μηδενιστεί, έτοιμος να καταγράψει τον χρόνο του επόμενου γύρου.<br /><br />Μπορείτε να εντοπίσετε τι λείπει από αυτόν τον κώδικα;",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-8": "Μπράβο αν παρατηρήσατε ότι πρέπει επίσης να ορίσουμε τη μεταβλητή <b>started</b> σε <b>true</b> μόλις ξεκινήσει το χρονόμετρο!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-10": "Αυτό λειτουργεί καλά ως χρονόμετρο!<br /><br />Αλλά είναι λίγο δύσκολο για τους χρήστες μας να γνωρίζουν σε ποια κατάσταση βρίσκεται το χρονόμετρο - έχει ξεκινήσει ή έχει σταματήσει;<br /><br />Ας προσθέσουμε κάποια σχόλια για αυτό.<br /><br />Στα μπλοκ <b>on shake</b>, κάτω από το μπλοκ <b>set started to false</b>, προσθέστε αυτά τα μπλοκ:<br /><ul><li>Απενεργοποίηση όλων των LED</li><li>Ρύθμιση των LED <b>button</b> σε <b>κόκκινο</b></li></ul><br />Τώρα, κάθε φορά που κουνάτε το γρανάζι για να το επαναφέρετε, θα σταματάει ό,τι έκαναν οι LED και απλώς θα ανάβει το κουμπί, δείχνοντας ότι έχει σταματήσει και είναι έτοιμο για εκκίνηση.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-11": "Πρέπει επίσης να προσθέσουμε ανατροφοδότηση για να δείχνουμε πότε το κουμπί πατιέται με επιτυχία και πότε το χρονόμετρο λειτουργεί.<br /><br />Στο τέλος των μπλοκ <b>με το πάτημα του κουμπιού</b>, προσθέστε αυτά τα μπλοκ:<br /><ul><li>Ρυθμίστε τα LED <b>δαχτυλιδιού</b> σε <b>πράσινο</b></li><li>Παίξτε νότα <b>C6</b> για <b>0,5</b> δευτερόλεπτα</li><li>Ρυθμίστε τα LED <b>δαχτυλιδιού</b> σε <b>μπλε</b></li><li>Ρυθμίστε τα LED <b>δαχτυλιδιού</b> σε μοτίβο <b>Spin1</b></li></ul><br />Τώρα, κάθε φορά που πατάτε το κουμπί, θα ακούτε έναν ήχο επιβεβαίωσης και η λυχνία θα αναβοσβήνει με πράσινο χρώμα, προτού αρχίσουν να περιστρέφονται με μπλε χρώμα για να υποδείξουν ότι το χρονόμετρο λειτουργεί.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-12": "Δοκιμάστε το!<br /><br />Είναι πολύ πιο εύκολο τώρα να δείτε αν το χρονόμετρο είναι σταματημένο ή ενεργοποιημένο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-13": "Μπορείτε όμως να εντοπίσετε το σφάλμα στον κώδικά μας;<br /><br />Τι συμβαίνει αν προσπαθήσετε να καταγράψετε χρόνους μικρότερους από 0,5 δευτερόλεπτα;<br /><br />Δεν θα μπορείτε - επειδή ο κώδικας από το προηγούμενο πάτημα κουμπιού θα εξακολουθεί να εκτελείται και να παίζει τη νότα.<br /><br />Πώς θα μπορούσαμε να το διορθώσουμε αυτό, ενώ παράλληλα θα παίζουμε τη νότα για 0,5 δευτερόλεπτα;",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-14": "Ένας τρόπος για να διορθώσετε αυτό το πρόβλημα είναι να χρησιμοποιήσετε το μπλοκ broadcast για να στείλετε ένα μήνυμα που θα ενεργοποιήσει τα φώτα και τον ήχο.<br /><br />Θυμάστε πώς το μπλοκ broadcast και wait δεν θα τελείωνε την εκτέλεση μέχρι να ολοκληρωθεί όλος ο κώδικας που ενεργοποίησε; Το μπλοκ broadcast δεν το κάνει αυτό, οπότε μόλις στείλει το μήνυμα κουμπιού, θα ολοκληρώσει την εκτέλεση.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-15": "Δοκιμάστε το!<br /><br />Είναι πολύ πιο εύκολο τώρα να δείτε αν το χρονόμετρο είναι σταματημένο ή ενεργοποιημένο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-17": "Θα υπολογίσουμε τον μέσο όρο αφού σταματήσουμε το χρονόμετρο κουνώντας το γρανάζι.<br /><br />Προσθέστε αυτά τα μπλοκ κάτω από το μπλοκ <b>Ρύθμιση των LED του κουμπιού σε κόκκινο</b>:<br /><ul><li>Ορίστε τον <b>μέσο όρο</b> σε 0</li><li>Ορίστε τον <b>μετρητή</b> σε 0</li></ul><br />Αυτό θα προετοιμάσει τις μεταβλητές μας για τον υπολογισμό του μέσου όρου.<br /><br />Σκεφτείτε τώρα πώς θα υπολογίζατε τον μέσο όρο μιας λίστας αριθμών;",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-19": "Θα χρησιμοποιήσουμε τη μεταβλητή μετρητή για να παρακολουθούμε πού βρισκόμαστε στη λίστα καθώς προσθέτουμε όλες τις φορές.<br /><br />Μέσα στον βρόχο επανάληψης, προσθέστε ένα μπλοκ για να <b>αλλάξετε τον μετρητή κατά 1</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-20": "Στα μπλοκ, το πρώτο στοιχείο της λίστας είναι το στοιχείο 1, επομένως την πρώτη φορά μέσω του βρόχου επανάληψης η μεταβλητή μετρητή θα αλλάξει από 0 σε 1. Τη δεύτερη φορά μέσω του βρόχου θα αλλάξει σε 2, κ.λπ.<br /><br />Στη συνέχεια, θα χρησιμοποιήσουμε αυτόν τον μετρητή για να αυξήσουμε τη μέση μεταβλητή κατά τον επόμενο αριθμό στη λίστα.<br /><br />Προσθέστε το μπλοκ <b>αλλαγή μέσου όρου κατά στοιχείο μετρητή φορών</b>.<br /><br />Όταν ολοκληρωθεί ο βρόχος επανάληψης, θα έχει επαναλάβει κάθε στοιχείο της λίστας και θα έχει προσθέσει κάθε αριθμό στη μέση μεταβλητή.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-21": "Εντάξει, όλα πάνε καλά, αλλά τώρα η μεταβλητή μέσου όρου αποθηκεύει στην πραγματικότητα το άθροισμα όλων των χρόνων μας.<br /><br />Για να λάβουμε τον μέσο όρο, θα πρέπει να τον διαιρέσουμε με τον αριθμό των στοιχείων στη λίστα.<br /><br />Προσθέστε ένα <b>ορισμένο μέσο όρο στο μπλοκ [average / counter]</b>.<br /><br />Η μεταβλητή counter έχει ρυθμιστεί αυτήν τη στιγμή να έχει μετρήσει πόσα στοιχεία υπήρχαν στη λίστα, επομένως μπορούμε να τη χρησιμοποιήσουμε ως διαιρέτη για να λάβουμε τον μέσο όρο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-22": "Δοκιμάστε το!<br /><br />Τώρα, όταν κουνάτε το γρανάζι, η μέση μεταβλητή θα οριστεί στον μέσο όρο όλων των φορών που καταγράψατε!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.name": "Παιχνίδι Κουίζ",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-1": "Ας φτιάξουμε ένα παιχνίδι κουίζ! <br/><br/>Θα δημιουργήσουμε μια λίστα με ερωτήσεις και απαντήσεις και θα χρησιμοποιήσουμε γρανάζια ως βομβητές για τους διαγωνιζόμενους. <br/><br/>Αυτή η δραστηριότητα χρησιμοποιεί πολλά γρανάζια συνδεδεμένα σε ένα πρόγραμμα. Εάν είναι δυνατόν, κάντε εναλλαγή για να μοιράζεστε γρανάζια μεταξύ μικρών ομάδων για να εκτελέσετε το πρόγραμμα. <br/><br/>Εάν έχετε πρόσβαση μόνο σε ένα γρανάζι, σκεφτείτε πώς θα μπορούσατε να αλλάξετε τον κώδικα για να χρησιμοποιήσετε και τους αισθητήρες υπερύθρων στο γρανάζι ως βομβητές, ώστε να επιτρέψετε σε τρία άτομα να παίζουν σε ένα γρανάζι.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-3": "Θα χρειαστεί να φτιάξουμε τρεις λίστες - μία για <i>ερωτήσεις</i>, μία για <i>απαντήσεις</i> και μία για την παρακολούθηση των <i>βαθμολογιών</i> των διαγωνιζόμενων. <br/><br/>Προσθέστε τρεις λίστες που ονομάζονται ερωτήσεις, απαντήσεις και βαθμολογίες.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-4": "Προσθέστε αυτά τα μπλοκ για να συμπληρώσετε τη λίστα ερωτήσεων. <br/><ul><li>Όταν κάνετε κλικ στην πράσινη σημαία</li><li>Διαγράψτε όλα τα [ερωτήσεις]</li><li>Προσθέστε το [Πόσο κάνει 2+2;] στις [ερωτήσεις]</li></ul>Συμπληρώστε όσες ερωτήσεις θέλετε προσθέτοντας περισσότερα μπλοκ <i>προσθέστε [] στις [ερωτήσεις]</i>. <br/><br/>Στη συνέχεια, κάντε το ίδιο για τις απαντήσεις, βεβαιώνοντας ότι οι ερωτήσεις σας ευθυγραμμίζονται με τις απαντήσεις σας.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-5": "Δοκιμάστε το πατώντας την πράσινη σημαία. <br/><br/>Οι λίστες ερωτήσεων και απαντήσεων θα συμπληρωθούν - αφιερώστε ένα λεπτό για να ελέγξετε ότι όλες οι απαντήσεις αντιστοιχούν στις σωστές ερωτήσεις. <br/><br/>Μόλις είστε ικανοποιημένοι, κάντε κλικ στα πλαίσια ελέγχου δίπλα στις λίστες απαντήσεων και ερωτήσεων για να τις αποκρύψετε.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-8": "Θα μπορούσαμε απλώς να προσθέσουμε ένα μπλοκ αναμονής πριν από τον βρόχο επανάληψης, αλλά αυτό δεν είναι πολύ εύκολο. <br/><br/>Θα μπορούσαμε επίσης να προσθέσουμε όλο τον κώδικα σε μια μεγάλη, μακρά ακολουθία, αλλά αυτό θα γίνει αρκετά δύσκολο στη διαχείριση. <br/><br/>Εναλλακτικά, μπορούμε να δημιουργήσουμε τα δικά μας μπλοκ και να βεβαιωθούμε ότι τα εκτελούμε με τη σειρά που θέλουμε. <br/><br/>Κάντε κλικ στο κουμπί \"Δημιουργία μπλοκ\".",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-10": "Ένα νέο μπλοκ θα εμφανιστεί στην παλέτα μπλοκ και στην περιοχή κωδικοποίησης θα δείτε ένα μπλοκ hat με τίτλο <i>define [fill in questions]</i>. <br/><br/>Όποιος κώδικας και αν βάλουμε κάτω από αυτό το μπλοκ θα εκτελείται κάθε φορά που καλούμε το μπλοκ <i>Fill in questions</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-11": "Αντικαταστήστε το μπλοκ <i>Όταν γίνεται κλικ στην πράσινη σημαία</i> με το νέο μπλοκ <i>ορισμός [Συμπλήρωση ερωτήσεων]</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-14": "Δοκιμάστε το - το sprite θα διαβάσει τις ερωτήσεις μία προς μία. <br/><br/>Ίσως χρειαστεί να μετακινήσετε το sprite στην κάτω αριστερή γωνία της οθόνης για να έχετε περισσότερο χώρο για τις ερωτήσεις.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-15": "Ας προσθέσουμε έναν τρόπο για να εισέλθουμε και να απαντήσουμε στην ερώτηση. <br/><br/>Επιλέξτε Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-17": "Προσθέστε αυτά τα μπλοκ: <ul><li>Όταν κάνετε κλικ στην πράσινη σημαία</li><li>Ορίστε το [αριθμός παίκτη] σε [1]</li></ul>Αργότερα, θα προσθέσουμε περισσότερα γρανάζια και θα ορίσουμε τους αριθμούς των παικτών τους διαφορετικά.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-18": "Θέλουμε να ενεργοποιήσουμε τα buzzer μόνο όταν έχει υποβληθεί μια ερώτηση, επομένως θα χρησιμοποιήσουμε το μήνυμα <i>answer now</i> που μεταδόθηκε όταν το sprite υπέβαλε μια ερώτηση. <br/><br/>Προσθέστε αυτά τα μπλοκ: <ul><li>Όταν λαμβάνω [answer now]</li><li>Ορίστε τα LED [ring] σε [μπλε]</li><li>Ορίστε τα LED [ring] σε μοτίβο [Spin1]</li><li>Περιμένετε μέχρι να γίνει κλικ στο [[[κουμπί] = [true]] ή στο [[buzzer] > [0]]]]</li></ul>Θα χρειαστεί να δημιουργήσετε μια νέα μεταβλητή που ονομάζεται <b>buzzer</b> - θα τη χρησιμοποιήσουμε για να παρακολουθούμε ποιο buzzer πατιέται πρώτο. <br/><br/>Μπορείτε να βρείτε το μπλοκ <i>or</i> στην κατηγορία Operators. <br/><br/>Η συνθήκη στο μπλοκ αναμονής μέχρι να ενεργοποιηθεί είναι είτε να έχει γίνει κλικ στο κουμπί είτε η μεταβλητή του βομβητή να είναι μεγαλύτερη από 0. <br/><br/>Με αυτόν τον τρόπο, μπορούμε να περιμένουμε μέχρι να πατηθεί είτε το κουμπί σε αυτό το γρανάζι είτε να πατηθεί ένας διαφορετικός βομβητής και η μεταβλητή του βομβητή να οριστεί αλλού.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-19": "Προσθέστε αυτά τα μπλοκ: <ul><li>Εάν [[κουμπί κλικ] = [αληθές]] τότε</li><ul><li>Ορίστε το [βομβητής] σε [αριθμός παίκτη]</li><li>Ορίστε τα LED [δακτύλιος] σε [πράσινο]</li></ul>Διαφορετικά</li><ul><li>Απενεργοποιήστε όλα τα LED</li></ul></ul>Με αυτόν τον κώδικα, εάν το κουμπί σε αυτό το γρανάζι ήταν αυτό που πατήθηκε πρώτο, θα ορίσουμε τη μεταβλητή <i>βομβητής</i> σε αυτόν τον <i>αριθμό παίκτη</i> και θα ανάψουμε τα φώτα στο πράσινο γρανάζι. <br/><br/>Διαφορετικά, αυτό θα σημαίνει ότι κάποιος άλλος έφτασε πρώτος ή ότι μας τελείωσε ο χρόνος και απλώς θα σβήσουμε τα φώτα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-20": "Επιστρέψτε στο sprite που προσθέσατε προηγουμένως.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-21": "Αλλάξτε τον κώδικα έτσι ώστε μέσα στον βρόχο επανάληψης για τις ερωτήσεις να λέει: <ul><li>Ορισμός [buzzer] σε [0]</li><li>Επαναφορά χρονοδιακόπτη</li><li>Πείτε [item [1] of [questions]</li><li>Μετάδοση [answer now]</li><li>Περιμένετε μέχρι [[[buzzer] > [0]] ή [[timer] > [10]]]</li><li>Διαγραφή [1] of [questions]</li><li>Διαγραφή [1] of [answers]</li></ul>Χρησιμοποιήσαμε μια άλλη <i>αναμονή μέχρι</i> με συνθήκη <i>ή</i>. <br/><br/>Τώρα, κάθε φορά που τίθεται μια ερώτηση, ο κώδικας θα περιμένει είτε να οριστεί η μεταβλητή του βομβητή είτε να περάσουν 10 δευτερόλεπτα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-23": "Στο μπλοκ <i>define [check answer]</i>, προσθέστε ένα μπλοκ <i>if … else</i> με τη συνθήκη <i>[buzzer] > [0]</i>. <br/><br/>Αυτό θα ελέγξει εάν ένα buzzer πατήθηκε εγκαίρως ή όχι.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-24": "Αν πατηθεί το βομβητή, θα δώσουμε στο άτομο που το πάτησε μερικά δευτερόλεπτα για να απαντήσει στην ερώτηση. <br/><br/>Προσθέστε αυτά τα μπλοκ μέσα στη συνθήκη if: <ul><li>Μετάδοση [buzzed]</li><li>Πείτε [join [Yes, player number] [buzzer]] για [6] δευτερόλεπτα</li></ul>Το μπλοκ <i>join</i> βρίσκεται στην κατηγορία Τελεστές και ενώνει δύο κομμάτια (ή συμβολοσειρές) κειμένου.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-25": "Προσθέστε και αυτά τα μπλοκ: <ul><li>Πείτε [join [join [Did you said] [item [1] of [answers]] [? Πατήστε πράσινο για ναι και κόκκινο για όχι]]</li><li>Μεταδώστε [confirm answer] και περιμένετε</li></ul>Θυμηθείτε πώς έχουμε προηγουμένως <i>ενθέσει συνθήκες if</i>, μπορείτε επίσης να <i>ενθέσετε τελεστές join</i> αν θέλετε να ενώσετε περισσότερες από δύο συμβολοσειρές κειμένου. <br/><br/>Έτσι, αφού δώσετε 6 δευτερόλεπτα στον παίκτη να πει την απάντησή του για να την ακούσουν οι άλλοι διαγωνιζόμενοι, το sprite θα τον ρωτήσει αν είπε τη σωστή απάντηση, που προέρχεται από τη λίστα απαντήσεων. Στη συνέχεια, θα του ζητήσει να πατήσει πράσινο για ναι και κόκκινο για όχι, να στείλει το μήνυμα <i>confirm answer</i> και να περιμένει πριν προχωρήσει.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-26": "Ας κάνουμε κάτι με το μήνυμα <i>επιβεβαίωση απάντησης</i>. <br/><br/>Επιλέξτε ξανά Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-27": "Προσθέστε αυτά τα μπλοκ: <ul><li>Όταν λάβω [επιβεβαίωση απάντησης]</li><li>Εάν [[βομβητής] = [αριθμός παίκτη] τότε</li></ul>. <br/><br/>Αργότερα θα έχουμε περισσότερα γρανάζια συνδεδεμένα και θα εκτελούν αυτόν τον κώδικα. Αυτή η συνθήκη if θα ελέγξει εάν αυτό το γρανάζι ήταν το επιτυχημένο βομβητή.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-28": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-29": "Προσθέστε αυτά τα μπλοκ: <ul><li>Περιμένετε μέχρι να είναι [[[ανιχνεύτηκε εμπόδιο [αριστερά]] = [αληθές]] ή [[ανιχνεύτηκε εμπόδιο [δεξιά]] = [αληθές]]]</li><li>Εάν είναι [[ανιχνεύτηκε εμπόδιο [δεξιά]] = [αληθές]] τότε</li></ul>Αντικαταστήστε το στοιχείο [αριθμός παίκτη] από [βαθμολογίες] με [[στοιχείο [1] από [βαθμολογίες]] + [1]]<br/><br/>Διαφορετικά<br/><ul><li>Αντικαταστήστε το στοιχείο [αριθμός παίκτη] από [βαθμολογίες] με [[στοιχείο [1] από [βαθμολογίες]] - [1]]</li></ul>Απενεργοποιήστε όλα τα LED. <br/><br/>Το μπλοκ <i>αναμονή μέχρι</i> θα περιμένει μέχρι ο αριστερός ή ο δεξιός αισθητήρας υπερύθρων να ανιχνεύσει ένα αντικείμενο - εδώ περιμένουμε τον παίκτη να επιλέξει αν έδωσε σωστή ή λάθος απάντηση. <br/><br/>Αν το έκαναν σωστά, θα έχουν καλύψει τον σωστό αισθητήρα υπερύθρων, αφού εκεί βάλαμε το πράσινο φως. <br/><br/>Αν ναι, θα αντικαταστήσουμε τη βαθμολογία τους στον πίνακα αποτελεσμάτων με τον ίδιο αριθμό συν 1. <br/><br/>Αν όχι, θα αντικαταστήσουμε τη βαθμολογία τους στον πίνακα αποτελεσμάτων με τον ίδιο αριθμό μείον 1. <br/><br/>Με αυτόν τον τρόπο, θα αυξήσουμε τη βαθμολογία τους αν απαντήσουν σωστά στην ερώτηση και θα τη μειώσουμε αν απαντήσουν λάθος. <br/><br/>Προσέξτε λοιπόν - αν επικοινωνήσετε αλλά δεν γνωρίζετε την απάντηση, θα χάσετε πόντους!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-30": "Θα πρέπει επίσης να προσθέσουμε μια αντίστροφη μέτρηση, ώστε ο παίκτης να γνωρίζει πόσο χρόνο έχει στη διάθεσή του για να απαντήσει. <br/><br/>Θα χρησιμοποιήσουμε το μήνυμα <i>buzzed</i> που ορίσαμε προηγουμένως για να το κάνουμε αυτό. <br/><br/>Δημιουργήστε μια άλλη μεταβλητή που ονομάζεται <i>ledID</i> και κάντε την ξανά <i>Μόνο για αυτό το sprite</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-32": "Δοκιμάστε το! <br/><br/>Οι ερωτήσεις θα τίθενται η μία μετά την άλλη. Αν πατήσετε το κουμπί, θα έχετε 6 δευτερόλεπτα για να απαντήσετε, ενώ το γρανάζι θα εμφανίζει μια αντίστροφη μέτρηση και στη συνέχεια θα σας ζητηθεί να επιλέξετε κόκκινο ή πράσινο ανάλογα με το αν απαντήσατε λάθος ή σωστά στην ερώτηση.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-33": "Πρέπει να κάνουμε κάτι ακόμα κι αν κανείς δεν εμφανιστεί εγκαίρως για μια ερώτηση, και πρέπει να πούμε ποιος είναι ο νικητής στο τέλος. <br/><br/>Επιστρέψτε στο sprite.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-34": "Στην κενή συνθήκη <i>else</i> στον ορισμό <i>check answer</i>, προσθέστε αυτά τα μπλοκ: <ul><li>Πείτε [Too slow!] για [2] δευτερόλεπτα</li><li>Πείτε [join [The answer was] [item [1] of [answers]] για [5] δευτερόλεπτα</li></ul>Με αυτόν τον τρόπο, εάν κανείς δεν βουίσει εγκαίρως, το sprite θα διαβάσει τη σωστή απάντηση για όλους.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-36": "Προστέθηκε ένα νέο γρανάζι με τον ίδιο κωδικό με το πρώτο!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-38": "Συνδέστε ένα δεύτερο γρανάζι και δοκιμάστε το!<br/><br/>Τώρα, όποιο γρανάζι βουίζει πρώτο μετά την υποβολή μιας ερώτησης, θα έχει την ευκαιρία να απαντήσει<br/><br/>Μπορείτε να προσθέσετε περισσότερους παίκτες αντιγράφοντας το γρανάζι περισσότερες φορές!<br/><br/>Θυμηθείτε να ενημερώσετε τη μεταβλητή <i>αριθμός παίκτη</i> σε κάθε γρανάζι<br/><br/>Θα πρέπει επίσης να ορίσετε τη μεταβλητή αριθμού παικτών ώστε να ταιριάζει με τον <i>αριθμό</i> των παικτών",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-39": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-40": "Αρχικά, θα υπολογίσουμε ποια είναι η υψηλότερη βαθμολογία. <br/><br/>Δημιουργήστε ένα άλλο μπλοκ με το όνομα <i>εύρεση μέγιστης βαθμολογίας</i>. <br/><br/> Στο μπλοκ <i>ορισμός [εύρεση μέγιστης βαθμολογίας]</i>, προσθέστε αυτά τα μπλοκ:<ul><li>ορισμός του [maxScore] σε [στοιχείο [1] από [βαθμολογίες]]</li><li>ορισμός του [playerID] σε [1]</li><li>επανάληψη του [μήκος των [βαθμολογιών]]</li><ul>αν [[στοιχείο [playerID] από [βαθμολογίες]] > [maxScore]] τότε</li><ul><li>ορισμός του [maxScore] σε [στοιχείο [playerID] από [βαθμολογίες]]</li><ul><li>αλλαγή του [playerID] με [1]</li></ul></li></ul></li></ul><br/><br/> Θα χρειαστεί να δημιουργήσετε τις μεταβλητές <i>maxScore</i> και <i>playerID</i>. <br/><br/>Αυτός ο κώδικας θα <li>επαναλαμβάνει</li> τον πίνακα αποτελεσμάτων - θα τον διασχίζει μία καταχώρηση κάθε φορά - και θα ορίζει τη μεταβλητή <i>maxScore</i> στην υψηλότερη βαθμολογία που βρίσκει στην πορεία.<br/><br/>Κάντε κλικ σε αυτήν την ενότητα του κώδικα για να την εκτελέσετε - η μεταβλητή <i>maxScore</i> θα πρέπει να οριστεί στην υψηλότερη τιμή στη λίστα αποτελεσμάτων.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-41": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-42": "Προσθέστε αυτά τα μπλοκ στο μπλοκ <i>define [how many players with score [βαθμολογία]]</i>:<ul><li>set [result] to [0]</li><li>set [playerID] to [0]</li><li>repeat [length of [scores]]</li><ul><li>change [playerID] by [1]</li><li>if [item [playerID] of [scores]] = [score]] then</li><ul><li>change [result] by [1]</li></ul></ul></ul>Αυτό το νέο μπλοκ (ή συνάρτηση) είναι λίγο διαφορετικό από αυτά που δημιουργήσαμε πριν, επειδή δέχεται μια παράμετρο - το σκορ που θέλουμε να αναζητήσουμε. <br/><br/>Μπορείτε να σύρετε αυτήν την παράμετρο <i>score</i> προς τα κάτω από το μπλοκ ορισμού για να τη χρησιμοποιήσετε στον κώδικά σας. Είναι σαν μια μεταβλητή, αλλά μπορεί να χρησιμοποιηθεί μόνο σε αυτήν τη συνάρτηση.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-43": "Για να το δοκιμάσετε αυτό, δοκιμάστε να εκτελέσετε το μπλοκ how many players with score [] με την παράμετρο score να έχει οριστεί σε έναν αριθμό που βρίσκεται στη λίστα βαθμολογιών σας. Η μεταβλητή αποτελέσματος θα οριστεί στον αριθμό των παικτών με αυτό το σκορ.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-44": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-45": "Μέσα στο τμήμα <i>else</i> του μπλοκ <i>if … else</i>, προσθέστε αυτά τα μπλοκ<ul><li>Πείτε [join [join [There are ] [result]] [ winners!]] για [5] δευτερόλεπτα</li><li>Πείτε [join [With scores of ] [maxScore]] για [5] δευτερόλεπτα</li><li>Ορίστε το [winners] σε [join [Player] [item # of [maxScore] in [scores]]</li><li>Ορίστε το [playerID] σε [item # of [maxScore] in [scores]</li><li>Επαναλάβετε μέχρι το [[playerID] = [length of [scores]]</li><li>Αλλάξτε το [playerID] κατά [1]</li><li>Εάν [[item [playerID] of [scores] = [maxScore]] τότε</li><li>Ορίστε το [winners] σε [join [join [winners] [and Player]] [playerID]</li><li>Πείτε [winners]</li></ul>Τώρα, αν υπάρχουν περισσότεροι από ένας νικητές, το sprite θα πει πόσοι είναι και στη συνέχεια θα τους απαριθμήσει. Οι μεταβλητές μπορούν να αποθηκεύσουν περισσότερους από απλούς αριθμούς - εδώ η μεταβλητή <i>winners</i> χρησιμοποιείται για τη δημιουργία μιας συμβολοσειράς κειμένου που απαριθμεί όλους τους νικητές.</br></br>Ο βρόχος <i>repeat until</i> επαναλαμβάνεται από την πρώτη βαθμολογία στη λίστα που ταιριάζει με τη μεταβλητή <i>maxScore</i> μέχρι το τέλος. Κάθε φορά που βρίσκει μια άλλη βαθμολογία που ταιριάζει, προσθέτει αυτόν τον παίκτη στη μεταβλητή <i>winners</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-46": "Δοκιμάστε το! <br/> Τώρα, στο τέλος του κουίζ, οι νικητές θα αναγραφούν, ακόμα κι αν υπάρξει ισοπαλία!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-47": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.name": "Παρακολούθηση κίνησης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-4": "Δοκιμάστε το!<br/><br/>Πατήστε την πράσινη σημαία για να εκτελέσετε τον κώδικα και, στη συνέχεια, μετακινήστε το γρανάζι<br/><br/>Θα δείτε τη λίστα αξόνων να ενημερώνεται κάθε 0,1 δευτερόλεπτα με την πιο πρόσφατη ένδειξη (ή <i>δείγμα</i>) από τον άξονα x του επιταχυνσιόμετρου.<br/><br/>Κάθε νέο δείγμα στη λίστα αξόνων αντικαθιστά το παλαιότερο και χρησιμοποιούμε τον τελεστή <i>mod</i> για να διασφαλίσουμε ότι η μεταβλητή <i>sampleCounter</i> κάνει επανάληψη από το τέλος της λίστας πίσω στην αρχή της.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-5": "Χρειαζόμαστε έναν τρόπο να προσδιορίσουμε εάν τα δεδομένα που έχουμε συλλέξει δείχνουν εάν το γρανάζι κινείται ή όχι.<br/><br/>Ένας απλός τρόπος για να το κάνουμε αυτό είναι να δούμε πόσο αλλάζει - η κίνηση θα πρέπει να σημαίνει επιτάχυνση, την οποία θα μετρήσει το επιταχυνσιόμετρο.<br/><br/>Θα δημιουργήσουμε ένα νέο μπλοκ με το όνομα <i>get range</i>, το οποίο θα υπολογίσει πόσο ποικίλλουν τα δεδομένα στη λίστα ax.<br/><br/>Προσθέστε αυτά τα μπλοκ:<ul><li>Ορισμός [get range]</li><li>Ορισμός [rangeCounter] σε [0]</li><li>Ορισμός [min] σε [item [1] of [ax]]</li><li>Ορισμός [max] σε [item [1] of [ax]]</li><li>Επανάληψη [length of [ax]]</li><ul><li>Αλλάξτε το [rangeCounter] κατά [1]</li><li>Ορισμός [sample] σε [item [rangeCounter] of [ax]]</li><li>Εάν [[δείγμα] < [λεπτά]] τότε</li><ul><li>Ορίστε το [λεπτά] σε [δείγμα]</li></ul><li>Εάν [[δείγμα] > [μέγιστο]] τότε</li><ul><li>Ορίστε το [μέγιστο] σε [δείγμα]</li></ul><li>Ορίστε το [αποτέλεσμα] σε [[μέγιστο] - [λεπτά]]</li></ul></ul><br/>Αυτή η συνάρτηση θα επαναλαμβάνει πλέον ολόκληρη τη λίστα αξόνων, ένα δείγμα κάθε φορά, και θα επιλέγει τις ελάχιστες και μέγιστες τιμές.<br/>Στο τέλος, θα ορίσει τη μεταβλητή αποτελέσματος στη διαφορά μεταξύ των δύο.<br/>Περισσότερη κίνηση θα σημαίνει ότι καταγράφεται μεγαλύτερο εύρος τιμών.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-6": "Ας προσθέσουμε μπλοκ για να ερμηνεύσουμε αυτό το εύρος και να το ταξινομήσουμε ως κίνηση ή όχι.<br/><br/>Προσθέστε αυτά τα μπλοκ:<ul><li>Όταν γίνει κλικ στην πράσινη σημαία</li><li>Ορίστε το [motionThreshold] σε [0.2]</li><li>Για πάντα</li><ul><li>Περιμένετε [1] δευτερόλεπτα</li><li>Λήψη εύρους</li><li>Εάν [[result] > [motionThreshold]] τότε</li><ul><li>Ορίστε το [motionDetected] σε true</li></ul><li>Διαφορετικά</li><ul><li>Ορίστε το [motionDetected] σε false</li></ul></ul></ul><br/>Εδώ έχουμε ορίσει ένα όριο - μια τιμή με την οποία συγκρίνουμε το εύρος των δειγμάτων του επιταχυνσιόμετρου. Εάν το εύρος είναι υψηλότερο από αυτό το όριο, θα πούμε ότι έχουμε ανιχνεύσει κίνηση και, εάν όχι, τότε θα πούμε ότι δεν έχουμε.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-7": "Δοκιμάστε το!<br/>Τώρα, κάθε δευτερόλεπτο, το πρόγραμμα θα εξετάζει τη λίστα δειγμάτων από το επιταχυνσιόμετρο και θα καθορίζει αν πιστεύει ότι έχει υπάρξει κίνηση ή όχι.<br/><br/>Λαμβάνει τις 10 μεμονωμένες μετρήσεις (ή δείγματα) του επιταχυνσιόμετρου και υπολογίζει μία μόνο ανίχνευση αληθούς ή ψευδούς κίνησης.<br/><br/>Θα μπορούσαμε να αλλάξουμε τις μεταβλητές που έχουμε ορίσει για να προσαρμόσουμε αυτήν τη συμπεριφορά.<br/><br/>Για παράδειγμα, θα μπορούσαμε να αλλάξουμε το <i>motionThreshold</i> για να κάνουμε το πρόγραμμα περισσότερο ή λιγότερο ευαίσθητο στις κινήσεις.<br/><br/>Θα μπορούσαμε επίσης να αλλάξουμε το <i>numSamples</i> για να μεταβάλλουμε τη διάρκεια ενός στιγμιότυπου κίνησης που εξετάζουμε κάθε φορά. Με 10 δείγματα που λαμβάνονται σε διαστήματα 0,1 δευτερολέπτου, εξετάζουμε αν έχει υπάρξει κίνηση το τελευταίο δευτερόλεπτο, αλλά αν αυξήσετε το <i>numSamples</i>, θα ελέγχει για κίνηση σε μεγαλύτερο χρονικό διάστημα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-10": "Μέσα στην συνθήκη <i>if [[result] > [motionThreshold] then</i>, προσθέστε ένα μπλοκ <i>change [activeSeconds] κατά [1]</i><br/>Με αυτόν τον κώδικα, θα μετράμε πόσα δευτερόλεπτα από κάθε 60 θεωρούμε ότι είναι ενεργά.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-11": "Δημιουργήστε μια νέα λίστα με όνομα activeMinutes<br/>Αμέσως μετά τον βρόχο <i>repeat [60]</i> (αλλά ακόμα μέσα στον βρόχο forever), προσθέστε αυτά τα μπλοκ:<ul><li>Εάν [[activeSeconds] > [activeSecondsThreshold]] τότε</li><ul><li>Προσθέστε [true] στα [activeMinutes]</li></ul><li>Αλλιώς</li><ul><li>Προσθέστε [false] στα [activeMinutes]</li></ul></ul><br/>Τώρα, μετά από κάθε 60 δευτερόλεπτα - δηλαδή μία φορά το λεπτό - θα συγκρίνουμε τον συνολικό αριθμό ενεργών δευτερολέπτων σε αυτό το λεπτό με τη μεταβλητή <i>activeSecondThreshold</i>, για να ταξινομήσουμε αν πιστεύουμε ότι αυτό το λεπτό στο σύνολό του ήταν ενεργό ή όχι.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-12": "Ας μην ξεχνάμε να καθαρίσουμε τη λίστα <i>activeMinutes</i> στην αρχή του προγράμματος!<br/>Προσθέστε ένα μπλοκ <i>διαγραφή όλων των [activeMinutes]</i> μετά το μπλοκ <i>set [activeSecondsThreshold]</i><br/>Θα πρέπει πάντα να θυμάστε να επαναφέρετε όλες τις μεταβλητές και τις λίστες σας στην αρχή ενός προγράμματος - αυτό ονομάζεται αρχικοποίηση των μεταβλητών σας και αν ξεχάσετε να το κάνετε, τότε μπορούν να εμφανιστούν σφάλματα!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-13": "Δοκιμάστε το!<br/><br/>Κάθε φορά που ανιχνεύεται κίνηση για περισσότερο από 30 δευτερόλεπτα κατά τη διάρκεια κάθε παραθύρου 60 δευτερολέπτων, αυτό το λεπτό θα καταγράφεται ως αληθές στη λίστα <i>activeMinutes</i>.<br/><br/>Διαφορετικά, θα καταγράφεται ένα <i>false</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-14": "Ας δούμε μερικές ακόμη χρήσιμες πληροφορίες για τον χρήστη<br/>Δημιουργήστε δύο νέες μεταβλητές που ονομάζονται <i>totalActiveSeconds</i> και <i>totalSeconds</i><br/>Αρχικοποιήστε και τις δύο ορίζοντας τες σε 0 στην αρχή του προγράμματος",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-17": "Ας αναφέρουμε ορισμένες από αυτές τις πληροφορίες με έναν πιο φιλικό προς το χρήστη τρόπο.<br/><br/>Προσθέστε ένα μπλοκ <i>broadcast [αναφορά στατιστικών]</i> λίγο πριν το τέλος του βρόχου <i>forever</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-18": "Προσθέστε ένα νέο sprite — μπορείτε να επιλέξετε όποιο θέλετε. Σε αυτό το παράδειγμα επιλέξαμε ένα ρομπότ.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-19": "Προσθέστε αυτά τα μπλοκ:<ul><li>Όταν λαμβάνω [στατιστικά αναφοράς]</li><li>Πείτε [join [join [join [join [You have been active for ] [totalActiveSeconds]] [ out of ]] [totalSeconds]] [ seconds]] για [5] δευτερόλεπτα</li><li>Πείτε [join [join [That is [round [[[totalActiveSeconds] / [totalSeconds]] * 100]]] [% of the time]] για [5] δευτερόλεπτα</li></ul><br/>Τώρα, μία φορά το λεπτό το sprite θα λέει στον χρήστη πόσο ενεργός ήταν και ποιο είναι αυτό ως ποσοστό του χρόνου που έχει περάσει.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-20": "Δοκιμάστε το!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-23": "Το ποσοστό των ενεργών δευτερολέπτων σίγουρα μοιάζει με μια πιο ακριβή σύνοψη του πόσο ενεργός ήταν συνολικά ο χρήστης μας, αλλά αυτό δεν σημαίνει ότι η λίστα με τα ενεργά λεπτά δεν είναι χρήσιμη. Είναι μια πιο απαισιόδοξη εκτίμηση της δραστηριότητας, αλλά δείχνει αν κάποιος δεν κινείται πολύ.<br/><br/>Ας προσθέσουμε κάτι που θα παροτρύνει τον χρήστη να ασκηθεί λίγη αν δεν έχει κινηθεί πολύ τα τελευταία 5 λεπτά.<br/><br/>Προσθέστε αυτά τα μπλοκ:<ul><li>Εάν [[length of [activeMinutes]] > [4]] τότε</li><ul><li>Ορίστε το [totalActiveMinutes] σε [0]</li><li>Επανάληψη [5]</li><ul><li>Εάν [[item [minuteCounter] of [activeMinutes]] = [true]] τότε</li><ul><li>Αλλάξτε το [totalActiveMinutes] κατά [1]</li></ul><li>Αλλάξτε το [minuteCounter] κατά [-1]</li></ul><li>Εάν [[totalActiveMinutes] = [0]] τότε</li><ul><li>Μετάδοση [signal user]</li><li>Πείτε [Εσείς [δεν έχω μετακινηθεί πολύ τα τελευταία 5 λεπτά]</li></ul></ul></ul><br/>Αφού διαβάσει τα κύρια στατιστικά στοιχεία, ο κώδικας θα ελέγξει εάν έχουν καταγραφεί τουλάχιστον 5 λεπτά στη λίστα <i>activeMinutes</i>.<br/>Εάν υπάρχουν, θα μετακινηθεί προς τα πίσω στα 5 πιο πρόσφατα λεπτά της λίστας και θα μετρήσει πόσα από αυτά ήταν ενεργά λεπτά.<br/>Εάν δεν ήταν κανένα από αυτά, τότε θα σταλεί το μήνυμα <i>signal user</i> και το sprite θα ενημερώσει τον χρήστη ότι δεν έχει μετακινηθεί πολύ.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-24": "Αλλαγή πίσω στο Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-25": "Προσθέστε αυτά τα μπλοκ:<ul><li>Όταν λαμβάνω [signal user]</li><li>Επανάληψη [3]</li><ul><li>Ρυθμίστε τα LED [ring] σε [κόκκινο]</li><li>Παίξτε νότα [A5] για [0,5] δευτερόλεπτα</li><li>Ρυθμίστε τα LED [ring] σε [λευκό]</li><li>Περιμένετε [0,5] δευτερόλεπτα</li></ul><li>Απενεργοποιήστε όλα τα LED</li></ul><br/>Τώρα το Cog θα ηχήσει και θα ανάψει για να ενημερώσει τον χρήστη ότι πρέπει να κινηθεί περισσότερο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.name": "Ανίχνευση χειρονομιών ML",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.description": "Ας φτιάξουμε ένα μοντέλο ανίχνευσης χειρονομιών!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-1": "Ας χρησιμοποιήσουμε τη μηχανική μάθηση για να αναγνωρίσουμε συγκεκριμένες κινήσεις με το Cog!<br/><br/>Θα εκπαιδεύσουμε ένα μοντέλο να αναγνωρίζει χειρονομίες και θα τις χρησιμοποιήσουμε ως μέρος ενός παιχνιδιού μνήμης που βασίζεται σε ξόρκια εκμάθησης!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-2": "Κάντε κλικ στην καρτέλα <i>Μηχανική Μάθηση</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-3": "Επιλέξτε το εικονίδιο <i>+</i> και κάντε κλικ στην επιλογή <i>Νέο μοντέλο επιταχυνσιόμετρου</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-4": "Πατήστε <i>Συνέχεια</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-5": "Τα δεδομένα που θα χρησιμοποιήσουμε για την εκπαίδευση αυτού του μοντέλου θα είναι οι τρεις άξονες του επιταχυνσιόμετρου. <br/><br/> Μπορείτε να δείτε αυτά τα δεδομένα σε πραγματικό χρόνο σε αυτήν την οθόνη, όπως ακριβώς και στον πίνακα ελέγχου των αισθητήρων.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-6": "Πληκτρολογήστε ένα Όνομα Μοντέλου για την <i>χειρονομία</i> και στη συνέχεια εισάγετε τη λέξη <i>τίποτα</i> στο πλαίσιο Δημιουργία Νέας Κλάσης<br/>Πατήστε το κουμπί + για να δημιουργήσετε αυτήν τη νέα κλάση",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-7": "Αυτό θα δημιουργήσει μια κλάση που ονομάζεται <i>τίποτα</i>. <br/>Θα έχουμε μία κλάση για κάθε τύπο κίνησης που θέλουμε να ανιχνεύσουμε - και αυτό σημαίνει επίσης ότι έχουμε μια βασική περίπτωση μη κίνησης.<br/><br/>Τώρα πρέπει να συλλέξουμε δεδομένα εκπαίδευσης για την κλάση <i>τίποτα</i>. Μπορείτε να συλλέξετε δείγματα δεδομένων για μοντέλα επιταχυνσιομέτρων όπως αυτό κρατώντας πατημένο το κουμπί στο Cog.<br/><br/>Σηκώστε το Cog, κρατήστε το σταθερό και στη συνέχεια πατήστε το κουμπί για μερικά δευτερόλεπτα.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-8": "Περιστρέψτε το γρανάζι σε διαφορετική θέση, κρατήστε το σταθερό και στη συνέχεια πατήστε ξανά το κουμπί για μερικά δευτερόλεπτα για να συλλέξετε ένα νέο δείγμα<br/>Επαναλάβετε αυτό με διαφορετικές θέσεις μέχρι να έχετε 10-20 δείγματα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-9": "Τώρα δημιουργήστε μια άλλη κλάση που ονομάζεται <i>swoosh</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-12": "Τώρα δημιουργήστε μια άλλη κλάση που ονομάζεται <i>flick</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-14": "Βεβαιωθείτε ότι έχετε τουλάχιστον 10 δείγματα ξανά.<br/>Πιθανότατα θα δείτε ότι για την κλάση <i>τίποτα</i>, οι γραμμές στα μεμονωμένα δείγματα είναι αρκετά επίπεδες. Στο <i>swoosh</i> υπάρχει ένα που σχηματίζει μια μεγάλη καμπύλη προς τα κάτω και προς τα πάνω.<br/>Και οι γραμμές για το <i>flick</i> είναι πολύ πιο ακανόνιστες - αν βλέπατε αυτά τα δείγματα, πιθανότατα θα μπορούσατε να τα ταξινομήσετε σε μία από τις τρεις ετικέτες μας - <i>τίποτα</i>, <i>swoosh</i> και <i>flick</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-15": "Εντάξει, ας δούμε αν μπορούμε να κάνουμε τον υπολογιστή να το κάνει αυτό!<br/>Κάντε κλικ στο κουμπί <i>Εκπαίδευση</i>. Αυτό θα εξετάσει όλα τα δεδομένα εκπαίδευσης με ετικέτες και θα προσπαθήσει να δημιουργήσει ένα μοντέλο που μπορεί να ταξινομήσει νέα δεδομένα καθώς αυτά έρχονται.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-16": "Θα δείτε μια ειδοποίηση σχετικά με ένα Διάγραμμα Απωλειών Φόρτωσης και, στη συνέχεια, θα εμφανιστεί ένα γράφημα.<br/>Το διάγραμμα απωλειών δείχνει πόσο καλά τα πάει το μοντέλο από βήμα σε βήμα καθώς προσπαθεί επανειλημμένα να ταξινομήσει τα δεδομένα εκπαίδευσης. Κάθε επανάληψη εκπαίδευσης ονομάζεται <i>εποχή</i> - αυτό βρίσκεται στον άξονα x του διαγράμματος απωλειών.<br/>Μια απότομη καθοδική κλίση στο διάγραμμα απωλειών σημαίνει ότι το μοντέλο αλλάζει πολύ κάθε εποχή και βελτιώνεται στην ταξινόμηση των δεδομένων.<br/>Η εκπαίδευση θα ολοκληρωθεί όταν το επίπεδο απώλειας δεν αλλάζει πλέον πολύ.<br/>Μια χαμηλή απώλεια σημαίνει ότι έχει καταφέρει να ταξινομήσει με ακρίβεια τα περισσότερα από τα δεδομένα εκπαίδευσης που του δώσαμε - επομένως θέλουμε το τελικό ποσό απώλειας να είναι χαμηλό.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-17": "Τώρα πατήστε το κουμπί <i>Εκτέλεση</i> για να δοκιμάσετε να εκτελέσετε το μοντέλο με νέα δεδομένα.<br/>Στη συνέχεια, μετακινήστε το Cog - δοκιμάστε να κάνετε τις δύο κινήσεις στις οποίες το εκπαιδεύσατε και δείτε αν μπορεί να τις αναγνωρίσει.<br/>Οι τρεις ποσοστιαίες γραμμές αντιπροσωπεύουν το επίπεδο εμπιστοσύνης του μοντέλου στην ταξινόμησή του.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-19": "Μόλις είστε ικανοποιημένοι, πατήστε <i>Εκπαίδευση</i> για να εκπαιδεύσετε ξανά το μοντέλο.<br/>Στη συνέχεια, <i>Εκτελέστε</i> το και δείτε αν είστε ικανοποιημένοι με την απόδοση.<br/>Εξακολουθούσα να αντιμετωπίζω προβλήματα με το μοντέλο που ανίχνευε ένα <i>swoosh</i> πριν από κάθε <i>κίνηση</i>, ενώ δεν υπήρχε. Για να προσπαθήσω να το διορθώσω, πρόσθεσα μερικά δείγματα στην κατηγορία <i>τίποτα</i> περιστρέφοντας το Cog από οριζόντια σε κάθετη - το είδος της κίνησης που κάνω πριν από μια κίνηση, η οποία κατηγοριοποιούνταν λανθασμένα ως swoosh",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-20": "Το μοντέλο σας θα είναι καλά εκπαιδευμένο όταν κάθε ανίχνευση είναι διακριτή και σαφής - όπως εδώ όπου πηγαίνει κατευθείαν από <i>τίποτα → swoosh</i> και πίσω, και το ίδιο για <i>τίποτα → τίναγμα</i> και πίσω.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-24": "Μεταβείτε στην κατηγορία <i>Μηχανική Μάθηση</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-28": "Προσθέστε αυτά τα μπλοκ:<ul><li>Όταν λαμβάνεται η ετικέτα του επιταχυνσιόμετρου [swoosh]</li><li>Ορίστε τα LED [ring] σε [πράσινο]</li><li>Μετάδοση [swoosh] και περιμένετε</li><li>Περιμένετε [1] δευτερόλεπτα</li><li>Απενεργοποιήστε όλα τα LED</li></ul><p>Και</p><ul><li>Όταν λαμβάνεται η ετικέτα του επιταχυνσιόμετρου [flick]</li><li>Ορίστε τα LED [ring] σε [κόκκινο]</li><li>Μετάδοση [flick] και περιμένετε</li><li>Περιμένετε [1] δευτερόλεπτα</li><li>Απενεργοποιήστε όλα τα LED</li></ul><br/>Τώρα το Cog θα αντιδράσει εμφανίζοντας φώτα και θα μεταδώσουμε ένα μήνυμα, κάθε φορά που ανιχνεύεται ένα swoosh ή ένα flick",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-29": "Δοκιμάστε το!<br/>Τώρα, όταν κάνετε τις κινήσεις, το Cog θα ανάψει",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-32": "Και μεταβείτε στην καρτέλα <i>Κοστούμια</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-33": "Προσθέστε κάποιο κείμενο που να λέει «Μάθετε ορθογραφία».<br/>Αυτή θα είναι η οθόνη τίτλου για το παιχνίδι.<br/>Μπορείτε επίσης να προσθέσετε άλλες διακοσμήσεις, αν θέλετε - όπως εδώ όπου έχουμε προσθέσει ένα μωβ τραπεζοειδές και ένα λευκό περίγραμμα γύρω από το κείμενο.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-34": "Θα προσθέσουμε μερικά ακόμη φόντα για χρήση στο παιχνίδι.<br/>Πατήστε το κουμπί <i>Επιλογή φόντου</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-35": "Επιλέξτε το φόντο <i>Castle 3</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-36": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-37": "Επιστρέψτε στην καρτέλα κώδικα, με το στάδιο ακόμα επιλεγμένο.<br/><br/>Προσθέστε αυτά τα μπλοκ:<ul><li>Όταν κάνετε κλικ στην πράσινη σημαία</li><li>Αλλαγή φόντου σε [οθόνη τίτλου]</li><li>Περιμένετε [2] δευτερόλεπτα</li><li>Αλλαγή φόντου σε [Κάστρο 3]</li></ul><br/>Τώρα, όταν ξεκινήσει το παιχνίδι, ο παίκτης θα δει την οθόνη τίτλου για 2 δευτερόλεπτα, προτού μεταβεί στο Κάστρο 3 - το εσωτερικό του κάστρου",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-38": "Θα προσθέσουμε ένα σύντομο σεμινάριο στο παιχνίδι και θα ζητήσουμε από τον παίκτη να επιβεβαιώσει ότι μπορεί να κάνει τις κινήσεις swoosh και flick.<br/>Θα κάνουμε αυτές τις κινήσεις υποχρεωτικές για να προχωρήσει μέσα από τα backdrops.<br/><br/>Προσθέστε αυτά τα μπλοκ:<ul><li>Όταν λαμβάνω [swoosh]</li><li>Εάν [[backdrop [name]] = [Castle 3]] τότε<ul><li>Επανάληψη [50]<ul><li>Αλλαγή του εφέ [fisheye] κατά [10]</li><li>Αλλαγή του εφέ [whirl] κατά [-10]</li></ul></li><li>Αλλαγή του backdrop σε [Castle 2]</li><li>Επανάληψη [50]<ul><li>Αλλαγή του εφέ [fisheye] κατά [-10]</li><li>Αλλαγή του εφέ [whirl] κατά [10]</li></ul></li></ul><br/>Τώρα, όταν ο παίκτης κάνει ένα κίνηση swoosh ενώ η μάγισσα βρίσκεται μέσα στο κάστρο, θα κάνει μια εντυπωσιακή μετάβαση στο φόντο του Κάστρου 2.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-39": "Χρειαζόμαστε ένα και για την κίνηση της κίνησης.<br/><br/>Προσθέστε αυτά τα μπλοκ:<ul><li>Όταν λαμβάνω [κίνηση]</li><li>Εάν [[backdrop [name]] = [Castle 2]] τότε<ul><li>Επανάληψη [50]<ul><li>Αλλαγή του εφέ [fisheye] κατά [10]</li><li>Αλλαγή του εφέ [whirl] κατά [-10]</li></ul></li><li>Αλλαγή φόντου σε [Witch House]</li><li>Επανάληψη [50]<ul><li>Αλλαγή του εφέ [fisheye] κατά [-10]</li><li>Αλλαγή του εφέ [whirl] κατά [10]</li></ul></li><li>Εκπομπή [έναρξη παιχνιδιού]</li></ul></li></ul><br/>Μπορεί να σας φανεί πιο γρήγορο να κάνετε δεξί κλικ και να αντιγράψετε αυτόν τον κώδικα, απλώς προσέξτε να τον αλλάξετε στα σωστά σημεία και να προσθέσετε το μπλοκ εκπομπής!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-41": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-42": "Εντάξει, ας το δοκιμάσουμε!<br/>Για να εκτελέσετε το μοντέλο ML, θα πρέπει να επιλέξετε ξανά Cog και να ξεκινήσετε το πρόγραμμα με επιλεγμένο το Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-43": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-44": "Με τη μάγισσα στο σπίτι της, ας ξεκινήσουμε το παιχνίδι σωστά.<br/>Αυτό θα είναι ένα παιχνίδι μνήμης, όπου η μάγισσα θα διαβάσει μια ακολουθία χειρονομιών και ο παίκτης θα πρέπει να τις θυμηθεί και να τις κάνει με τη σειρά.<br/>Επιλέξτε ξανά το sprite <i>Μάγισσα</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-45": "Προσθήκη αυτών των μπλοκ:<ul><li>Όταν λαμβάνω [έναρξη παιχνιδιού]</li><li>Διαγραφή όλων των [χειρονομιών]</li><li>Προσθήκη [swoosh] στις [χειρονομίες]</li><li>Προσθήκη [κίνησης] στις [χειρονομίες]</li><li>Ορισμός [ζωές] σε [3]</li><li>Ορισμός [μήκος ακολουθίας] σε [2]</li></ul><br/>Θα χρειαστεί να δημιουργήσετε μια λίστα με τίτλο <i>χειρονομίες</i> και μεταβλητές με τίτλο <i>ζωές</i> και <i>μήκος ακολουθίας</i>.<br/>Η λίστα χειρονομιών θα παραθέτει όλες τις πιθανές κινήσεις που μπορούμε να κάνουμε - αν θέλετε να επεκτείνετε το παιχνίδι με περισσότερες κινήσεις, θα μπορούσατε να τις προσθέσετε εδώ αφού εκπαιδεύσετε ένα μοντέλο σε αυτές.<br/>Θα δώσουμε στον παίκτη μας 3 ζωές για αρχή και θα χάνει μία κάθε φορά που κάνει κάτι λάθος.<br/>Και θα ξεκινήσουμε με μια ακολουθία 2 κινήσεων",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-46": "Δημιουργήστε ένα νέο μπλοκ με το όνομα <i>δημιουργήστε μια ακολουθία κινήσεων [μήκους]</i>.<br/>Θα χρειαστεί να χρησιμοποιήσετε και τις δύο επιλογές <i>Προσθήκη αριθμού ή κειμένου εισαγωγής</i> και <i>Προσθήκη ετικέτας</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-47": "Προσθέστε αυτά τα μπλοκ:<ul><li>Ορίστε [δημιουργήστε μια ακολουθία από [μήκος] χειρονομίες]<ul><li>Διαγράψτε όλες τις [ακολουθίες]</li><li>Επανάληψη [μήκος]<ul><li>Προσθέστε [αντικείμενο [επιλέξτε τυχαία [1] στο [μήκος [χειρονομίες]]] από [χειρονομίες]] στην [ακολουθία]</li></ul></li></ul></li></ul><br/>Θα χρειαστεί να δημιουργήσετε μια άλλη λίστα με το όνομα <i>ακολουθία</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-48": "Τώρα προσθέστε το μπλοκ <i>δημιουργία ακολουθίας από χειρονομίες [sequenceLength]</i>.<br/>Η συνάρτηση δημιουργίας ακολουθίας θα λάβει την τιμή της μεταβλητής <i>sequenceLength</i> ως όρισμα για την παράμετρο <i>μήκος</i> της.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-49": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-50": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-51": "Προσθέστε αυτά τα μπλοκ για να ορίσετε τη συνάρτηση ολοκλήρωσης παιχνιδιού:<ul><li>Ορισμός [τέλος παιχνιδιού]<ul><li>Πείτε [Αρκεί προς το παρόν. Μπράβο!] για [2] δευτερόλεπτα</li><li>Πείτε [join [join [Μάθατε ένα ξόρκι με] [[SequenceLength] - [1]]] [χειρονομίες]] για [10] δευτερόλεπτα</li><li>Σταματήστε [όλα]</li></ul></li></ul><br/>Τώρα, όταν ο παίκτης ξεμείνει από ζωές, θα του ειπωθεί το σκορ του - πόσο χρόνο κατάφερε να απομνημονεύσει και να εκτελέσει μια ακολουθία κινήσεων",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-52": "Επιλέξτε ξανά το Cog και δοκιμάστε το!<br/>Μπορείτε ακόμα να κάνετε το παιχνίδι σε πλήρη οθόνη πριν το ξεκινήσετε, για να δείτε πιο εύκολα τι λέει η Μάγισσα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-53": "Μπράβο!<br/>Μάθατε για τη Μηχανική Μάθηση και <b>εκπαιδεύσατε</b> ένα μοντέλο για να <b>ταξινομεί</b> χειρονομίες από δεδομένα κίνησης.<br/>Καταφέρατε να συλλέξετε πολλά <b>δείγματα</b> για την εκπαίδευση του μοντέλου και να το δοκιμάσετε πριν το αποθηκεύσετε και το χρησιμοποιήσετε στον κώδικά σας.<br/>Στη συνέχεια, χρησιμοποιήσατε συναρτήσεις και λίστες για να δημιουργήσετε ένα παιχνίδι μνήμης!<br/><br/><b>Επόμενα βήματα</b><br/>• Θα μπορούσατε να προσθέσετε μια τρίτη χειρονομία στο παιχνίδι;<br/>• Πειραματιστείτε με την προσαρμογή των παραμέτρων Μηχανικής Μάθησης - το όριο εμπιστοσύνης και τη συχνότητα επισήμανσης.<br/>• Δημιουργήστε ένα καλύτερο τέλος στο παιχνίδι εάν ο παίκτης είναι σε θέση να θυμάται πολύ πολύ μεγάλες ακολουθίες κινήσεων",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.description": "Μάθετε πώς οι προγραμματιστές χρησιμοποιούν μεταβλητές και βρόχους για να ενισχύσουν τον κώδικά τους!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-1": "Σε αυτό το σεμινάριο, θα μάθουμε πώς οι προγραμματιστές χρησιμοποιούν <b/>μεταβλητές</b> για να ενισχύσουν τον κώδικά τους!<br /><br />Οι μεταβλητές είναι πραγματικά σημαντικές στον προγραμματισμό. Βοηθούν τους υπολογιστές να <b/>θυμούνται και να χειρίζονται</b> δεδομένα, ώστε να μπορούμε να εκτελούμε πιο περίπλοκες εργασίες σε λιγότερες γραμμές κώδικα.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-2": "Φανταστείτε μια μεταβλητή ως ένα κουτί αποθήκευσης με ετικέτες. Μια μεταβλητή έχει τρία μέρη: ένα όνομα, έναν τύπο και μια τιμή.<br /><br /> Το <b/>όνομα</b> μας λέει <i/>\"πώς ονομάζουμε αυτό το κουτί;\"</i> <br /> Ο <b/>τύπος</b> μας λέει <i/>\"τι είδους πράγμα κρατάμε σε αυτό το κουτί;\"</i><br /> Η <b/>τιμή</b> μας λέει <i/>\"τι ακριβώς κρατάμε αυτήν τη στιγμή στο κουτί;\"</i> <br /><br /> Σε αυτήν την άσκηση, θα δημιουργήσουμε και θα χρησιμοποιήσουμε μια μεταβλητή που ονομάζεται <b/>ο μετρητής μου</b> για να βοηθήσουμε τον Μάρτι να μετρήσει μέχρι το δέκα!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-5": "Ας κάνουμε τον Marty να διαβάσει τη μεταβλητή μας!<br /><br />Επιλέξτε το μπλοκ \"Marty speak\" και αντικαταστήστε το \"hello\" με τη μεταβλητή <b/>my counter</b> όπως παρακάτω. Κάντε κλικ σε αυτό το μπλοκ και θα πρέπει να ακούσετε τον Marty να λέει \"zero\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-6": "Αν θέλουμε ο Μάρτι να μετράει από το 0 έως το 10, πρέπει να προσθέτουμε +1 στον <b/>μετρητή μου</b> πριν από κάθε φορά που λέμε στον Μάρτι να πει έναν αριθμό.<br /><br />Στις μεταβλητές, μπορούμε να επιλέξουμε το μπλοκ <b/>αλλαγή του μετρητή μου κατά 1</b>, το οποίο θα προσθέτει +1 στον <b/>μετρητή μου</b>.<br /><br />Τοποθετήστε αυτό πριν από τη φράση \"Μάρτι μιλήσει\" όπως παρακάτω. Κάντε κλικ σε αυτά τα μπλοκ και ακούστε τον Μάρτι να λέει \"ένα\"!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-8": "Χμμ... Τι γίνεται αν θέλουμε να μετρήσουμε ξανά μέχρι το δέκα; Πρέπει να μηδενίσουμε τον <b/>μετρητή μου</b>! <br /><br />Επιλέξτε \"ορισμός μετρητή μου σε 0\" στην περιοχή scripting, κάντε κλικ σε αυτό και ο <b/>μετρητής μου</b> θα πρέπει να μηδενιστεί.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-9": "Ας δοκιμάσουμε μια επιπλέον πρόκληση - τι θα γινόταν αν θέλαμε να κάνουμε τον Marty να μετράει από το 0 έως το 10 απλώς κάνοντας κλικ στο πράσινο κουμπί με τη σημαία;<br /><br /> Θα χρειαζόταν ο Marty να επαναλαμβάνει τον κώδικά μας πολλές φορές μέχρι να φτάσει στο δέκα.\n<br /><br /> Μπορούμε να το ελέγξουμε αυτό χρησιμοποιώντας ένα μπλοκ <b/>επανάληψη μέχρι</b> - τοποθετήστε τον υπάρχοντα κώδικά μας μέσα σε αυτό ως εξής:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-11": "Ας ολοκληρώσουμε την πρόταση <b/>repeat until</b>.<br /><br /> Θέλουμε να συνεχίσουμε τον βρόχο μέχρι ο μετρητής μου να γίνει μεγαλύτερος από δέκα.<br /><br /> Μεταβείτε στις μεταβλητές και συμπληρώστε την πρόταση repeat με την πρόταση <b/>my counter</b> ως εξής:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-13": "Μπράβο! Σχεδόν τελείωσες!<br/><br/>Τέλος, πρόσθεσε ένα μπλοκ <b/>όταν γίνει κλικ στην πράσινη σημαία</b> στην κορυφή του κώδικά μας για να το ολοκληρώσουμε.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-1": "Σε αυτό το σεμινάριο, θα μάθουμε πώς οι προγραμματιστές χρησιμοποιούν <b/>παράλληλα προγράμματα, συνθήκες κούρσας και αμοιβαίο αποκλεισμό</b> για να ελέγχουν τη σειρά με την οποία εκτελούνται τμήματα κώδικα!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-2": "Τα παράλληλα προγράμματα είναι ξεχωριστά κομμάτια κώδικα που ζητάμε από έναν υπολογιστή να εκτελέσει ταυτόχρονα.<br/><br/>Όπως ακριβώς οι άνθρωποι, υπάρχουν ορισμένα πράγματα που οι υπολογιστές, και οι Marty, δεν μπορούν να κάνουν ταυτόχρονα.<br/><br/>Για παράδειγμα, <b/>οι άνθρωποι δεν μπορούν να περπατήσουν εμπρός και πίσω ταυτόχρονα - και ούτε ο Marty μπορεί!</b><br/><br/>Η προσπάθεια να γίνει αυτό δημιουργεί αυτό που ονομάζουμε <b/>συνθήκη αγώνα</b>, όπου το πρόγραμμά μας δεν μπορεί στην πραγματικότητα να εκτελέσει όλο τον παράλληλο κώδικά μας ταυτόχρονα.<br/><br/>Αυτό μπορεί να προκαλέσει απρόβλεπτη συμπεριφορά - άσχημα νέα για τους προγραμματιστές!<br/><br/><br/><i/>Κάντε κλικ στην εικόνα για να αναπτύξετε το διάγραμμα.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-4": "Για να δείξουμε μια συνθήκη αγώνα, θα ζητήσουμε από τον Marty να περπατήσει εμπρός και πίσω ταυτόχρονα.<br/><br/>Πρώτα, θα γράψουμε τον κώδικα \"walk forward\" (περπατήστε εμπρός).<br/><br/> Επιλέξτε ένα μπλοκ <b/>when green flag clicked</b> (όταν γίνει κλικ στην πράσινη σημαία) και σύρετέ το στην περιοχή scripting (σεναρίων).",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-5": "Τοποθετήστε ένα μπλοκ <b/>περπάτημα 2 βήματα μπροστά</b> μετά το μπλοκ της πράσινης σημαίας.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-7": "Τέλος, προσθέστε ένα μπλοκ <b/>περπάτημα προς τα πίσω</b> για να ολοκληρώσετε τον παράλληλο κώδικά μας.<br/><br/>Τώρα, μπορεί ο Marty να περπατήσει προς τα εμπρός και προς τα πίσω ταυτόχρονα; <b/>Όχι!</b> Δημιουργήσαμε μια συνθήκη κούρσας.<br/><br/><i/>Κάντε κλικ στην πράσινη σημαία και δείτε τι θα κάνει πρώτα ο Marty...</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-8": "Παρατηρήσατε ότι ο Μάρτι περπάτησε <b/>πρώτα μπροστά και μετά πίσω;</b> Ας διερευνήσουμε γιατί.<br/><br/>Πρώτα, διαγράψτε όλο τον κώδικά σας, ώστε να έχουμε μια κενή πλάκα.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-9": "Τώρα θα αναδημιουργήσουμε τον παράλληλο κώδικά μας, αλλά πρώτα θα κάνουμε τον κώδικά μας <b/>μετάβαση προς τα πίσω</b>.<br/><br/> Αναδημιουργήστε τον κώδικα που φαίνεται στην παρακάτω εικόνα.<br/><br/><i/>Εάν χρειάζεστε βοήθεια, απλώς επιστρέψτε στα βήματα 6 και 7!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-10": "Τώρα ας αναδημιουργήσουμε και τον κώδικα <b/>walk forwards</b> μας. Ο παράλληλος κώδικάς σας θα πρέπει να μοιάζει με αυτόν: <br/><br/><i/>Εάν χρειάζεστε βοήθεια, απλώς επιστρέψτε στα βήματα 4 και 5!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-11": "Κάντε κλικ στην πράσινη σημαία και παρακολουθήστε τι κάνει τώρα ο Marty... <b/>περπατάει πρώτος προς τα πίσω!</b><br/><br/> Αυτό συμβαίνει επειδή το λογισμικό του Marty χειρίζεται τις συνθήκες αγώνα αποκτώντας πρόσβαση και εκτελώντας πρώτα τον <b/>παλαιότερο</b> κώδικα.<br/><br/>Το πρόβλημα είναι ότι δεν μπορούμε απλώς να καταλάβουμε κοιτάζοντας ποιος κώδικας δημιουργήθηκε πρώτα, και καθώς γράφουμε πιο περίπλοκο κώδικα, τα πράγματα μπορεί να γίνουν μπερδεμένα!<br/><br/>Ας εξερευνήσουμε πώς μπορούμε να χρησιμοποιήσουμε <b/>συναρτήσεις αναμονής και μεταβλητές</b> για να ελέγξουμε τον παράλληλο κώδικά μας!<br/><br/><br/><i/>Κάντε κλικ στην εικόνα για να αναπτύξετε το διάγραμμα.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-12": "Όπως μάθαμε και πριν, οι προγραμματιστές παρακάμπτουν τις συνθήκες ανταγωνισμού χρησιμοποιώντας αμοιβαίο αποκλεισμό. <br/><br/>Αυτό σημαίνει ότι μπορούμε να πατήσουμε \"έναρξη\" και στα δύο κομμάτια κώδικα ταυτόχρονα, αλλά μπορούμε να ελέγξουμε ποια ενέργεια <b/>θα γίνει στην πραγματικότητα</b> πρώτα. <br/><br/>Πρώτα, θα χρησιμοποιήσουμε ένα μπλοκ αναμονής για να αποκλείσουμε αμοιβαία τον κώδικά μας. <br/><br/><br/><i/>Κάντε κλικ στην εικόνα για να αναπτύξετε το διάγραμμα.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-13": "Ας πούμε στον Marty να περπατήσει μπροστά και μετά προς τα πίσω. <br/><br/>Ο Marty χρειάζεται περίπου 3 δευτερόλεπτα για να περπατήσει μπροστά, επομένως θα τοποθετήσουμε ένα μπλοκ αναμονής πριν από το \"walk backwards\" και θα αλλάξουμε την παράμετρο σε 3 δευτερόλεπτα, ταιριάζοντας με το παρακάτω δείγμα κώδικα.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-14": "Κάντε κλικ στην πράσινη σημαία και παρακολουθήστε πώς ο Μάρτι προχωρά πρώτος, ακριβώς όπως θέλαμε! <br/><br/>Γνωρίζουμε λοιπόν ότι η χρήση μπλοκ αναμονής μπορεί να μας βοηθήσει με τον αμοιβαίο αποκλεισμό, αλλά για μεγαλύτερο και πιο περίπλοκο κώδικα δεν είναι τόσο καλή. <br/><br/>Ο χρόνος που χρειάζεται ο κώδικας για να εκτελεστεί μπορεί να είναι ποικίλος και πολύπλοκος, καθιστώντας δύσκολη την ακριβή πρόβλεψη του χρόνου αναμονής. <br/><br/>Ας δούμε τη χρήση του <b/>ελέγχου μεταβλητών</b> για μια πιο ακριβή μέθοδο αμοιβαίου αποκλεισμού.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-15": "Θα χρησιμοποιήσουμε μια μεταβλητή που ονομάζεται \"επόμενη κίνηση\" για να αποκλείσουμε αμοιβαία τον κώδικά μας \"περπάτημα προς τα πίσω\" και \"περπάτημα προς τα εμπρός\". <br/><br/>Παρόλο που και τα δύο μπλοκ κώδικα θα εκτελούνται όταν κάνουμε κλικ στην πράσινη σημαία, μπορούμε να πούμε: <br/><br/>Μην <i/>κάνετε στην πραγματικότητα</i> ένα βήμα μπροστά<b/> μέχρι η επόμενη κίνηση να = εμπρός.</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-18": "Αντί να περιμένουμε κάποια δευτερόλεπτα πριν περπατήσουμε, θέλουμε ο Μάρτι να <b/>περιμένει</b> μέχρι η επόμενη κίνηση να οριστεί στη σωστή τιμή: προς τα εμπρός ή προς τα πίσω. <br/><br/>Προσθέστε ένα μπλοκ αναμονής μέχρι πριν από κάθε μπλοκ περπατήματος, όπως φαίνεται εδώ:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-20": "Τώρα χρησιμοποιήστε τα πράσινα μπλοκ που ισοδυναμούν με \"ίσον\" για να συμπληρώσετε τα κενά μπλοκ <b/>περιμένετε μέχρι</b>, ώστε να ταιριάζουν με το παρακάτω δείγμα κώδικα:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-21": "Αν θέλουμε ο Μάρτι να περπατήσει πρώτος προς τα εμπρός, θα πρέπει να περπατήσει στη συνέχεια προς τα πίσω και αντίστροφα.<br/><br/>Έτσι, θέλουμε να χρησιμοποιήσουμε το μπλοκ set <b/>next move</b> για να αλλάξουμε την επόμενη κίνηση αφού περπατήσουμε.<br/><br/>Τοποθετήστε δύο από αυτά τα μπλοκ στο τέλος κάθε τμήματος κώδικα και πληκτρολογήστε \"forwards\" ή \"backwards\" σε κάθε ένα, για να ταιριάζει με το παρακάτω δείγμα κώδικα:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-22": "Τέλος, επιλέξτε ένα μπλοκ <b/>ορισμός επόμενης κίνησης σε</b> για να ορίσετε αν θέλουμε ο Marty να προχωρήσει πρώτος προς τα εμπρός ή προς τα πίσω.<br/><br/> Ας υποθέσουμε ότι θέλουμε ο Marty να περπατήσει πρώτος προς τα πίσω - πληκτρολογήστε \"backwards\" στον χώρο παραμέτρων και κάντε κλικ στο μπλοκ έτσι ώστε η επόμενη κίνηση να οριστεί σε προς τα πίσω.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.description": "Ας χρησιμοποιήσουμε παράλληλο προγραμματισμό με έλεγχο μεταβλητών για να βοηθήσουμε τον Μάρτι να αναδείξει όλα τα αστεία πρόσωπά του!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-1": "Τώρα που είμαστε ειδικοί στον μεταβλητό έλεγχο παράλληλων προγραμμάτων, ας εφαρμόσουμε τις γνώσεις μας στην πράξη βοηθώντας τον Μάρτι να δείξει όλα τα αστεία του πρόσωπα!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-2": "Επιλέξτε δύο πράσινα μπλοκ σημαίας.<br/><br/>Όταν κάνετε κλικ στην πράσινη σημαία, και τα δύο αυτά μπλοκ θα ενεργοποιηθούν και θα εκτελέσουν όλο τον κώδικα από κάτω τους ταυτόχρονα, παράλληλα.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-3": "Τώρα ας προσθέσουμε μερικούς από τους εκφραστικούς ήχους του Marty, τον έναν μετά τον άλλον, κάτω από ένα πράσινο μπλοκ σημαίας.<br/><br/> Θέλουμε να γράψουμε κώδικα που να λέει: <br/><i/> Όταν κάνει κλικ στην πράσινη σημαία <br/> Αναπαραγωγή ήχου: Δυσπιστία μέχρι να ολοκληρωθεί <br/> Αναπαραγωγή ήχου: Όχι! μέχρι να ολοκληρωθεί <br/> Αναπαραγωγή ήχου: Ενθουσιασμένος μέχρι να ολοκληρωθεί</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-4": "Ας τοποθετήσουμε το πρώτο μας ηχητικό μπλοκ κάτω από ένα από τα πράσινα μπλοκ σημαίας.<br/><br/>Χρησιμοποιήστε το αναπτυσσόμενο πλαίσιο για να επιλέξετε \"Δυσπιστία\", για να συνοδεύσετε το έκπληκτο πρόσωπο του Μάρτι!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-6": "Τώρα ας τοποθετήσουμε το τελευταίο ηχητικό μπλοκ. <br/><br/>Χρησιμοποιήστε το αναπτυσσόμενο πλαίσιο για να επιλέξετε \"Ενθουσιασμένος\", για να ταιριάζει με το ενθουσιασμένο πρόσωπο του Μάρτι!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-8": "Ας τοποθετήσουμε το πρώτο μας μπλοκ <b/>ματιών</b> κάτω από το δεύτερο μπλοκ πράσινης σημαίας όπως φαίνεται. <br/><br/>Χρησιμοποιήστε το αναπτυσσόμενο πλαίσιο για να επιλέξετε \"Πλατύ\", για να δείξετε το έκπληκτο πρόσωπο του Μάρτι!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-11": "Ας δοκιμάσουμε τον κώδικά μας. <br/><br/>Πατήστε το πράσινο μπλοκ με τη σημαία και δείτε αν οι εκφράσεις του Marty ταιριάζουν με τον σωστό ήχο... <br/><br/>Ταιριάζουν; <b/>όχι!</b> <br/><br/>Αυτό συμβαίνει επειδή οι ήχοι και οι εκφράσεις χρειάζονται <b/>διαφορετικό χρόνο.</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-13": "Μεταβείτε στην καρτέλα Μεταβλητές και δημιουργήστε μια μεταβλητή με το όνομα <b/>Ο Marty αισθάνεται</b> <br/><br/>Θα τη χρησιμοποιήσουμε για να βεβαιωθούμε ότι ο Marty κάνει τη σωστή έκφραση και ήχο ταυτόχρονα.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-17": "Για να συγχρονίσουμε τις μεταβλητές μας με τις εκφράσεις και τους ήχους του Marty, θα τοποθετήσουμε ένα μπλοκ <b/>wait until</b> πριν από κάθε έκφραση. <br/><br/>Τοποθετήστε τρία μπλοκ <b/>wait until</b> όπως φαίνεται παρακάτω:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-18": "Θέλουμε ο Μάρτι να <b/>περιμένει</b> μέχρι ο Μάρτι να νιώσει = έκπληκτος και να ανοίξει τα μάτια του διάπλατα, για παράδειγμα <br/><br/>Επιλέξτε τρεις τελεστές ίσον και συμπληρώστε τους όπως φαίνεται παρακάτω. <br/>Μπορείτε να λάβετε τα τρία μπλοκ <b/>Marty feels</b> από την πορτοκαλί καρτέλα Μεταβλητές.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-19": "Τέλος, θα προσθέσουμε τα μπλοκ αναμονής με τα σχετικά μπλοκ ίσων με αυτά που φαίνονται παρακάτω:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-20": "Τα κατάφερες - τέλεια!<br/>Τώρα κάνε κλικ στην πράσινη σημαία και παρακολούθησε τον κώδικά σου να λειτουργεί παράλληλα!<br/><br/>Κάθε έκφραση και ήχος ταιριάζουν καθώς χρησιμοποιούμε τον <b/>μεταβλητό έλεγχο για τον συγχρονισμό</b> των αστείων προσώπων του Marty!. <br/><i/>Ο Marty είναι έκπληκτος! <br/>Ο Marty είναι θυμωμένος! <br/>Ο Marty είναι ενθουσιασμένος!</i> <br/><br/>Επιπλέον πρόκληση - πόσα αστεία πρόσωπα μπορείς να κάνεις τον Marty να τραβήξει χρησιμοποιώντας τον μεταβλητό έλεγχο;",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-1": "Σε αυτό το σεμινάριο, θα αναδημιουργήσουμε την αποσυνδεδεμένη λειτουργία χρησιμοποιώντας όλα όσα έχουμε μάθει μέχρι τώρα!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-2": "Πριν ξεκινήσετε αυτό το σεμινάριο, παίξτε λίγο με τη λειτουργία αποσύνδεσης για να θυμηθείτε πώς λειτουργεί. <br/><br/>Αποσυνδέστε το Marty σας από την εφαρμογή και κάντε κλικ στην επιλογή \"λειτουργία\" στο πίσω μέρος του Marty σας για να μεταβείτε σε λειτουργία αποσύνδεσης.<br/><br/>Συλλέξτε ένα από κάθε πλακίδιο χρώματος για να δοκιμάσετε τον αισθητήρα χρώματος του Marty σας, δείτε πώς λειτουργεί η λειτουργία αποσύνδεσης και, στη συνέχεια, επανασυνδέστε το Marty σας και επιστρέψτε σε αυτό το σεμινάριο!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-3": "Ας ξεκινήσουμε!<br/><br/>Θα δημιουργήσουμε 5 παράλληλα προγράμματα για να ελέγχουμε κάθε χρώμα σε λειτουργία χωρίς σύνδεση στην πρίζα:<br/><b/>πράσινο</b> σημαίνει περπάτημα <b/>μπροστά</b>, <br/><b/>κίτρινο</b> σημαίνει περπάτημα <b/>πίσω</b>, <br/><b/>μωβ</b> σημαίνει ολίσθηση <b/>δεξιά</b>, <br/><b/>μπλε</b> σημαίνει ολίσθηση <b/>αριστερά</b>, <br/><b/>κόκκινο</b> σημαίνει <b/>σταμάτα και γιόρτασε!</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-4": "Αρχικά, τοποθετήστε 5 πράσινα μπλοκ σημαίας στην περιοχή scripting, ένα για κάθε πλακίδιο χρώματος στο unplugged.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-5": "Δεν θέλουμε ο Μάρτι να ελέγχει τον αισθητήρα χρώματος μόνο μία φορά, θέλουμε να ελέγχει ξανά και ξανά για να κάνει τη σωστή ενέργεια. <br/><br/>Λοιπόν, ας τοποθετήσουμε έναν βρόχο αέναης επανάληψης κάτω από κάθε πράσινο μπλοκ σημαίας.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-6": "Για κάθε μπλοκ κώδικα, θέλουμε να πούμε:<br/><br/><i/><b/>Εάν</b> ο Marty ανιχνεύσει το χρώμα πράσινο/μπλε/κόκκινο/μωβ/κίτρινο, <b/>τότε</b> εκτελεί την σχετική ενέργεια.</i><br/><br/>Ας τοποθετήσουμε λοιπόν μια εντολή if σε κάθε βρόχο forever.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-7": "Σε κάθε μπλοκ κώδικα, θέλουμε να ελέγξουμε αν, για παράδειγμα <b/>αισθητήρας χρώματος = πράσινο</b> πριν πούμε στον Marty να προχωρήσει μπροστά. <br/><br/> Για να το κάνουμε αυτό, θα τοποθετήσουμε έναν τελεστή ίσον σε κάθε πρόταση if και θα τις συμπληρώσουμε με ένα unplugged χρώμα η καθεμία. <br/><br/>Ο κώδικά σας θα πρέπει να μοιάζει με αυτό:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-8": "Για να ολοκληρώσετε κάθε εντολή if, τοποθετήστε ένα μπλοκ ανίχνευσης χρώματος σε κάθε τελεστή ίσον όπως φαίνεται. <br/><br/>Βεβαιωθείτε ότι χρησιμοποιείτε το αναπτυσσόμενο μενού για να επιλέξετε το <i/>LeftColorSensor</i>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-9": "Τέλεια! Τώρα, θέλουμε ο Marty να <b/>επαναλαμβάνει</b> τη σωστή ενέργεια <b/>μέχρι</b> να βρίσκεται σε διαφορετική κάρτα. <br/><br/>Για να το κάνουμε αυτό, θα χρησιμοποιήσουμε ένα μπλοκ <b/>επανάληψη μέχρι</b>.<br/><br/>Τοποθετήστε ένα μέσα σε κάθε δήλωση if όπως φαίνεται εδώ:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-13": "Μέσα στο μπλοκ κώδικα που ανιχνεύει μωβ, τοποθετήστε <b/>σύρετε 1 φορά προς τα δεξιά</b> μέσα στο μπλοκ επανάληψης μέχρι, όπως φαίνεται εδώ. <br/><br/><br/><i/>Θυμηθείτε να χρησιμοποιήσετε το αναπτυσσόμενο πλαίσιο για να αλλάξετε από αριστερά προς τα δεξιά!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-14": "Μέσα στο μπλοκ κώδικα που ανιχνεύει το μπλε, τοποθετήστε <b/>το slide 1 φορά προς τα αριστερά</b> μέσα στο μπλοκ επανάληψης μέχρι, όπως φαίνεται εδώ.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-15": "Μέσα στο μπλοκ κώδικα που ανιχνεύει το κίτρινο, τοποθετήστε το <b/>περπάτημα προς τα πίσω δύο βήματα</b> μέσα στο μπλοκ επανάληψης μέχρι, όπως φαίνεται εδώ:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-16": "Σχεδόν έτοιμο!<br/><br/>Μέσα στο μπλοκ κώδικα που ανιχνεύει το κόκκινο, τοποθετήστε μια κίνηση <b/>παύσης</b> και ένα μπλοκ <b/>χορού</b> μέσα στο μπλοκ επανάληψης μέχρι, όπως φαίνεται εδώ:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-17": "Αλλά περιμένετε - ο Μάρτι δεν μπορεί να χορέψει χωρίς μουσική!<br/><br/>Ανάμεσα στα μπλοκ παύσης και χορού, τοποθετήστε τον <b/>ήχο έναρξης</b> και χρησιμοποιήστε το αναπτυσσόμενο πλαίσιο για να επιλέξετε </b>γιορτάζω</b>!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-18": "Τέλος, θέλουμε ο Marty να σταματήσει όλο τον κώδικα μόλις τελειώσει τους εορτασμούς.<br/><br/>Τοποθετήστε ένα μπλοκ <b/>διακοπής όλων</b> μετά το μπλοκ χορού.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-20": "Τοποθετήστε ένα μπλοκ <b/>Select LED eyes to</b> μέσα στην πρόταση if, αλλά πάνω από το μπλοκ repeat until</b> σε κάθε κομμάτι κώδικα. <br/><br/>Αλλάξτε το χρώμα LED στο σχετικό χρώμα για αυτό το μπλοκ και φροντίστε να χρησιμοποιήσετε το αναπτυσσόμενο πλαίσιο για να επιλέξετε και τα δύο μάτια. <br/><br/>Ο κώδικάς σας θα πρέπει να μοιάζει με αυτό:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-21": "Μπορούμε να βρούμε τον ήχο \"μπιπ μπιπ!\" του Marty στη βιβλιοθήκη ήχων, που ονομάζεται <b/>Arcade Beep</b>.<br/><br/>Αντιγράψτε το παρακάτω κλιπ για να εντοπίσετε τη συνάρτηση <b/>Arcade Beep</b> στους Ήχους.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-22": "Τοποθετήστε ένα μπλοκ <b/>Έναρξη ήχου: Arcade Beep</b> μετά από κάθε μπλοκ ματιού LED και πριν από κάθε μπλοκ επανάληψης. <br/><br/>Ο κώδικάς σας θα πρέπει να μοιάζει με αυτό:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.description": "Ας μάθουμε πώς οι προγραμματιστές χρησιμοποιούν λίστες για να κάνουν τόσα πολλά ενδιαφέροντα πράγματα!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-1": "Σε αυτό το σεμινάριο, θα μάθουμε τα πάντα για τις λίστες!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-2": "Λοιπόν, όσον αφορά τον προγραμματισμό, <b/>τι είναι μια λίστα;</b> <br/><br/>Οι προγραμματιστές χρησιμοποιούν λίστες, που μερικές φορές ονομάζονται πίνακες, για να αποθηκεύουν δεδομένα με συγκεκριμένη σειρά. <br/><br/>Οι προγραμματιστές μπορούν να ελέγχουν τον τρόπο με τον οποίο προστίθενται, αφαιρούνται και αποθηκεύονται τα δεδομένα στη λίστα, καθώς και να αναφέρουν τα δεδομένα με βάση τον αριθμό τους στη λίστα (που ονομάζεται ευρετήριο).",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-4": "Σε αυτό το σεμινάριο, θα χρησιμοποιήσουμε μια λίστα για να βοηθήσουμε τον Marty να απομνημονεύσει μια σειρά από πλακίδια χρώματος πάνω στα οποία περπατάει.<br/><br/>Πριν ξεκινήσουμε τον προγραμματισμό, θα χρειαστείτε 4 πλακίδια λειτουργίας χωρίς σύνδεση, τα οποία θα είναι τοποθετημένα σε μια γραμμή ως εξής:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-5": "Μεταβείτε στην καρτέλα Μεταβλητές και κάντε κλικ στην επιλογή \"Δημιουργία λίστας\". <br/><br/>Ονομάστε τη λίστα \"χρώματα\" και κάντε κλικ στην επιλογή \"ok\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-6": "Κάθε φορά που ο Μάρτι προχωρά σε ένα νέο πλακίδιο, θα προσθέτουμε το χρώμα από τον αισθητήρα χρώματος στη λίστα \"χρώματα\".<br/><br/>Επιλέξτε το μπλοκ <b/>προσθήκη πράγματος στα χρώματα</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-10": "Δεδομένου ότι θέλουμε να επαναλάβουμε αυτόν τον κώδικα για καθένα από τα 4 πλακίδια χρώματος, ας προσθέσουμε έναν βρόχο <b/>επανάληψης</b> γύρω από τον κώδικα. <br/><br/>Αλλάξτε το <b/>10</b> σε <b/>4</b> για να επαναλάβετε τον κώδικα 4 φορές.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-11": "Τώρα ας κάνουμε τον Marty να χρησιμοποιήσει τα μάτια LED του για να μας πει ποια χρώματα έχει δει. <br/><br/>Επιλέξτε 4 <b/>Ορίστε τα επιλεγμένα μάτια LED σε</b> μπλοκ και τοποθετήστε τα μετά τον επαναλαμβανόμενο βρόχο. <br/><br/>Χρησιμοποιήστε το αναπτυσσόμενο πλαίσιο για να επιλέξετε και τα δύο μάτια.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-12": "Μπράβο! Τώρα ας αλλάξουμε τα LED του Marty σε όλα τα χρώματα της λίστας μας. <br/><br/>Πλοηγηθείτε στην καρτέλα Μεταβλητές και επιλέξτε το μπλοκ <b/>στοιχείο 1 χρωμάτων</b>. <br/><br/>Αντικαταστήστε τον έγχρωμο κύκλο με το <b/>στοιχείο 1 χρωμάτων</b> και αλλάξτε τον αριθμό σε 1, 2, 3 και 4 όπως φαίνεται εδώ:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-13": "Σχεδόν έτοιμο! <br/><br/>Προσθέστε ένα μπλοκ αναμονής <b/>1 δευτερολέπτου</b> πριν από κάθε μπλοκ LED όπως παρακάτω, για να έχετε αρκετό χρόνο για κάθε αλλαγή χρώματος.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-14": "Τα κατάφερες! <br/><br/>Τώρα τοποθέτησε τον Μάρτι σου στην αρχή της σειράς των πλακιδίων σου, όπως φαίνεται εδώ, και δες τον Μάρτι να θυμάται κάθε χρώμα!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.description": "Ας μάθουμε πώς οι προγραμματιστές χρησιμοποιούν λίστες για να κάνουν τόσα πολλά ενδιαφέροντα πράγματα!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-1": "Σε αυτό το σεμινάριο, θα χρησιμοποιήσουμε μια <b/>λίστα</b> για να γράψουμε τη λίστα αγορών του Marty.<br/><br/>Στη συνέχεια, θα γράψουμε κώδικα σε έναν <b/>επαναληπτικό βρόχο</b> για να κάνουμε τον Marty να διαβάσει τη λίστα αγορών του δυνατά!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-3": "Το πρώτο πράγμα που χρειάζεται να αγοράσει ο Μάρτι είναι μπαταρίες. <br/><br/>Επιλέξτε το μπλοκ <b/>προσθήκη πράγματος στη λίστα αγορών του Μάρτι</b>. <br/><br/>Αντί για <b/>πράγμα</b>, γράψτε <b/>μπαταρίες</b>. Κάντε κλικ στο μπλοκ και παρακολουθήστε τις μπαταρίες να εμφανίζονται στη λίστα.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-4": "Το επόμενο πράγμα που χρειάζεται ο Μάρτι είναι καλώδια!<br/><br/>Διατηρώντας το ίδιο μπλοκ όπως πριν, αλλάξτε τις <b/>μπαταρίες</b> σε <b/>καλώδια</b> και κάντε κλικ στο μπλοκ.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-6": "Ο Μάρτι λέει ότι το πιο σημαντικό πράγμα που χρειάζεται να αγοράσει είναι γλυκά!<br/><br/>Επιλέξτε το <b/>εισαγάγετε το πράγμα στο 1 του μπλοκ της Λίστας Αγορών του Μάρτι</b>.<br/><br/>Αντί για <b/>πράγμα</b>, γράψτε <b/>γλυκά</b>, κάντε κλικ στο μπλοκ και δείτε τα γλυκά να εμφανίζονται στον αριθμό 1 της λίστας!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-7": "Το ωραίο με τις λίστες είναι ότι κάνουν τη σύνταξη κώδικα εξαιρετικά εύκολη! <br/><br/>Και τα δύο αυτά μπλοκ κώδικα διαβάζουν τα ψώνια του Marty. <br/><br/>Ωστόσο, αν δεν χρησιμοποιήσουμε μια λίστα, όπως στα αριστερά, θα πρέπει να αλλάζουμε αυτόν τον κώδικα κάθε φορά που αλλάζουν τα ψώνια του Marty. <br/><br/>Αν χρησιμοποιήσουμε μια λίστα, όπως στα δεξιά, μπορούμε να γράψουμε κώδικα που λειτουργεί συνεχώς - ανεξάρτητα από το πόσο μεγάλη είναι η λίστα ή τι προστίθεται/αφαιρείται!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-8": "Θα γράψουμε αυτόν τον κώδικα που μπορούμε να χρησιμοποιήσουμε για οποιαδήποτε λίστα! <br/><br/>Ανεξάρτητα από το πώς αλλάζουμε τη λίστα, ο Marty μπορεί να την διαβάσει δυνατά με αυτόν τον κώδικα! <br/><br/>Αυτός ο επαναλαμβανόμενος βρόχος είναι ειδικός - οι προγραμματιστές τους ονομάζουν <b/>επαναληπτικούς βρόχους</b> <br/><br/>Επανάληψη σημαίνει επανάληψη της ίδιας εργασίας, αλλάζοντας κάτι κάθε φορά μέχρι να ικανοποιηθεί μια συνθήκη. <br/><br/>Εδώ μπορείτε να δείτε την <b/>επαναλαμβανόμενη εργασία</b>, τη <b/>συνθήκη</b> και την <b/>επαναλαμβανόμενη αλλαγή</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-10": "Ας δημιουργήσουμε τη μεταβλητή <b/>αριθμός αντικειμένου</b> την οποία θα χρησιμοποιήσουμε για να περιηγηθούμε στη λίστα αγορών του Marty. <br/><br/>Μεταβείτε στην καρτέλα μεταβλητών, επιλέξτε Δημιουργία μεταβλητής, ονομάστε την <b/>αριθμός αντικειμένου</b> και κάντε κλικ στο \"ok\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-11": "Ας ρυθμίσουμε την επαναλαμβανόμενη εργασία μέσα στον επαναληπτικό μας βρόχο: Ο Marty διαβάζει στοιχεία από τη λίστα του. <br/><br/>Μεταβείτε στην καρτέλα Ομιλία, επιλέξτε ένα μπλοκ <b/>Ο Marty μιλάει</b> και τοποθετήστε το μέσα στον βρόχο επανάληψης.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-12": "Δεν θέλουμε να μας χαιρετήσει ο Μάρτι, θέλουμε να διαβάσει ένα στοιχείο από τη λίστα. <br/><br/>Πλοηγηθείτε στην καρτέλα Μεταβλητές και επιλέξτε το <b/>στοιχείο 1 από το μπλοκ Λίστα Αγορών του Μάρτι</b> και τοποθετήστε το όπως φαίνεται. <br/><br/>Αντικαταστήστε τον αριθμό 1 με τη μεταβλητή <b/>αριθμός στοιχείου</b>. <br/><br/>Μπράβο! Τώρα, αν ο αριθμός στοιχείου = 3, ο Μάρτι θα έλεγε \"σύρματα\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-13": "Τώρα ας προσθέσουμε την επαναλαμβανόμενη αλλαγή στον βρόχο μας.<br/><br/>Σε κάθε βρόχο, θέλουμε να προσθέσουμε ένα στη μεταβλητή <b/>item number</b>.<br/><br/>Τοποθετήστε το μπλοκ <b/>change item number κατά 1</b> μετά το μπλοκ εκφώνησης όπως φαίνεται:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-14": "Τέλος, θα ορίσουμε τη συνθήκη του επαναληπτικού μας βρόχου - <i/>επανάληψη μέχρι: ο αριθμός αντικειμένου είναι μεγαλύτερος από τη Λίστα Αγορών του Μάρτι</i> <br/><br/>Τοποθετήστε έναν τελεστή μεγαλύτερο από μέσα στην εντολή επανάληψη μέχρι όπως φαίνεται.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-15": "Μεταβείτε στην καρτέλα Μεταβλητές και συμπληρώστε το μπλοκ \"μεγαλύτερο από\" όπως φαίνεται, ώστε να έχει ως εξής: <br/><br/><i/>επαναλάβετε μέχρι: ο αριθμός αντικειμένου να είναι μεγαλύτερος από τη Λίστα Αγορών του Marty</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-16": "Τα καταφέρατε! <br/><br/>Πριν δοκιμάσουμε τον κώδικά μας, βεβαιωθείτε ότι η μεταβλητή αριθμού στοιχείου έχει οριστεί σε μηδέν - εάν όχι, μπορείτε να την επαναφέρετε χρησιμοποιώντας αυτό το μπλοκ.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-17": "Τέλεια, τώρα κάντε κλικ στον κώδικά σας και ακούστε τον Marty να μας λέει τη λίστα αγορών του! <br/><br/>Έχετε μάθει τα πάντα για τις λίστες, την προσθήκη και την αφαίρεση στοιχείων, τη χρήση των αριθμών στοιχείων τους στον κώδικα, ακόμη και πώς να τις επαναλαμβάνετε!",
  "gui.menuBar.sensorsDashboard": "Πίνακας Αισθητήρων",
  "gui.menuBar.showCode": "Εμφάνιση κωδικού",
  "gui.gui.toggleMartyMachineTab": "Μηχανική Μάθηση",
  "gui.gui.toggleSaveLoadTab": "Αποθήκευση/Φόρτωση",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.name": "Αλληλεπίδραση Cog και Marty",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.description": "Μάθετε πώς το <b>Cog</b> και ο <b>Marty</b> μπορούν να αλληλεπιδράσουν μεταξύ τους",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1": "Σε αυτό το σεμινάριο θα μάθουμε πώς το <b>Cog</b> και ο <b>Marty</b> μπορούν να αλληλεπιδράσουν μεταξύ τους. Πατήστε «Επόμενο» για να ξεκινήσετε!",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1": "Αρχικά, ας συνδεθούμε στο Cog. Κάντε κλικ στο κουμπί «Επιλέξτε συσκευή» και, στη συνέχεια, επιλέξτε το Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1.1": "Τέλεια! Τώρα κάντε κλικ στο κουμπί «Connect» για να συνδεθείτε στο Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2": "Στη συνέχεια, ας συνδεθούμε με τον Μάρτυ. Κάντε κλικ στο κουμπί «Επιλέξτε συσκευή» και, στη συνέχεια, επιλέξτε Marty",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2.1": "Τέλεια! Τώρα κάντε κλικ στο κουμπί 'Connect' για να συνδεθείτε με τον Marty",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-2": "Τώρα που συνδεθήκαμε με τα ρομπότ, ας ξεκινήσουμε την εγγραφή κώδικα! Για να δείτε τα μπλοκ του Cog, κάντε κλικ στο κουμπί συσκευής Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3": "Αφού επιλέξετε τα μπλοκ Cog, σύρετε το μπλοκ συμβάντων 'με το πάτημα του κουμπιού' στην περιοχή του κώδικα. Αυτό το μπλοκ θα εκτελεστεί όταν πατηθεί το κουμπί του Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3.hint": "Το μπλοκ συμβάντων \"με το πάτημα του κουμπιού\" βρίσκεται στην κατηγορία Συμβάντα. Σύρετε το στην περιοχή του κώδικα",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5": "Τώρα σύρετε το μπλοκ \"μετάδοσε μήνυμα\" από την κατηγορία Συμβάντα στην περιοχή του κώδικα. Αυτό το μπλοκ θα μεταδώσει ένα μήνυμα όταν πατηθεί το κουμπί του Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5.hint": "Το μπλοκ \"μετάδοσε μήνυμα\" βρίσκεται στην κατηγορία Συμβάντα. Σύρετε το στην περιοχή του κώδικα",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-6": "Τώρα ας περάσουμε στον Μάρτυ. Πρέπει να επιλέξουμε τον Marty για να δούμε τα μπλοκ του Marty. Κάντε κλικ στο κουμπί συσκευής Marty",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7": "Μόλις μπείτε στη λειτουργία Marty, σύρετε το μπλοκ \"Όταν λάβω μήνυμα\" από την κατηγορία Μπλοκ συμβάντων στην περιοχή του κώδικα. Αυτό το μπλοκ περιμένει να ακούσει μηνύματα που μεταδίδονται",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7.hint": "Το μπλοκ \"όταν λάβω μήνυμα\" βρίσκεται στην κατηγορία Συμβάντα. Σύρετε το στην περιοχή του κώδικα",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-9": "Είμαστε σχεδόν έτοιμοι! Σύρετε το μπλοκ \"Χόρεψε!\" στην περιοχή του κώδικα. Αυτό το μπλοκ θα κάνει τον Marty να χορέψει όταν ληφθεί το μήνυμα",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-10": "Τέλεια! Έχεις κάνει με επιτυχία τον Cog και τον Marty να αλληλεπιδρούν μεταξύ τους. Τώρα κάντε κλικ στο κουμπί του Cog για να δεις τον Marty να χορεύει!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.name": "Εισαγωγή στους ήχους και στα φώτα του Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.description": "Μάθετε πώς να προγραμματίζετε το Cog με μπλοκ, να κάνετε ήχους και φώτα που ενεργοποιούνται από την αλληλεπίδραση με το Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-1": "Ας μάθουμε πώς να προγραμματίζουμε το Cog με μπλοκ! <br /><br />Θα συνδεθούμε στο Cog και θα το κάνουμε να ανάβει και να κάνει ήχους όταν πατηθεί το κουμπί!<br /><br />Θα μάθουμε επίσης για τον κώδικα <b>σειράς</b> που εκτελείται ως ακολουθία και τον <b>παράλληλο</b> κώδικα που εκτελείται ταυτόχρονα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-2": "Αρχικά, ας συνδεθούμε στο Cog. Κάντε κλικ στο κουμπί «Επιλέξτε συσκευή» και, στη συνέχεια, επιλέξτε Cog. <br /><br /> Μπορείτε να παραλείψετε αυτό το βήμα εάν το Cog είναι ήδη συνδεδεμένο",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-3": "Τέλεια! Τώρα κάντε κλικ στο κουμπί 'Connect' για να συνδεθείτε στο Cog<br /><br>Ξανά, μπορείτε να το παραλείψετε εάν είστε ήδη συνδεδεμένοι σε ένα Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-4": "Τέλεια! Θα πρέπει τώρα να υπάρχει ενα Cog και να έχετε συνδεθεί μαζί του",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-5": "Επιλέξτε την κατηγορία Συμβάντα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6": "Προσθέστε ένα μπλοκ <b>με το πάτημα του κουμπιού</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6.hint": "Το μπλοκ συμβάντων «με το πάτημα του κουμπιού» βρίσκεται στην κατηγορία Συμβάντα. Σύρετε το στην περιοχή του κώδικα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-7": "Επιλέξτε την κατηγορία Όψεις",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8": "Προσθέστε ένα μπλοκ <b>Ρύθμισε τις λυχνίες LED [ring] σε [χρώμα]</b>, σύροντάς το για να συνδεθεί με το μπλοκ 'με το πάτημα του κουμπιού'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8.hint": "Το μπλοκ \"Ρύθμισε τις λυχνίες LED [ring] σε [χρώμα]\" ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το μπλοκ με 'το πάτημα του κουμπιού'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-9": "Δοκιμάστε το! <br /><br />Πατήστε το κουμπί του Cog και τα φώτα θα ανάψουν!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-10": "Αλλάξτε το χρώμα των λυχνιών LED κάνοντας κλικ στο χρώμα και στη συνέχεια σύροντας τη γραμμή χρώματος. <br /><br />Μπορείτε επίσης να αλλάξετε τον Κορεσμό (πόσο ζωντανό είναι ένα χρώμα) και τη Φωτεινότητα - εάν το ορίσετε στο 0, τα LED θα είναι απενεργοποιημένα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-11": "Δοκιμάστε το! <br /><br />Πατήστε το κουμπί στο Cog και τα φώτα θα αλλάξουν στο νέο χρώμα που επιλέξατε!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12": "Προσθέστε ένα μπλοκ <b>σε κίνηση</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12.hint": "Το μπλοκ συμβάντων \"σε κίνηση\" ανήκει στην κατηγορία Συμβάντα. Σύρετε το στην περιοχή του κώδικα μακριά από τον κώδικα που υπάρχει ήδη",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13": "Προσθέστε ένα μπλοκ <b>Απενεργοποιήστε όλες τις λυχνίες LED</b> κάτω από το μπλοκ σε κίνηση",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13.hint": "Το μπλοκ \"Απενεργοποιήστε όλες τις λυχνίες LED\" ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το μπλοκ 'σε κίνηση'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-14": "Δοκιμάστε το! <br /><br />Κουνήστε το Cog και τα φώτα πρέπει να σβήσουν!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-15": "Αλλάξτε το μπλοκ <b>Ρύθμισε τις λυχνίες LED [ring] σε [χρώμα]</b> για να ελέγξετε τη λυχνία LED του κουμπιού, επιλέγοντας «button» από το αναπτυσσόμενο μενού",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-16": "Δοκιμάστε το! <br /><br />Πατήστε το κουμπί στο Cog και τώρα το φως στο κουμπί πρέπει να ανάψει!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-17": "Ανακινήστε το Cog για να απενεργοποιήσετε τα LED<br /><br />Τώρα αλλάξτε το ίδιο αναπτυσσόμενο μενού για να επιλέξετε \"όλα\".",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-18": "Δοκιμάστε το! <br /><br />Πατήστε το κουμπί στο Cog και όλα τα φώτα πρέπει να ανάψουν!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19": "Προσθέστε ένα μπλοκ <b>Ρυθμίστε τις [ring] LED σε μοτίβο [Flash]</b> κάτω από το μπλοκ χρώματος 'Ρύθμισε τις λυχνίες LED [ring] σε [χρώμα]'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19.hint": "Το μπλοκ 'Ρυθμίστε τις [ring] LED σε μοτίβο [Flash]' ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το μπλοκ που ορίζει τα χρώματα LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-20": "Δοκιμάστε το! <br /><br />Πατήστε το κουμπί στο Cog και τώρα ο δακτύλιος των LED θα αρχίσει να αναβοσβήνει!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-21": "Αλλάξτε το μοτίβο σε 'Spin1' και δοκιμάστε το!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-22": "Δοκιμάστε τα άλλα μοτίβα στη λίστα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23": "Προσθέστε άλλα <b>Ρυθμίστε τις λυχνίες LED [δαχτυλιδιού] σε μοτίβο [Flash]</b> κάτω από το προηγούμενο και αλλάξτε το έτσι ώστε το κουμπί να αναβοσβήνει.<br /><br />Δοκιμάστε το πατώντας το κουμπί στο Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23.hint": "Το μπλοκ 'Ρυθμίστε [δακτυλίου] LED σε μοτίβο [Flash]' ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το μπλοκ που ορίζει τα χρώματα LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-24": "Διαγράψτε τον κωδικό κάτω από το μπλοκ 'με το πάτημα του κουμπιού' σύροντάς τον πίσω στην παλέτα με τα μπλοκ",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25": "Προσθέστε ένα μπλοκ <b>Ρυθμίστε τις λυχνίες LED χρησιμοποιώντας το ColorPicker</b> κάτω απο το μπλοκ με 'το πάτημα του κουμπιού'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25.hint": "Το μπλοκ «Ρυθμίστε τις λυχνίες LED χρησιμοποιώντας το ColorPicker» βρίσκεται στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το μπλοκ 'με το πάτημα του κουμπιού'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-26": "Αλλάξτε τα μεμονωμένα χρώματα LED χρησιμοποιώντας το ColorPicker».<br /><br />Πρώτα επιλέξτε ένα χρώμα χρησιμοποιώντας τον τροχό χρώματος και τα ρυθμιστικά κορεσμού και φωτεινότητας και, στη συνέχεια, επιλέξτε τα LED που θέλετε να ορίσετε σε αυτό το χρώμα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27": "Ρυθμίστε επίσης το χρώμα του κουμπιού προσθέτοντας ένα μπλοκ <b>Ορίστε τα LED [δαχτυλιδιού] στο [χρώμα]</b> και αλλάζοντας το για να ορίσετε το κουμπί στο αγαπημένο σας χρώμα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27.hint": "Το μπλοκ \"Ρυθμίστε [δακτυλίου] LED σε [χρώμα]\" ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το με τα LED Set χρησιμοποιώντας το μπλοκ ColorPicker",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-28": "Δοκιμάστε το! Πατήστε το κουμπί και τα φώτα θα αλλάξουν το καθένα στα χρώματα που επιλέξατε",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-29": "Επιλέξτε την κατηγορία Έλεγχος",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30": "Προσθέστε ένα μπλοκ <b>αναμονής [1] δευτερόλεπτα</b> κάτω από τα μπλοκ LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30.hint": "Το μπλοκ «αναμονή [1] δευτερόλεπτα» ανήκει στην κατηγορία Έλεγχος. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το κάτω από τα δύο μπλοκ που ορίζουν τα χρώματα LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31": "Προσθέστε άλλα <b>Ορίστε LED χρησιμοποιώντας το μπλοκ ColorPicker</b> κάτω από το μπλοκ αναμονής και, στη συνέχεια, αλλάξτε τα χρώματα σε ό,τι επιλέξετε",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31.hint": "Το μπλοκ «Ρυθμίστε τις λυχνίες LED χρησιμοποιώντας το ColorPicker» βρίσκεται στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το στο μπλοκ αναμονής που μόλις προσθέσατε και, στη συνέχεια, αλλάξτε τα χρώματα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32": "Αλλάξτε επίσης το χρώμα του κουμπιού προσθέτοντας ένα μπλοκ <b>Ρύθμισε τις λυχνίες LED [ring] σε [χρώμα]</b> και αλλάζοντας το για να ορίσετε το κουμπί στο αγαπημένο σας χρώμα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32.hint": "Το μπλοκ \"Ρυθμίστε [δακτυλίου] LED σε [χρώμα]\" ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το με τα τελευταία LED Set χρησιμοποιώντας το μπλοκ ColorPicker και, στη συνέχεια, επιλέξτε «κουμπί» από το αναπτυσσόμενο μενού",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-33": "Δοκιμάστε το! Πατήστε το κουμπί και τα φώτα θα ανάψουν και μετά θα αλλάξουν μετά από 1 δευτερόλεπτο!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34": "Προσθέστε ένα άλλο μπλοκ <b>με το πάτημα του κουμπιού</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34.hint": "Το μπλοκ συμβάντων «πάτημα κουμπιού» βρίσκεται στην κατηγορία Συμβάν. Σύρετε το στην περιοχή του κώδικα για να ξεκινήσετε την κωδικοποίηση",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-35": "Επιλέξτε την κατηγορία Ήχος",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36": "Προσθέστε ένα μπλοκ <b>Αναπαραγωγή σημείωσης [C4] για [1] δευτερόλεπτα</b> κάτω από το μπλοκ με το πάτημα του κουμπιού που μόλις προσθέσατε",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36.hint": "Το μπλοκ «Αναπαραγωγή σημείωσης [C4] για [1] δευτερόλεπτα» ανήκει στην κατηγορία Ήχος. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το στο νέο μπλοκ με το πάτημα του κουμπιού που προσθέσατε στο τελευταίο βήμα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-37": "Αλλάξτε τη σημείωση σε C5 και δοκιμάστε την πατώντας το κουμπί στο Cog!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38": "Προσθέστε έναν τόνο <b>Αναπαραγωγή από [200] έως [300] Hz για [3] δευτερόλεπτα</b> μεταξύ του μπλοκ On Button Push και του Play Note",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38.hint": "Το μπλοκ «Ήχος αναπαραγωγής από [200] έως [300] Hz για [3] δευτερόλεπτα» ανήκει στην κατηγορία Ήχος. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το μεταξύ του μπλοκ με το πάτημα του κουμπιού και της σημείωσης αναπαραγωγής που προσθέσατε στο τελευταίο βήμα",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-39": "Αλλάξτε τους αριθμούς στο μπλοκ Play Tone για να μεταβείτε από τα 260 στα 523 Hz για 1 δευτερόλεπτο.<br /><br />Κάθε μουσική νότα έχει μια συχνότητα και τα 523 Hz είναι η συχνότητα C5 - C στην πέμπτη οκτάβα.<br /><br />Δοκιμάστε το πατώντας το κουμπί στο Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-40": "Όταν πατάτε το κουμπί, οι ήχοι και τα φώτα εμφανίζονται ταυτόχρονα - λέμε ότι τρέχουν <b>παράλληλα</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-41": "Οι μεμονωμένοι ήχοι και τα φώτα συμβαίνουν ο ένας μετά τον άλλο - λέμε ότι εκτελούνται σε <b>σειρά</b> ή σε μια σειρά",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-42": "Μεγάλη δουλειά! Έχετε μάθει πώς να προγραμματίζετε το Cog, να το κάνετε να ανταποκρίνεται στα πατήματα και τα κουνήματα των κουμπιών και να κάνει ήχους και φώτα!».",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.name": "Φτιάξτε ένα ζάρι 13 όψεων!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.description": "Θα μετατρέψουμε το Cog σε ζάρι, δείχνοντας διαφορετικό αριθμό φώτων κάθε φορά που το κουνάτε!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-1": "Ας προγραμματίσουμε το Cog να είναι κάτι χρήσιμο - ένα ζάρι!<br /><br />Θα κάνουμε το γρανάζι να αντιδρά στο κούνημα δείχνοντας έναν τυχαίο αριθμό φώτων και κάνοντας τον ίδιο αριθμό μπιπ<br /><br />Για να το κάνουμε αυτό, θα μάθουμε για τις <b>Μεταβλητές</b> - ειδικά μπλοκ που μπορούν να <i>αλλάξουν την τιμή, την τιμή</i> και την τιμή <b> μια απόφαση!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-2": "Πρώτα, βεβαιωθείτε ότι είστε συνδεδεμένοι σε ένα γρανάζι.<br /><br />Εάν όχι, προσθέστε ένα όπως κάνατε στον προηγούμενο σεμινάριο πατώντας το κουμπί Προσθήκη στον πίνακα συσκευών και επιλέγοντας ένα γρανάζι και, στη συνέχεια, κάνοντας κλικ στη σύνδεση. Εάν χρειάζεται, επιστρέψτε στον τελευταίο οδηγό για να δείτε πώς",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-3": "Προσθέστε ένα μπλοκ συμβάντων <b>σε κίνηση</b> από την κατηγορία <b>Εκδηλώσεις</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-4": "Επιλέξτε την κατηγορία <b>Μεταβλητές</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-5": "Κάντε κλικ στο κουμπί <b>Δημιουργία μεταβλητής</b><br /><br />Ορίστε το όνομα της νέας μεταβλητής σε <b>ledID</b> και πατήστε OK",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-6": "Επιλέξτε την κατηγορία <b>Έλεγχος</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7": "Προσθέστε ένα μπλοκ <b>επανάληψης</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7.hint": "Το μπλοκ \"επανάληψη\" βρίσκεται στην κατηγορία Έλεγχος. Σύρετε το στην περιοχή του κώδικα έτσι ώστε να συνδεθεί με το στο μπλοκ σε κίνηση",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8": "Μεταβείτε στην κατηγορία <b>Όψεις</b> και προσθέστε ένα μπλοκ <b>Ρύθμιση LED [1] σε [χρώμα]</b> μέσα στο μπλοκ επανάληψης<br /><br />Αλλάξτε το χρώμα στο αγαπημένο σας χρώμα :-)",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8.hint": "Το μπλοκ «ορισμός LED [1] σε [χρώμα]» ανήκει στην κατηγορία Όψεις. Σύρετε το στην περιοχή του κώδικα και τοποθετήστε το έτσι ώστε να ασφαλίσει μέσα στο μπλοκ επανάληψης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-9": "Δοκιμάστε το! <br /><br />Τι θα συμβεί αν κουνήσετε το γρανάζι;",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10": "Επιστρέψτε στην κατηγορία <b>Μεταβλητές</b> και προσθέστε ένα μπλοκ <b>Αλλαγή [ledID] κατά [1]</b> αμέσως μετά το μπλοκ LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10.hint": "Το μπλοκ 'Change [ledID] by [1]' ανήκει στην κατηγορία Variables. Σύρετε το στην περιοχή του κώδικα και τοποθετήστε το έτσι ώστε να κουμπώσει μέσα στο μπλοκ επανάληψης, ακριβώς μετά το μπλοκ Set LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-11": "Σύρετε τη μεταβλητή <b>ledID</b> στο μπλοκ <b>Ορισμός LED</b>, ώστε να διαβάζει <b>Ορισμός LED <i>ledID</i> σε [χρώμα]</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-12": "Δοκιμάστε το!<br /><br />Τι θα συμβεί αν τινάξετε το Cog;",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-13": "Δοκιμάστε το ξανά - θα ανάψουν περισσότερες λυχνίες LED!<br /><br />Αλλά αν ανακινήσετε το Cog <i>ξανά</i> μετά από αυτό, δεν θα συμβεί τίποτα νέο. Ας το αλλάξουμε!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14": "Προσθέστε ένα μπλοκ <b>Ορίστε το [ledID] σε [0]</b> αμέσως μετά το μπλοκ <b>σε κίνηση</b>, πριν από το μπλοκ επανάληψης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14.hint": "Το μπλοκ 'Set [ledID] to [0]' ανήκει στην κατηγορία Variables. Σύρετε το στην περιοχή του κώδικα και τοποθετήστε το έτσι ώστε να κουμπώνει ακριβώς μετά το μπλοκ \"σε κίνηση\", πριν από το μπλοκ επανάληψης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15": "Προσθέστε επίσης ένα μπλοκ <b>Απενεργοποίηση όλων των LED</b> από την κατηγορία <b>Όψεις</b><br /><br />Προσθέστε το ακριβώς πριν από το μπλοκ επανάληψης, αφού το μπλοκ <i>ορίστε το [ledID] σε [0]</i> που μόλις προσθέσατε",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15.hint": "Το μπλοκ \"Απενεργοποίηση όλων των LED\" ανήκει στην κατηγορία \"Όψεις\".<br /><Br />Βεβαιωθείτε ότι το έχετε προσθέσει μεταξύ του μπλοκ \"ορισμός [ledID] σε [0]\" και του μπλοκ \"επανάληψη\"",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-16": "Τώρα δοκιμάστε το ξανά! <br /><br />Τώρα, όταν κουνάτε το γρανάζι, θα επαναφέρει και τα φώτα και την <i>τιμή</i> της <b>μεταβλητής</b> <i>ledID</i>, έτσι ώστε να μετράει από το 1 έως το 10",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-17": "Μεταβείτε στην κατηγορία <b>Χειριστές</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-18": "Σύρετε το μπλοκ <b>επιλογή τυχαίας [1] σε [10]</b> για να αντικαταστήσετε τον αριθμό στο μπλοκ επανάληψης<br /><br />Τώρα, το μπλοκ επανάληψης θα κάνει βρόχο τυχαίο αριθμό φορών από 1 έως 10, αλλάζει κάθε φορά!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-19": "Το Cog διαθέτει 13 προγραμματιζόμενα LED - 12 στο δαχτυλίδι και ένα στο κουμπί<br /><br />Αλλάξτε το μπλοκ <b>επιλογή τυχαίας</b> για να επιλέξετε έναν αριθμό μεταξύ 1 και <b>13</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-20": "Δοκιμάστε το! <br /><br />Τώρα κάθε φορά που κουνάτε το Cog θα λαμβάνετε διαφορετικό αριθμό φώτων<br /><Br />Έχετε προγραμματίσει το Cog να είναι ζάρι!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-21": "Η <i>ledID</i> είναι μια <b>μεταβλητή</b> - έχει μια τιμή που μπορεί να αλλάξει ή να <i>μεταβλητή</i><br /><br />Σε αυτόν τον κώδικα μετράει μέχρι να ανάψει μια διαφορετική λυχνία LED κάθε φορά μέσω του βρόχου!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22": "Ας προσθέσουμε και κάποια ηχητικά σχόλια.<br /><Br />Μεταβείτε στην κατηγορία <b>Ήχοι</b> και προσθέστε ένα μπλοκ <b>Αναπαραγωγή σημείωσης [C4] για [1] δευτερόλεπτα</b><br /><br />Αλλάξτε το για αναπαραγωγή της νότας για <b>0,1 δευτερόλεπτα</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22.hint": "Το μπλοκ \"Αναπαραγωγή σημείωσης [C4] για [1] δευτερόλεπτα\" ανήκει στην κατηγορία Ήχοι.<br /><Br />Βεβαιωθείτε ότι το έχετε προσθέσει στον βρόχο Επανάληψης!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23": "Προσθέστε επίσης μια σύντομη παύση προσθέτοντας ένα μπλοκ <b>Περιμένετε [1] δευτερόλεπτα</b> από την κατηγορία <b>Έλεγχος</b><br /><br />Αλλάξτε τη διάρκεια της παύσης σε <b>0,1 δευτερόλεπτα</b> επίσης<br /><br />Εάν δεν προσθέσουμε μια παύση, τότε δεν θα μπορούμε να πούμε πόσα είναι όλα, όσο είναι τα μπιπ!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23.hint": "Το μπλοκ «Αναμονή [1] δευτερόλεπτα» ανήκει στην κατηγορία Έλεγχος. Προσθέστε το στον κώδικα σύροντάς το μέσα στον βρόχο επανάληψης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-24": "Δοκιμάστε το!<br /><Br />Τώρα θα ακούσετε επίσης έναν αριθμό μπιπ που ταιριάζει με τον αριθμό των φώτων!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25": "Ας κάνουμε κάτι ξεχωριστό <b>αν</b> κερδίσετε την πρώτη βαθμολογία - 13<br /><br />Μεταβείτε στην κατηγορία <b>Control</b> και προσθέστε ένα μπλοκ <b>If __ then</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25.hint": "Το μπλοκ \"αν __ τότε\" βρίσκεται στην κατηγορία Έλεγχος. Προσθέστε τον στον κώδικα σύροντάς τον έτσι ώστε να συνδεθεί μετά τον βρόχο επανάληψης",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-26": "Μεταβείτε στην κατηγορία <b>Χειριστές</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27": "Σύρετε το μπλοκ <b>=</b> <b>στο μπλοκ <i>if</i></b><br /><br />Εδώ θα ορίσουμε την <b>συνθήκη</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27.hint": "Το μπλοκ '=' ανήκει στην κατηγορία Χειριστές. Σύρετε το στο αντίστοιχο σχήμα στο μπλοκ if",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-28": "Επιστρέψτε στην κατηγορία <b>Μεταβλητές</b> και σύρετε τη μεταβλητή <b>ledID</b> στο <b>πρώτο πλαίσιο του μπλοκ ίσων</b><br /><br />Στη συνέχεια <b>ορίστε το δεύτερο πλαίσιο σε 13</b>, έτσι ώστε ολόκληρη η γραμμή να διαβάζει <b>αν ledID = 13 τότε</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-29": "Ο κώδικας μέσα σε αυτό το μπλοκ <b>if</b> θα εκτελεστεί μόνο <b>αν</b> η <b>μεταβλητή</b> ledID είναι <b>ίση</b> με 13<br /><br />Θα το ελέγξει αφού ολοκληρωθεί η επανάληψη του μπλοκ <b>repeat</b>, καθώς ο κώδικας συνεχίζει με τη σειρά<br /><br /> οτιδήποτε άλλο <br /><br /> 13 τότε ολόκληρο το μπλοκ <b>if</b> και οποιοσδήποτε κωδικός σε αυτό θα παραλειφθεί<br /><br />Το μπλοκ <b>if</b> είναι ένας τύπος <b>υπό όρους</b> - ο κωδικός μέσα σε αυτό θα εκτελεστεί μόνο εάν η <b>συνθήκη</b> που έχετε ορίσει είναι αληθής",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30": "Ας προσθέσουμε κάτι μέσα στο μπλοκ <b>if</b>!<br /><br />Μεταβείτε στην κατηγορία <b>ήχοι</b> και προσθέστε ένα μπλοκ <b>Play tune</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30.hint": "Το μπλοκ \"Play tune\" ανήκει στην κατηγορία Ήχοι. Προσθέστε το στον κώδικα σύροντάς τον ώστε να συνδεθεί μέσα στην συνθήκη if",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-31": "Αλλάξτε τη μελωδία σε <b>σφύριγμα</b> από το αναπτυσσόμενο μενού",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32": "Προσθέστε επίσης κάποια εφέ φωτισμού από το μενού Όψειςς<br /><br />Για παράδειγμα, μπορούμε να κάνουμε τα LED του δακτυλίου και των κουμπιών να δείχνουν ένα μοτίβο",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32.hint": "Το μπλοκ «Ρύθμιση [δαχτυλιδιού] LED σε μοτίβο [Flash]» ανήκει στην κατηγορία Όψεις. Προσθέστε δύο από αυτά μέσα στη συνθήκη if και αλλάξτε ένα για να ορίσετε το μοτίβο του κουμπιού",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-33": "Δοκιμάστε το!<br /><br />Δείτε αν μπορείτε να ρίξετε ένα 13 στα ζάρια κουνώντας το Cog!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-42": "Μπράβο!<br /><br />Έχετε μάθει ότι μια <b>μεταβλητή</b> είναι κάτι που μπορεί να αλλάξει στην <b>τιμή</b>. Μπορούμε να τα χρησιμοποιήσουμε για να κάνουμε τον κώδικά μας να κάνει διαφορετικά πράγματα χωρίς να χρειάζεται να αλλάξουμε τον κωδικό<br /><br />Μάθαμε για τα μπλοκ <b>if</b> - αυτά μπορούν να χρησιμοποιηθούν για την εκτέλεση κώδικα μόνο εάν πληρούται μια συγκεκριμένη <b>συνθήκη</b><br /><br />Και μάθαμε πώς να χρησιμοποιούμε έναν επαναλαμβανόμενο <b>βρόχο</b> για να κάνουμε κάτι πολλές φορές - σε αυτήν την περίπτωση ανάβει διαφορετική λυχνία LED",
  "gui.spriteSelector.sprites": "SPRITES",
  "gui.deviceSelector.devices": "ΣΥΣΚΕΥΕΣ",
  "gui.spriteSelector.addSpriteFromLibrary": "Επιλέξτε ένα Sprite",
  "gui.spriteSelector.addSpriteFromPaint": "Χρώμα",
  "gui.spriteSelector.addSpriteFromSurprise": "Εκπληξη",
  "gui.spriteSelector.addSpriteFromFile": "Ανεβάστε το Sprite",
  "gui.deviceSelector.addDeviceByConnecting": "Σύνδεση σε Συσκευή",
  "gui.deviceSelector.addDeviceFromLibrary": "Επιλέξτε Συσκευή",
  "gui.spriteSelector.noSpritesInUse": "Δεν χρησιμοποιούνται sprites",
  "gui.deviceSelector.noDevicesInUse": "Προσθήκη συσκευής",
  "gui.saveLoad.localStorageTitle": "Στην εφαρμογή",
  "gui.saveLoad.localStorageSubtitle": "Τοπική αποθήκευση",
  "gui.saveLoad.cloudStorageTitle": "Στο Σύννεφο",
  "gui.saveLoad.cloudStorageSubtitle": "Αποθήκευση στο Σύννεφο",
  "gui.saveLoad.portableFileStorageTitle": "Φορητός",
  "gui.saveLoad.portableFileStorageSubtitle": "Αποθήκευση αρχείων",
  "gui.saveLoad.createNewSaveFile": "Δημιουργήστε ένα νέο αρχείο αποθήκευσης:",
  "gui.saveLoad.savedFilesTitle": "Τα αποθηκευμένα αρχεία σας:",
  "gui.saveLoad.deleteFile": "Διαγραφή",
  "gui.saveLoad.loadFile": "Φόρτωση",
  "gui.saveLoad.saveFile": "Αποθήκευση",
  "gui.saveLoad.saveFileNamePlaceholder": "Πληκτρολογήστε αυτό που θέλετε να ονομάσετε το νέο σας αρχείο αποθήκευσης εδώ...",
  "gui.saveLoad.fileLoadError": "Η φόρτωση του έργου απέτυχε.",
  "gui.saveLoad.fileSaveError": "Αποτυχία αποθήκευσης έργου.",
  "gui.saveLoad.overwriteFile": "Είστε βέβαιοι ότι θέλετε να αντικαταστήσετε αυτό το αρχείο;",
  "gui.saveLoad.copyToClipboard": "Αντιγραφή στο Πρόχειρο",
  "gui.saveLoad.copied": "Αντιγράφηκε!",
  "gui.saveLoad.saveProject": "Αποθήκευση έργου",
  "gui.saveLoad.projectSaved": "Το έργο αποθηκεύτηκε με επιτυχία!",
  "gui.saveLoad.projectSaveFailed": "Αποτυχία αποθήκευσης έργου",
  "gui.saveLoad.projectLoaded": "Το έργο φορτώθηκε με επιτυχία!",
  "gui.saveLoad.projectLoadFailed": "Η φόρτωση του έργου απέτυχε",
  "gui.saveLoad.loadProjectPlaceholder": "Πληκτρολογήστε το όνομα του αρχείου αποθήκευσης cloud που θέλετε να φορτώσετε εδώ...",
  "gui.saveLoad.createNewCloudSave": "Δημιουργήστε ένα νέο αρχείο αποθήκευσης cloud:",
  "gui.saveLoad.saveFileCode": "Ο κωδικός αρχείου αποθήκευσης που δημιουργείται αυτόματα είναι:",
  "gui.saveLoad.saveFilePlaceholder": "Ο κωδικός αρχείου αποθήκευσης που δημιουργείται αυτόματα είναι:",
  "gui.saveLoad.loadProjectTitle": "Φόρτωση έργου",
  "gui.saveLoad.tipsTitle": "Συμβουλές για την αποθήκευση στο cloud:",
  "gui.saveLoad.tips1": "Φροντίστε να σημειώσετε ή να καταγράψετε τον κώδικα που δημιουργείται αυτόματα που παρέχεται κάθε φορά που αποθηκεύετε ένα νέο αρχείο. Θα χρειαστείτε αυτό για να το φορτώσετε στο μέλλον.",
  "gui.saveLoad.tips2": "Αν και η εφαρμογή Marty the Robot θα συνεχίσει να αποθηκεύει αυτόματα αρχεία στον τοπικό χώρο αποθήκευσης, δεν υπάρχει λειτουργία αυτόματης αποθήκευσης για αρχεία αποθήκευσης cloud. Αποθηκεύστε ξανά με μη αυτόματο τρόπο το αρχείο σας κάθε φορά, εάν θέλετε να είναι διαθέσιμο για λήψη μέσω αποθήκευσης cloud.",
  "gui.saveLoad.tips3": "Κάθε φορά που αποθηκεύετε ξανά ένα αρχείο στο χώρο αποθήκευσης cloud, θα σας παρέχεται ένας ΝΕΟΣ ΚΩΔΙΚΟΣ ΑΠΟΘΗΚΕΥΣΗΣ ΑΡΧΕΙΟΥ. Παρακαλώ σημειώστε αυτό.",
  "gui.saveLoad.saveToFile": "Αποθήκευση στο Αρχείο",
  "gui.saveLoad.loadFromFile": "Φόρτωση από το αρχείο",
  "gui.saveLoad.fileSaved": "Το αρχείο αποθηκεύτηκε!",
  "gui.martyMachineModelEditor.model": "Όνομα μοντέλου",
  "gui.martyMachineModelEditor.className": "Συλλέξτε δεδομένα για",
  "gui.martyMachineModelEditor.createNewClass": "Δημιουργία τάξης",
  "gui.martyMachineModelEditor.samples": "Δείγματα",
  "gui.MartyMachineModelEditor.record": "Καταγραφή Δεδομένων",
  "gui.MartyMachineModelEditor.stop": "Στάση",
  "gui.MartyMachineModelEditor.train": "Τρένο",
  "gui.MartyMachineModelEditor.run": "Τρέξιμο",
  "gui.MartyMachineModelEditor.save": "Εκτός",
  "gui.MartyMachineModelEditor.saving": "Οικονομία...",
  "gui.martyMachineTab.addNew": "Προσθήκη νέου μοντέλου",
  "gui.martyMachineTab.newImageModelMarty": "Νέο μοντέλο εικόνας (Marty)",
  "gui.martyMachineTab.newImageModelDevice": "Νέο μοντέλο εικόνας (συσκευή)",
  "gui.martyMachineTab.newAccelerometerModel": "Νέο μοντέλο επιταχυνσιόμετρου",
  "gui.martyMachineTab.newAudioModel": "Νέο μοντέλο ήχου",
  "gui.martyMachineTab.loadTMModel": "Φόρτωση μοντέλου TM",
  "gui.martyMachineTab.tutorials": "Φροντιστήρια",
  "gui.martyMachineTab.alertSelectDevice": "Ωχ! Επιλέξτε μια συσκευή Marty ή Cog για να χρησιμοποιήσετε το μοντέλο επιταχυνσιόμετρου.",
  "gui.martyMachineTab.alertConnectDevice": "Ωχ! Συνδέστε τη συσκευή για να χρησιμοποιήσετε το μοντέλο επιταχυνσιόμετρου.",
  "gui.martyMachineTab.alertModelNameExists": "Το όνομα μοντέλου υπάρχει ήδη, επιλέξτε άλλο όνομα.",
  "martyMachine.modelNameExists": "Ωχ! Το όνομα μοντέλου υπάρχει ήδη, επιλέξτε διαφορετικό όνομα.",
  "martyMachine.backgroundNoiseClassNeedsSamples": "Ωχ! Η κατηγορία θορύβου περιβάλλοντος χρειάζεται τουλάχιστον 10 δείγματα για εκπαίδευση. Προσθέστε περισσότερα δείγματα στην κατηγορία θορύβου φόντου.",
  "martyMachine.classNameExists": "Ωχ! Το όνομα της τάξης υπάρχει ήδη, επιλέξτε διαφορετικό όνομα.",
  "martyMachine.selectClassAlert": "Προσθέστε ή επιλέξτε μια υπάρχουσα τάξη πριν από την εγγραφή δειγμάτων.",
  "gui.MartyMachineNewModelConfirmationModal.label": "Οι μη αποθηκευμένες αλλαγές θα χαθούν.",
  "gui.MartyMachineNewModelConfirmationModal.headsUp": "Απλά ένα heads-up! Εάν έχετε κάνει αλλαγές στο τρέχον μοντέλο, δεν θα αποθηκευτούν. Είσαι καλά για να συνεχίσεις;",
  "gui.MartyMachineNewModelConfirmationModal.close": "Κοντά",
  "gui.MartyMachineNewModelConfirmationModal.continue": "Συνεχίζω",
  "gui.TfVisChart.loadingTitle": "Φόρτωση Οικόπεδο απώλειας",
  "gui.TfVisChart.loadingSubtitle": "Αυτό μπορεί να διαρκέσει λίγο, περιμένετε...",
  "gui.MartyMachineModelEditor.requiresAtLeast10Samples": "Απαιτεί τουλάχιστον 10 δείγματα",
  "gui.MartyMachineModelEditor.createNewClass": "Δημιουργία νέας τάξης",
  "gui.howtos.marty-machine-create-model.name": "Δημιουργία μοντέλου AI",
  "gui.howtos.marty-machine-create-model.step_create-model": "Δημιουργία νέου μοντέλου",
  "gui.howtos.marty-machine-create-audio-model.step_visit-user-guide": "Επισκεφθείτε τον Οδηγό χρήσης μας για περισσότερες πληροφορίες",
  "gui.howtos.marty-machine-create-image-model.name": "Δημιουργία μοντέλου εικόνας",
  "gui.howtos.marty-machine-create-image-model.step_create-image-model": "Δημιουργία νέου μοντέλου εικόνας",
  "gui.howtos.marty-machine-create-image-model.step_change-model-name": "Αλλαγή ονόματος μοντέλου",
  "gui.howtos.marty-machine-create-image-model.step_collect-data": "Συλλέξτε Δεδομένα",
  "gui.howtos.marty-machine-create-image-model.step_train-model": "Μοντέλο τρένου",
  "gui.howtos.marty-machine-create-image-model.step_run-model": "Εκτέλεση μοντέλου",
  "gui.howtos.marty-machine-create-image-model.step_save-model": "Αποθήκευση μοντέλου",
  "gui.howtos.marty-machine-create-audio-model.name": "Δημιουργία μοντέλου ήχου",
  "gui.howtos.marty-machine-create-audio-model.step_create-audio-model": "Δημιουργία νέου μοντέλου ήχου",
  "gui.howtos.marty-machine-create-audio-model.step_change-model-name": "Αλλαγή ονόματος μοντέλου",
  "gui.howtos.marty-machine-create-audio-model.step_collect-data": "Συλλέξτε Δεδομένα",
  "gui.howtos.marty-machine-create-audio-model.step_train-model": "Μοντέλο τρένου",
  "gui.howtos.marty-machine-create-audio-model.step_run-model": "Εκτέλεση μοντέλου",
  "gui.howtos.marty-machine-create-audio-model.step_save-model": "Αποθήκευση μοντέλου",
  "gui.howtos.marty-machine-load-tm-model.name": "Φόρτωση μοντέλου μηχανής με δυνατότητα διδασκαλίας",
  "gui.howtos.marty-machine-load-tm-model.step_load-tm-model": "Φόρτωση μοντέλου μηχανής με δυνατότητα διδασκαλίας",
  "gui.howtos.marty-machine-load-and-run-image-model.name": "Φόρτωση και εκτέλεση μοντέλου εικόνας",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-and-run-image-model": "Φέρτε τα μπλοκ AI",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-model": "Μοντέλο φόρτωσης",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classification-on": "Ενεργοποιήστε την ταξινόμηση",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classify-image": "Ταξινόμηση εικόνας",
  "gui.howtos.marty-machine-load-and-run-audio-model.name": "Φόρτωση και εκτέλεση μοντέλου ήχου",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-and-run-audio-model": "Φέρτε τα μπλοκ AI",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-model": "Μοντέλο φόρτωσης",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classification-on": "Ενεργοποιήστε την ταξινόμηση",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classify-audio": "Ταξινόμηση ήχου"
}