{
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-2": "Podemos encontrar el botón de inicio en Eventos. <br /><br /> Arrástralo al área de script para empezar a programar.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-3": "En Motion, podemos encontrar el bloque «¡Prepárate!». <br /><br /> Recuerda que siempre es buena idea añadir este bloque antes de que Marty empiece a moverse.<br /><br /> Colócalo debajo del bloque de la bandera verde.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-5": "Puedes encontrar el bloque \"Camina hacia adelante\" en Motion. <br /><br /> Agrega el bloque después de \"¡Prepárate!\" y cambia el número de pasos que da Marty en el espacio en blanco. Escribe \"4\" para que coincida con el código de BlocksJr.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-6": "También puedes encontrar el bloque deslizante en Motion.<br /><br /> Agrega el bloque después de \"Caminar 4 pasos hacia adelante\", establece el cuadro desplegable en \"derecha\" y escribe \"3\" para que coincida con el código de BlocksJr.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-1": "¡Podemos usar sprites para hacer muchísimas cosas en MartyBlocks! Desde controlar a Marty hasta enviar mensajes y aceptar entradas. <br /><br /><b/>¡Usemos el ratón para controlar un sprite y explorar diferentes escenarios!</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-3": "Seleccionemos un bloque de bandera verde para comenzar: arrástrelo al área de script para comenzar a codificar.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-4": "Usemos el bucle “infinito” para que el sprite siga siguiéndonos hasta que le indiquemos que se detenga con el botón rojo de parada.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-6": "También en Movimiento, seleccione el bloque caminar 10 pasos. <br /><br /> Agreguemos esto debajo del bloque apuntar hacia y cambiemos el número de pasos a 5.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-9": "¡Lo lograste! <br /><br /> <b/>¡Ahora cada vez que hagamos clic en la bandera verde, podremos explorar un nuevo fondo con nuestro sprite! </b><br/><br /> ¡Puedes usar el botón con cuatro flechas para ver tu sprite en pantalla completa!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.description": "¡Exploremos los eventos y los sprites, y cómo pueden controlar los movimientos de Marty!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-1": "Ahora que sabemos cómo controlar un Sprite, ¡vamos a usar un Sprite, un fondo y algunos bloques de Eventos para controlar a Marty en el Ártico!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-2": "Primero lo primero, abramos el menú de sprites para elegir nuestro sprite ártico. <br /><br /><b/>Busca \"oso polar\"</b> y selecciona el sprite para colocarlo en el fondo.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-3": "¡Genial! Ahora asegurémonos de que nuestro oso polar se sienta como en casa. <br /><br />Abre el menú de fondos y selecciona el fondo ártico para darle un hogar a nuestro oso polar.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-6": "Para comenzar a codificar, necesitamos dos bloques de eventos separados. <br /><br />Seleccione el bloque de eventos de la bandera verde y el bloque de eventos \"cuando este sprite hizo clic\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-7": "Queremos escribir código que diga: <br /> <br /> <i> Al hacer clic en este sprite, cambia el fondo a ártico. <br /> Al hacer clic en la bandera verde, vuelve al fondo predeterminado.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-8": "Vamos a obtener dos bloques de “cambiar fondo” de Looks y agregarlos debajo de los bloques de eventos como se muestra <br /><br />Utilice el menú desplegable para elegir arctic para uno y backdrop1 (el predeterminado) para el otro.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-9": "Ahora usemos los bloques de eventos de Marty para hacer que reaccione a este código. <br /><br />Navega hasta los bloques de Marty haciendo clic en Marty en el menú de dispositivos.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-10": "Queremos escribir código que diga: <br /> <i>Cuando el fondo cambie a ártico, ¡muévete! </i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-11": "En los eventos, seleccione un bloque \"cuando el fondo cambia a\". <br /> Utilice el menú desplegable para seleccionar Ártico.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-12": "Finalmente, vaya a Movimiento, seleccione el bloque \"¡Mueve!\" y colóquelo como se muestra en el código de ejemplo:",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-13": "¡Lo lograste! Haz clic en la bandera verde para reiniciar la escena, luego haz clic en el oso polar para crear una escena ártica, ¡y mira cómo se mueve Marty!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.description": "¡Usa un sprite para decirle a Marty que es hora de fiesta!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-1": "Podemos usar sprites para comunicarnos con Marty y entre nosotros transmitiendo mensajes.<br /><br />¡Vamos a usar un sprite para decirle a Marty que es hora de fiesta!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-2": "Primero, seleccionemos un fondo para la fiesta. <br/>Abra el menú de fondo y busque <b/>fiesta</b> para configurar la escena.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-3": "¡Ahora nuestra fiesta necesita música! <br/> Haz clic en “Elegir un Sprite” y busca <b/>altavoz</b> para completar la escena de nuestra fiesta.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-4": "Haz clic en el altavoz en el menú de sprites para acceder a su código. Queremos escribir un código que diga: <br /><br /><i> cuando se haga clic en este sprite, ¡emitirá el mensaje “¡Fiesta!”!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-6": "Arrastre el bloque \"mensaje de difusión 1\" a la posición que se muestra.<br /><br />",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-7": "Utilice el cuadro desplegable para seleccionar \"nuevo mensaje\" y luego cree un nuevo mensaje llamado \"¡Hora de fiesta!\" para transmitir.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-8": "Este debería ser el código del sprite del altavoz completo.<br/><br/>Ahora vamos a decirle a Marty qué hacer cuando escuche el mensaje <i/>¡Hora de la fiesta!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-9": "Acceda a los bloques de Marty haciendo clic en Marty en el menú de dispositivos.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-10": "En los eventos, seleccionaremos \"cuando reciba\", lo arrastraremos al área de scripts y usaremos el menú desplegable para seleccionar \"¡Hora de la fiesta!\". <br /><br />Usaremos esto para decirle a Marty qué hacer cuando sea hora de la fiesta: ¡tocar música y bailar!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-11": "Selecciona el bloque de sonido de inicio y colócalo como se muestra a continuación.<br/><br/>Utiliza el menú desplegable para seleccionar \"¡Celebra!\" y ¡que empiece la fiesta!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-12": "Finalmente, ve a Movimiento, selecciona el bloque \"¡Baila!\" y colócalo como se muestra en el código de ejemplo a continuación.<br/><br/>¡Ahora Marty sí que puede divertirse!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-13": "¡Lo lograste! Haz clic en el altavoz para que suene la música y ¡a ver a Marty divertirse!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.description": "¡Aprende a usar las sentencias condicionales para mantener a Marty a salvo!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-3": "El código dentro de la instrucción if solo se ejecutará si el código en el rombo es verdadero; ¡podemos hacer mucho con las instrucciones if!<br /><br /> Arrastra un bloque de instrucción if al área de scripting para comenzar nuestro código.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-4": "Vamos a usar los sensores de obstáculos de Marty para esta actividad; los pueden ver aquí en los círculos rojos.<br /><br />Pueden detectar si algo bloquea el camino de Marty mediante un tipo especial de luz invisible llamada infrarroja (IR).",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-5": "Los sensores infrarrojos constan de dos partes: transmisores y receptores. <br /><br />El transmisor emite luz invisible, que se refleja si hay un obstáculo. <br />El receptor detecta la luz infrarroja que rebota en un obstáculo. <br /><br />Si el receptor detecta luz reflejada, el sensor detecta que hay algo en el camino. <br /><br />Los sensores infrarrojos se utilizan para abrir puertas automáticas, aparcar coches y ayudar a los robots Marty a evitar obstáculos. <br/><br/><br/><i/>Haz clic en la imagen para ampliar el diagrama.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-7": "Si Marty percibe un obstáculo, queremos que se detenga para protegerlo. Dentro de nuestra instrucción condicional, coloquemos un bloque que diga \"detener a Marty inmediatamente\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-8": "No queremos que Marty verifique si hay obstáculos solo una vez, queremos que siga verificando una y otra vez, así que coloquemos nuestra declaración if dentro de un bucle infinito.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-9": "¡Genial! Ahora, probemos nuestro código de sentencia if haciendo que Marty camine hacia adelante indefinidamente a menos que vea un obstáculo.<br /><br />Selecciona el bloque \"caminar 2 pasos hacia adelante\" y colócalo solo, listo para ejecutarse en paralelo con nuestro código de sentencia if.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-11": "¡Lo lograste!<br /><br /> Ahora coloca a Marty en el suelo frente a un obstáculo, haz clic en ambos bucles infinitos para iniciar tu código y observa si Marty se mantiene a salvo.<br /><br /> Intenta quitar el obstáculo y comprueba si Marty sabe que puede seguir caminando sin peligro.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-2": "Ya sabemos cómo usar una declaración if. <br /><br /> El código dentro de la declaración if solo se ejecutará <b/>si</b> el código en el diamante es verdadero, pero ¿qué pasa si queremos controlar lo que sucede cuando el código NO es verdadero? <br /><br /> Las declaraciones if-else nos ayudan a decir <b /> si </b> esto es verdadero, ejecutar algún código, <b/>de lo contrario</b> ejecutar algún otro código.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-3": "Seleccione una instrucción if-else. <br /><br /> Arrástrela al área de scripting para comenzar nuestro código.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-4": "Usaremos los sensores de suelo de Marty para esta actividad. Estos pueden detectar si su pie está sobre una superficie o no.<br /><br /> Queremos asegurarnos de que solo camine hacia adelante si ambos pies están en el suelo.<b/> <br /><br /> Selecciona dos bloques \"Seleccionar sensor de pie en el suelo\". Usa el menú desplegable para configurar uno para el pie derecho y otro para el izquierdo.<br /><br /> Queremos indicarle a Marty que camine hacia adelante si ambos pies están en el suelo.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-5": "Para asegurarnos de que nuestro código compruebe ambos sensores a la vez, utilizaremos el bloque `and` en la clase `Operators`. <br /><br />Coloca ambos bloques de sensores dentro del bloque `and` como se muestra en el código de ejemplo:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-7": "Completemos nuestra instrucción if-else. Si ambos pies están en el suelo, queremos que Marty camine hacia adelante. Coloca un bloque de caminar hacia adelante en el espacio superior, como se muestra.<br /><br /> Como queremos que Marty verifique que ambos pies estén en el suelo después de <b/>cada paso</b>, cambia el \"2\" por \"1\" en el bloque de caminar.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-10": "¡Lo lograste! ¡Ahora pongamos a prueba tu código! <br /><br /> <b/> ​​Importante:</b> Recomendamos colocar a Marty en un borde <b/>de no más de 12,5 cm</b> para evitar daños en caso de caídas. <br/> Recomendamos usar una <b/>superficie blanca</b> (como una hoja de papel) para que Marty camine, ya que esto puede mejorar la precisión de su detección del suelo. <br /><br /> Coloca a Marty en una pequeña cornisa y haz clic en el bucle infinito para probar su sistema anticaídas.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.name": "¡Juego de prueba de reacción!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.description": "¡Creemos un juego de prueba de reacción!<br /><br />Programaremos a Cog para que se ilumine aleatoriamente y el jugador tendrá poco tiempo para pulsar el botón y conseguir un punto.<br /><br />Usaremos una <i>variable</i> para llevar la puntuación y un cronómetro para comprobar si son lo suficientemente rápidos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-1": "¡Creemos un juego de prueba de reacción!<br /><br />Programaremos a Cog para que se ilumine aleatoriamente y el jugador tendrá poco tiempo para pulsar el botón y conseguir un punto.<br /><br />Usaremos una <i>variable</i> para llevar la puntuación y un cronómetro para comprobar si son lo suficientemente rápidos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-4": "<b>Agregue un bloque de LED de [color] de la categoría <b>Apariencia</b>,<br /><br />Cámbielo para configurar el color del botón",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-5": "Agregue un bloque de <b>esperar [1] segundos</b> desde la categoría <b>Control</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-8": "<b>¡Comprueba si puedes pulsar el botón a tiempo!</b> Ve a la categoría <b>Eventos</b> y añade un bloque <b>Al pulsar el botón</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-11": "Arrastre el bloque <b>temporizador</b> desde la categoría <b>Detección</b> al primer cuadro del bloque <<br /><br />Luego, configure el segundo cuadro en 1, de modo que la línea diga <i>si el temporizador &lt; 1 entonces</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-12": "El temporizador es una variable especial que mide el tiempo en segundos.<br /><br />Cualquier código que pongamos en el bloque if solo se ejecutará si la variable del temporizador es menor a 1 segundo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-14": "Regrese a la categoría <b>Apariencia</b> y agregue un bloque <b>Establecer [anillo] LED en [color]</b> dentro del bloque if<br /><br />Cambie el color a lo que desee y asegúrese de agregarlo dentro de la declaración if.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-15": "Agregue un bloque <b>Reproducir nota [C4] durante [1] segundos</b> de la categoría <b>Sonido</b><br /><br />Colóquelo justo después del bloque <b>Establecer LED</b> y cámbielo para reproducir <b>C6</b> durante <b>0,25 segundos</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-17": "<b>¡Pruébalo!</b> Presiona la bandera verde para comenzar, luego, si presionas el botón dentro de 1 segundo, las luces se encenderán y escucharás un pitido.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-18": "¡Ahora hagamos que la luz se encienda más de una vez!<br /><br />Vaya a la categoría <b>Control</b> y agregue un bloque <b>Repetir</b> alrededor del código debajo del bloque <b>Cuando se hace clic en la bandera</b>.<br /><br />¡Esto hará que Cog se ilumine varias veces!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-23": "Agregue un bloque <b>Establecer [mi variable] en [0]</b> inmediatamente después del bloque <b>Cuando se hace clic en la bandera</b>, antes del bucle de repetición",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-24": "Cambia la variable a <b>puntuación</b> para que diga <i>Establecer puntuación en 0</i><br /><br />Ahora, cada vez que inicies el juego, la puntuación se restablecerá a 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-25": "Dentro de la instrucción if, agregue un bloque \"cambiar [mi variable] en 1\" y seleccione la variable <b>puntuación</b> del menú, de modo que diga \"cambiar puntuación en 1\".",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-26": "¡Pruébalo!<br /><br />¡Ahora cada vez que presiones a tiempo la puntuación aumentará en 1!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-28": "Establece 'delay' en 1 al inicio del programa, justo después de reiniciar la puntuación.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-29": "¡Disminuyamos el retardo en cada iteración del bucle!<br /><br />Añade un bloque <b>Cambiar [retardo] en [1]</b> dentro del bucle.<br /><br />No esperamos a que el retardo disminuya demasiado, así que configúralo para que cambie 'retardo' en -0.05. Esto lo disminuirá en 1/20 de segundo cada vez.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-30": "A lo largo de las 10 iteraciones del bucle de repetición, el retraso disminuirá de 1 segundo a 0,5 (o medio segundo).",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-31": "Ahora usemos la variable de retardo.<br /><br />Una ventaja de las variables es que podemos usarlas en más de un lugar.<br /><br />Arrastra la variable de retardo al bloque '<' para que diga <i>si temporizador <retardo entonces</i><br /><br />También arrástrala al bloque 'esperar [1] segundo', para que diga 'esperar [retardo] segundos'.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-32": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-33": "Hagamos que cog muestre la puntuación al jugador al final.<br /><br />Podemos hacer eso como hicimos con los dados en la última actividad.<br /><br />Primero que nada, crea una variable llamada <b>ledID</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-34": "Luego, agregue un bloque de <b>variable establecida</b> después del bucle de repetición y establezca <b>ledID</b> en 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-36": "Agregue un bloque <b>Establecer LED [1] en [color]</b> dentro de este nuevo bucle de repetición<br /><br />Reemplace el número con la variable 'ledID', de modo que diga 'Establecer LED [ledID] en [color]'<br /><br />¡Luego configure el color como desee!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-37": "Y, por último, agregue un bloque <b>Cambiar [variable] por [1]</b> después de ese bloque de configuración de LED y haga que cambie <b>ledID</b> en 1",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-38": "¡Pruébalo!<br /><br />¡Ahora cuando termines, Cog mostrará tu puntuación!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-39": "¡Bien hecho! ¡Has realizado una programación bastante avanzada!<br /><br />Has aprendido a usar variables para llevar un registro de las cosas durante un juego.<br /><br />Usamos un temporizador y el operador \"menor que\" para hacer una comparación, junto con una instrucción if para decidir si el jugador presionó el botón a tiempo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-40": "¡Próximos pasos!<ul><li>¿Podrías hacer el juego más difícil? ¿Qué tal añadir algunos niveles más para que sea aún más rápido?</li><li>Usando lo que aprendiste en el tutorial de dados, ¿podrías hacer que Cog celebre si el jugador consigue una puntuación perfecta?</li><li>Si tienes amigos o compañeros de clase con engranajes, ¡jueguen por turnos a \"golpea topos\" usando más de un engranaje a la vez! Todos deben presionar la bandera verde al mismo tiempo, y luego los jugadores deben turnarse para intentar conseguir la mayor cantidad de puntos posible con todos los engranajes. Al final, suma tu puntuación sumando el número de luces en cada engranaje.</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.name": "¡Espectáculo de luces reactivas!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.description": "¡Hagamos un espectáculo de luces que reaccione mientras interactúas con Cog!</br></br>Aprenderemos cómo hacer animaciones en los LED de Cog, responder a los objetos detectados, a la cantidad de fuerza en el botón y a la luz detectada.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-3": "Vaya a la categoría <b>Eventos</b> y agregue un bloque <b>en objeto detectado [izquierda]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-4": "Vaya a la categoría <b>Aspectos</b> y agregue un <b>conjunto de LED usando el bloque selector de color</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-5": "Establece los colores que desees.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-6": "¡Pruébalo! Coloca un objeto en el sensor de obstáculos izquierdo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-8": "Cambie el sensor a la derecha, utilizando el menú desplegable.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-9": "Regrese a la categoría <b>Aspectos</b> y agregue otro <b>conjunto de LED usando el bloque selector de color</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-10": "¡Pruébalo! Coloca un objeto en el sensor de obstáculos correcto.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-11": "Puedes crear animaciones en Cog utilizando varios bloques selectores de color conectados entre sí.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-12": "Esa animación estaba compuesta por 9 <b>fotogramas</b>, cada uno en un bloque Selector de color separado, con un bloque de apagado de LED al final.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-13": "Aquí están los fotogramas individuales para esa animación.<br /><br />¿Puedes planificar una animación propia y hacer que se reproduzca cuando Cog detecte un objeto?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-14": "¿Puedes hacer una animación que cambie suavemente a medida que mueves a Cog de estar sentado en un sensor de objeto a estar sentado en el otro?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-15": "Hasta ahora, cada vez que hemos usado el botón en Cog, este ha detectado si está pulsado o no.<br /><br />A este tipo de información la llamamos <b>booleana</b>: algo que es verdadero o falso.<br /><br />Además de considerar el botón como una entrada booleana, también podemos usarlo como una entrada <b>analógica</b>, que puede tener muchos valores diferentes.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-18": "Vaya a la categoría <b>Eventos</b> y agregue un bloque <b>Cuando se hace clic en la bandera</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-21": "Ahora, arrastra el bloque que dice <b>tono [360] saturación [100] luminosidad [100]</b> al espacio correspondiente al color en el bloque <b>asignar [anillo] LEDs a [color]</b>.<br /><br />Existen varias maneras de describir los colores, y Tono, Saturación y Luminosidad (o Valor) es una de ellas.<br /><br />Con estos tres números podemos describir cualquier color.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-22": "El <b>tono</b> es un número entre 0 y 360 (como los grados de un círculo) que indica el color base que queremos.<br /><br />Se puede mostrar en un círculo, ¡y ya lo has visto al usar el selector de color!<br /><br />0 grados está en la parte superior y representa el rojo. 90 grados es un amarillo verdoso, 180 grados es un azul cian, 270 grados es el morado y 360 grados es de nuevo el rojo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-23": "<b>La saturación</b> indica qué tan intenso desea que sea el color.<br /><br />En este ejemplo, para un tono de 360, una saturación de 100 será el rojo más rojo que existe.<br /><br />Una saturación de 0 será blanco, el menos rojo que existe.<br /><br />Y una saturación de 50 estará en el medio, rosa.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-25": "¡Usemos la <b>fuerza del botón</b> para configurar uno de estos valores!<br /><br />Vuelve a la categoría <b>Detección</b> y arrastra el bloque <b>valor de fuerza del botón</b> al espacio de luminosidad en el bloque <b>tono, saturación, luminosidad</b>.<br /><br />Añade también una <b>espera de 0,1 segundos</b> al final del bucle infinito para que las luces no cambien demasiado rápido.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-26": "¡Encendamos también la luz del botón de Cog para divertirnos!<br /><br />Agrega un bloque <b>Establecer LEDs de [anillo] en [color]</b> antes del bucle infinito y cámbialo para configurar el <b>botón</b>. Elige el color que quieras.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-27": "¡Pruébalo! Al presionar el botón, los LED se iluminarán en rojo cada vez más intenso.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-28": "Prueba a ajustar la saturación con la fuerza del botón en lugar de la luminosidad.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-29": "¡Ahora las luces cambiarán de blanco a rojo cuando presiones el botón!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-30": "Por último, prueba a ajustar el tono.<br /><br />El valor del tono debe ir de 0 a 360, así que tendremos que hacer algunos cálculos.<br /><br />Ve a la categoría <b>Operadores</b> y arrastra un bloque <b>múltiple</b> al valor del tono.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-31": "Configúralo para que multiplique el valor de la fuerza del botón por 3,6.<br /><br />Esto significa que, en lugar de obtener números del 0 al 100, obtendremos números del 0 al 360 (3,6 x 100).<br /><br />¡Pruébalo!<br /><br />Ahora, al pulsar el botón, el color de las luces cambiará de rojo a verde, luego a azul y de vuelta a rojo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-32": "¡A ver si puedes cambiar también el color del botón!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-33": "A continuación, veamos si podemos hacer que Cog reaccione a las luces brillantes brillando un poco.<br /><br />Elimina el código que creaste para cambiar los colores según la fuerza del botón arrastrándolo a la paleta de bloques.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-34": "Vaya a la categoría <b>Detección</b> y marque la casilla junto al bloque <b>Valor de luz ambiental</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-35": "Toma nota de cuál es el valor normal de la luz ambiental.<br /><br />Luego, toma una linterna e ilumínala a Cog, toma nota de los valores que obtengas.<br /><br />¡Probablemente podrás alcanzar el valor máximo que el sensor puede dar: 4095!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-36": "Vaya a la categoría <b>Control</b> y agregue un bloque <b>esperar hasta</b> debajo del bloque <b>Cuando se haga clic en la bandera</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-37": "A continuación, vaya a <b>Operadores</b> y agregue un bloque <b>mayor que</b> dentro del bloque <b>esperar hasta</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-39": "Agregue un bloque <b>Establecer [anillo] LED en [color]</b> debajo del bloque <b>esperar hasta</b>.<br /><br />También agregue un bloque <b>Apagar todos los LED</b> en la parte superior, para asegurarse de que todo se restablezca.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-40": "¡Pruébalo!<br /><br />Haz clic en la bandera verde para comenzar a escribir el código.<br /><br />Luego, al iluminar a Cog con una linterna, ¡las luces se encenderán!<br /><br />El bloque <b>esperar hasta</b> detendrá la ejecución del código hasta que se cumpla la condición que hayas especificado.<br /><br />En este caso, se trata de comprobar si el valor del sensor de luz es lo suficientemente brillante.<br /><br />Una vez que la condición se cumple, el bloque <b>esperar hasta</b> finaliza y la ejecución continúa con el bloque <b>configurar los LED [anillo] en [color]</b> para encender los LED.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-41": "Hagamos que las luces de Cog se enciendan gradualmente cuando detecte una linterna.<br /><br />Para hacer eso, ¡usaremos una variable nuevamente!<br /><br />Vaya a la categoría <b>Variables</b> y cree una variable llamada <b>brillo</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-42": "Agregue un bloque para <b>establecer el brillo en 0</b> al comienzo del código.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-43": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-44": "Usando la variable <b>brillo</b> que acaba de crear, cámbiela para que la línea diga <b>repetir hasta brillo &gt; 100</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-45": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-46": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-47": "Luego, agregue un bloque <b>esperar</b> de la categoría <b>Control</b> y cámbielo a <b>esperar 0,1 segundos</b>.<br /><br />Esto ralentizará un poco el desvanecimiento.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-48": "El bloque <b>repetir hasta</b> es un poco como una combinación del bloque <b>repetir</b> que usaste antes, que se repetía una cantidad particular de veces, y el bloque <b>esperar hasta</b> que acabas de usar.<br /><br />En este caso, seguirá repitiéndose hasta que se cumpla la condición, y luego dejará de repetirse y la ejecución del código continuará.<br /><br />En este ejemplo, seguirá repitiendo el bucle y aumentará gradualmente el brillo hasta que alcance el valor máximo de 100.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-49": "¡Pruébalo!<br /><br />Haz clic en la bandera verde para ejecutar el código.<br /><br />Ahora, cuando ilumines a Cog con una linterna, ¡las luces se encenderán gradualmente!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-50": "¡Hagamos que las luces se apaguen nuevamente cuando retires la antorcha!<br /><br />Agregue otro bloque <b>esperar hasta</b>, pero esta vez configúrelo para que espere hasta que el valor de la luz ambiental sea menor que un umbral.<br /><br />Haga esto usando un bloque <b>&lt;</b> (menor que) de la categoría <b>Operadores</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-51": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-52": "Duplica el código desde dentro del bucle <b>repetir hasta</b> anterior.<br /><br />Puedes hacer esto haciendo clic derecho (o presionando y manteniendo presionado) y luego seleccionando <b>Duplicar</b>.<br /><br />Coloca el nuevo código en el nuevo bucle <b>repetir hasta</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-53": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-54": "¡Pruébalo! Ahora, cuando retires la linterna, las luces de Cog se apagarán de nuevo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-55": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-56": "¡Muy bien! ¡Has aprendido muchísimo!<br /><br />Aprendiste a crear animaciones a partir de muchos fotogramas individuales.<br /><br />Aprendiste a hacer que Cog reaccionara a los sensores de objetos.<br /><br />Aprendimos sobre valores analógicos que pueden variar y usamos las luces de Cog para indicar cuánta fuerza se aplicaba al presionar el botón.<br /><br />Aprendimos a describir los colores usando Tono, Saturación y Brillo (o Valor).<br /><br />También aprendimos a usar el sensor de luz de Cog e hicimos un experimento muy rápido para obtener algunas lecturas del sensor que nos ayudaron a escribir nuestro código.<br /><br />Usando bloques <b>esperar hasta</b>, <b>repetir hasta</b>, variables y operadores de comparación, ¡hicimos que Cog se iluminara para responder a las luces brillantes!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-57": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.name": "Nivel de burbuja",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-1": "<b>Hagamos un nivel de burbuja</b> que muestre si algo está nivelado o inclinado.<br /><br />Usaremos el sensor de inclinación de Cog para que funcione en dos dimensiones.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-3": "Vaya a la categoría <b>Eventos</b> y agregue un bloque de evento <b>on tilt [left]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-5": "Haga clic en el ícono de <b>luces apagadas</b> para apagar todas las luces.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-6": "Luego, enciende solo un LED a la izquierda.<br /><br />¡Pruébalo! Inclina el engranaje hacia la izquierda.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-8": "Conecta ese bloque <b>on tilt [right]</b> a otro bloque <b>set LEDs using the colorpicker</b> y configúralo para que solo se encienda el LED de la derecha.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-9": "¡Pruébalo!<br /><br />Inclina el engranaje hacia la izquierda y hacia la derecha.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-10": "Agregue otro conjunto de bloques <b>al inclinarse</b> y <b>selector de color</b>.<br /><br />Configúrelo para que reaccione al inclinarse [hacia atrás]</b> y para que solo se encienda el LED en la posición de las 6 en punto.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-11": "Finalmente, agrega un cuarto conjunto de bloques y configúralos en <b>inclinación [hacia adelante]</b>, y para encender el LED en la parte delantera del engranaje.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-12": "¡Pruébalo!<br /><br />¡Inclina el engranaje en las cuatro direcciones y observa cómo se mueve la luz!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-13": "¡Mostremos esta información en la pantalla también!<br /><br />Vaya a la categoría <b>Detección</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-14": "Seleccione la casilla de verificación junto a <b>Acelerómetro X</b>.<br /><br />Luego cambie X a Y en el menú desplegable y seleccione la casilla de verificación junto a eso.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-15": "¡Inclina el engranaje y observa cómo cambian los números!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-19": "¡Aparecerá un gráfico!<br /><br />Debemos seleccionar los sensores que queremos mostrar. Haga clic para expandir la categoría <b>Acelerómetro</b> y marque las casillas junto a <b>X</b> e <b>Y</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-20": "Presione el botón <b>reproducir</b> para comenzar a mostrar los datos del sensor.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-22": "Haga clic en el botón <b>x</b> para cerrar el panel de sensores.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-23": "¡Hagamos un experimento científico! Necesitarás papel para tomar notas.<br /><br />Inclina el engranaje hacia la derecha y anota los valores de los sensores del acelerómetro (ax) y del acelerómetro (ay).<br /><br />Repite el procedimiento inclinándolo hacia adelante, hacia atrás y hacia la izquierda.<br /><br />¡Usaremos estos datos en breve!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-24": "Ahora vaya a la categoría <b>Variables</b> y cree dos variables llamadas <b>ax</b> (para el acelerómetro x) y <b>ay</b> (para el acelerómetro y).",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-25": "Agrega estos bloques a tu proyecto:<br /><br /><ul><li>Al hacer clic en la bandera:</li><ul><li>Siempre:</li><ul><li>Establecer ax en el eje X del acelerómetro</li><li>Establecer ay en el eje Y del acelerómetro</li></ul></ul></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-27": "Agregue un bloque <b>broadcast [message1]</b> dentro del bucle infinito.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-28": "Vamos a darle un nombre mejor al mensaje, seleccione <b>Nuevo mensaje</b> del menú desplegable.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-32": "¡Tu código desaparecerá! No te preocupes, sigue ahí, solo que está vinculado a cog en lugar de a este sprite.<br /><br />Ve a la categoría <b>Eventos</b> y añade un bloque <b>cuando recibo [actualizar posición]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-33": "Cámbielo para que diga <b>cuando reciba [actualizar posición]</b> - ese es el mensaje que acabamos de crear.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-34": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-35": "Agregar un bloque <b>ir a x: [] y: []</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-36": "El centro de la pantalla tiene las coordenadas [0,0].<br /><br />Las coordenadas a la derecha del centro tienen valores x superiores a 0.<br />Las coordenadas a la izquierda del centro tienen valores x inferiores a 0.<br />Las coordenadas por encima del centro tienen valores y superiores a 0.<br />Las coordenadas por debajo del centro tienen valores y inferiores a 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-37": "Queremos mover la pelota para mostrar cuánto se inclina Cog.<br /><br />Revisa las notas que tomaste sobre las lecturas del acelerómetro que obtuviste al inclinar Cog en cada una de las cuatro direcciones.<br /><br />Queremos que la pelota se mueva hacia la izquierda y hacia la derecha al inclinar Cog en esas direcciones. Para el sprite, izquierda y derecha se definen mediante su coordenada x.<br /><br />Deberías observar que al inclinar Cog hacia la derecha, el valor de ay era mayor que 0, mientras que el valor de ax era casi 0. Al inclinarlo hacia la izquierda, el valor de ay era menor que 0.<br /><br />Esto significa que debemos usar el valor de ay para definir la coordenada x del sprite.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-38": "También necesitaremos aumentar el número multiplicándolo.<br /><br />Vaya a la categoría <b>Operadores</b> y arrastre un bloque de <b>multiplicación</b> al cuadro de coordenadas x.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-39": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-40": "Mira nuevamente tus notas sobre las lecturas del acelerómetro.<br /><br />¿Qué número cambió cuando inclinaste el engranaje hacia atrás y hacia adelante?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-41": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-42": "¡Pero hay un problema! Queremos que el sprite se mueva hacia arriba al inclinar el cog hacia adelante, lo que significaría que necesitaría una coordenada y por encima de 0.<br /><br />Pero al inclinar el cog hacia adelante, ¡el valor de y era inferior a 0!<br /><br />Para solucionarlo, tendremos que multiplicarlo por <b>-100</b> en lugar de <b>100</b>. El signo menos adicional cambiará de estar por debajo de 0 a estar por encima de 0, y viceversa.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-43": "Regresa a tu código de engranaje haciendo clic en el símbolo de engranaje en el panel de dispositivos.<br /><br />¡El engranaje se iluminará y emitirá un pitido cuando lo selecciones!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-44": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-45": "Agreguemos un fondo detrás de la pelota para indicar mejor lo que estamos mostrando.<br /><br />Seleccione el <b>Escenario</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-46": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-47": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-48": "Puedes seleccionar la pestaña <b>Código</b> en la parte superior para volver a la pantalla de codificación y seleccionar Engranaje de nuevo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-49": "¡Pruébalo!<br /><br />Ahora, al inclinar Cog, podrás ver una guía que te indicará cuánto te falta para alcanzar el nivel.<br /><br />Cuando Cog está inmóvil, siempre hay 1 G de gravedad actuando sobre él. Si inclinas mucho Cog, verás que puedes conseguir que ax o ay sean iguales a 1; esto sucederá cuando el indicador esté lo más lejos posible del centro.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-50": "Si lo inclinas en un ángulo de 45 grados, el indicador estará a la misma distancia del centro, pero ax y ay ahora estarán alrededor de 0,7. ¿Puedes pensar por qué?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-51": "Si pensamos en la cantidad de inclinación como un triángulo rectángulo, el teorema de Pitágoras nos dice que si los lados del triángulo miden aproximadamente 0,7, ¡la hipotenusa será 1!<br /><br />Eso es lo que está sucediendo aquí, donde 1 G de gravedad a 45 grados se compone de 0,7 G en la dirección X y 0,7 G en la dirección Y.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-52": "¡Bien hecho!<br /><br />Has aprendido a usar el sensor de inclinación de Cog para crear un nivel de burbuja, un dispositivo que indica si algo está nivelado o inclinado.<br /><br />Aprendimos sobre sprites en la interfaz de Bloques y usamos variables y un mensaje para comunicarnos entre Cog y el sprite.<br /><br />Pensamos en cómo representar los datos (la cantidad de inclinación en los ejes X e Y) de una manera fácil de entender, usando luces en Cog y el movimiento del sprite sobre un indicador en el fondo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-53": "¡Hagamos que Cog también indique cuándo está plano!<br /><br />Regrese a la categoría <b>Detección</b> y seleccione la casilla de verificación junto a <b>Dirección de inclinación</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-54": "Observa lo que sucede con la <b>dirección de inclinación</b> a medida que mueves el Cog.<br /><br />Cuando esté casi plano, la dirección de inclinación será <b>ninguna</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-55": "Añade este código.<br /><br />Utiliza un par de bloques nuevos.<br /><br />El bloque <b>if … else</b> funciona de forma muy similar al bloque <b>if</b> que usamos antes. Si la condición es verdadera, se ejecutará el código dentro de la parte if; sin embargo, si la condición es falsa, se ejecutará el código de la parte else.<br /><br />Usando el bloque <b>if … else</b> podemos escribir código alternativo que solo se ejecuta si la condición no es verdadera.<br /><br />El otro bloque nuevo es un bloque <b>=</b>. Este es otro tipo de comparador: compara dos elementos. Aquí estamos comparando el sensor de <b>dirección de inclinación</b> y la palabra <b>ninguno</b>.<br /><br />Si la dirección de inclinación es exactamente la misma que la palabra <b>ninguno</b>, entonces la condición será verdadera y el LED del botón se establecerá en verde, y los LED del anillo se apagarán.<br /><br />Si la dirección de inclinación es igual a cualquier cosa que no sea <b>ninguno</b>, entonces el LED del botón se apagará.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-56": "¡Pruébalo!<br /><br />Ahora también recibirás una señal en Cog cuando esté nivelado 🙂",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.description": "¡Hagamos un juego donde usemos Cog y Sprites en la pantalla!<br /><br />Haremos un juego de esquí donde el jugador tendrá que evitar chocar contra árboles y rocas.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-1": "¡Hagamos un juego donde usemos Cog y Sprites en la pantalla!<br /><br />Haremos un juego de esquí donde el jugador tendrá que evitar chocar contra árboles y rocas.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-1.2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-5": "Agrega bloques para <i>establecer [ay] en [acelerómetro [Y]]</i> dentro del bucle infinito.<br /><br />Necesitarás usar un bloque <b>establecer</b> de la categoría Variables, el bloque <b>Acelerómetro</b> de la categoría Sensores y cambiar el eje a <b>Y</b> usando el menú desplegable.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-7": "Agrega otro bloque <b>broadcast [message1]</b> antes del bucle forever y configúralo para que transmita un <b>Nuevo Mensaje</b> llamado <i>start</i>.<br /><br />Usaremos esto para asegurarnos de que todo se reinicie al comienzo de un juego.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-8": "Haga clic en el botón para elegir un sprite para agregar.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-10": "Con el sprite del pingüino seleccionado, agregue un bloque <b>cuando recibo [inicio]</b> de la categoría Eventos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-14": "Cámbialo para que diga <b>ir a x: [[ay] x 200] y:0</b>.<br /><br />Necesitarás usar un bloque <b>multiplicar (*)</b> de la categoría Operadores y la variable <b>ay</b> de la categoría Variables.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-15": "¡Pruébalo!<br /><br />Cubre el sensor de objetos izquierdo para comenzar el juego, luego inclina Cog hacia la izquierda y hacia la derecha para mover el pingüino hacia la izquierda y hacia la derecha.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-17": "Con el sprite del árbol seleccionado, agrega un bloque <b>cuando recibo [inicio]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-18": "Desde la categoría Apariencia, agregue un bloque <b>establecer tamaño a [30]%</b> y un bloque <b>ocultar</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-20": "Dentro del bucle forever, agrega un bloque <b>crear clon de [mí mismo]</b>.<br /><br />Un clon es una copia idéntica de algo.<br /><br />En este caso, el bloque crear clon hará una copia del sprite del árbol y todo el código que está vinculado a él.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-21": "Después de ese bloque, agregue un bloque de <b>esperar [1] segundos</b>.<br /><br />Esto significará que se creará un nuevo árbol cada 1 segundo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-22": "Ahora agregue un bloque <b>cuando inicio como clon</b>.<br /><br />Cualquier código adjunto a este se ejecutará cuando se cree el clon.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-25": "Cámbialo para que diga <b>deslizarse [2] segundos hasta x: [posición x] y: [200]</b>.<br /><br />Puedes encontrar el bloque de posición x en la categoría Movimiento.<br /><br />Esto hará que el árbol se mueva desde la parte inferior hasta la parte superior de la pantalla durante 2 segundos, manteniendo la posición x (la posición izquierda y derecha) igual.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-26": "Antes del bloque de deslizamiento, agrega un bloque <b>mostrar</b> de la categoría Apariencia.<br /><br />El clon comenzará oculto, ya que el sprite del que fue copiado estaba oculto, por lo que necesitaremos mostrarlo antes de comenzar a moverlo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-27": "Queremos que cada clon del árbol desaparezca cuando llegue a la parte superior de la pantalla.<br /><br />Para ello, agregue un bloque <b>eliminar este clon</b> de la categoría Control, debajo del bloque de deslizamiento.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-28": "¡Pruébalo!<br /><br />Un nuevo árbol aparecerá cada segundo y se moverá hacia arriba en la pantalla.<br /><br />Para detener el programa, presione la señal roja de Stop.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-29": "Hagamos que el juego detecte si el pingüino choca contra un árbol.<br /><br />Con el sprite del árbol todavía seleccionado, agregue otro bloque <b>cuando empiezo como clon</b> y un bucle <b>para siempre</b> debajo de él.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-30": "Agregue un bloque <b>if [] then</b> dentro del bucle forever.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-31": "Cámbialo para que diga: <b>Si [toca al [Pingüino 2]] entonces</b>.<br /><br />Puedes encontrar el bloque de contacto en la categoría Sensores y seleccionar Pingüino 2 en el menú desplegable.<br /><br />Esta condición \"si\" será verdadera si el árbol toca al pingüino.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-32": "Dentro de la condición if, agregue un bloque <b>stop [all]</b>.<br /><br />Esto hará que el juego termine si el pingüino choca contra un árbol.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-33": "¡Pruébalo!<br /><br />Cubre el sensor de objeto izquierdo para iniciar el juego e inclina Cog para dirigir al pingüino y evitar los árboles.<br /><br />¡Cuando toques un árbol, el juego terminará!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-34": "¡Agreguemos una puntuación!<br /><br />Cree otra variable llamada <b>puntuación</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-35": "Con el sprite del árbol aún seleccionado, agrega un bloque <b>establecer [puntaje] en [0]</b> después del bloque <b>cuando recibo [inicio]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-36": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-37": "Hagamos que el juego se vuelva más difícil a medida que avanza.<br /><br />Agregue otra variable llamada <b>retraso</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-39": "Ahora utilice la variable de retardo para establecer el tiempo entre la creación de los árboles.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-40": "¡Pruébalo!<br /><br />¡Notarás que los árboles comienzan a aparecer mucho más rápido cuanto más avanzas!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-41": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-42": "Seleccionar Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-43": "Agrega un bloque <b>set [ring] LEDs to [green]</b> y un bloque <b>set [ring] LEDs to pattern [Spin1]</b> como se muestra aquí.<br /><br />Eso hará que las luces giren en Cog cuando comience el juego.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-44": "Agregue un bloque <b>cuando reciba [detener]</b> y un bloque para <b>establecer los LED [anillo] en [rojo]</b>.<br /><br />Harán que las luces se vuelvan rojas cuando termine el juego.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-45": "¡Bien hecho!<br /><br />¡Aprendiste a crear un juego en Blocks! Usamos la función de clonación para crear muchas copias de árboles que debes evitar y logramos que Cog controle a un personaje en pantalla.<br /><br />Próximos pasos:<ul><li>¿Puedes crear otro tipo de obstáculo que puedas evitar, como rocas?</li><li>¿Puedes hacer que el pingüino salte al presionar el botón de Cog?</li><li>¿Puedes hacer que salte sobre los obstáculos de roca para obtener puntos de bonificación?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.name": "Instrumento musical",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.description": "¡Convirtamos a Cog en un instrumento musical!<br /><br />Haremos que Cog toque notas que cambien según cómo interactúes con él y aprenderemos sobre las tonalidades musicales.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-1": "¡Convirtamos a Cog en un instrumento musical!<br /><br />Haremos que Cog toque notas que cambien según cómo interactúes con él y aprenderemos sobre las tonalidades musicales.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-2": "Primero, midamos lo que Cog \"ve\" al interactuar con el sensor de objetos.<br /><br />Toma una hoja de papel en blanco y usa una regla para hacer marcas cada centímetro de 0 a 5 cm. Numera las marcas del 0 al 5.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-3": "Coloque Cog en la marca 0 con el sensor de objeto derecho apuntando hacia las marcas de distancia.<br /><br />Cambie el bloque de valor del sensor IR [izquierda] al sensor <i>derecho</i> y marque la casilla junto a él.<br /><br />Eso mostrará la lectura del sensor IR, otro nombre para el sensor de objeto, ya que utiliza luz infrarroja para funcionar.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-5": "Repita esto con su mano en las marcas de 4 cm, 3 cm, 2 cm, 1 cm y 0 cm.<br /><br />Debería terminar con una tabla de medidas.<br /><br />Puede notar que los números cambian mucho cuando su mano está cerca de Cog, pero menos cuanto más se aleja su mano.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-6": "Hagamos que Cog toque una nota cuando se presione el botón.<br /><br />Agregar un bloque <b>al presionar el botón</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-8": "Ahora necesitamos usar condicionales para seleccionar la nota a tocar.<br /><br />Solo queremos tocar una nota, así que usaremos el bloque <b>if … else</b>.<br /><br />Para la condición, agrega un comparador <b>menor que</b> (<) y configúralo como <b>lectura <2100]</b>. En lugar de 2100, establece este número como el que mediste cuando tu mano estaba en la línea de 4 cm.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-9": "Agregue un bloque de <b>Nota de inicio [C4]</b> dentro de la parte if del bloque if … else.<br /><br />Esta es la nota más baja que haremos y la haremos cuando la lectura del sensor IR sea baja, es decir, cuando su mano esté lejos de ella.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-10": "¡Pruébalo!<br /><br />Presiona el botón sin nada delante de Cog: deberías escuchar una nota.<br /><br />Presiona el botón nuevamente con tu mano un par de centímetros delante de Cog: no debería pasar nada porque fuimos a la parte else del condicional.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-11": "¡Codifiquemos más notas!<br /><br />Agregaremos otro bloque <b>if … else</b> dentro de la parte else del primero.<br /><br />Poner condicionales uno dentro del otro de esta manera se llama anidación.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-13": "Hazlo dos veces más, de modo que termines con cuatro bloques if… else.<br /><br />Puedes hacerlo más rápidamente si haces clic derecho o mantienes presionado el último bloque if… else y seleccionas la opción <b>Duplicar</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-14": "Para el tercer condicional, establezca el número en el que midió en la marca de 2 cm.<br /><br />Para el cuarto condicional, establezca el número en el que midió en la marca de 1 cm.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-15": "Cambia la tercera nota a <b>Mi4</b>.<br /><br />Cambia la cuarta nota a <b>Sol4</b>.<br /><br />¡Quizás notes que nos saltamos una nota! Solo vamos a tocar cinco notas, y las estamos seleccionando de la escala pentatónica de Do.<br /><br />Pentatónica significa que tiene 5 notas por octava, y Do es la tonalidad musical. Una tonalidad indica los sostenidos y bemoles que se usan en una canción; son las teclas negras del piano.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-16": "Ahora es el momento de la quinta nota.<br /><br />No es necesario usar otro bloque if … else ya que esta es la única opción que queda.<br /><br />Agregue un bloque <b>Nota de inicio [A4]</b> en la parte else del último condicional if … else.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-19": "¡Inténtalo de nuevo!<br /><br />Ahora Cog dejará de reproducir la nota cuando dejes de presionar el botón.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-20": "Sería divertido si pudieras cambiar de nota mientras mantienes presionado el botón.<br /><br />Coloca un bloque <b>repetir hasta</b> alrededor de todo el código justo después del bloque al presionar el botón.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-21": "Establezca la condición en el bloque repetir hasta como <b>[[botón pulsado] = Falso]</b>.<br /><br />Mueva el bloque <b>Detener sonidos</b> fuera del bucle repetir hasta y reemplace el bloque <b>esperar hasta</b> con un bloque <b>esperar [0,1] segundos</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-24": "Sería aún mejor si pudiéramos cambiar de nota más rápidamente, pero debemos asegurarnos de no enviar demasiados comandos a Cog y sobrecargarlo.<br /><br />Usemos variables para llevar un registro de la nota que estamos tocando y cambiémosla solo cuando sea necesario.<br /><br />Creemos dos nuevas variables llamadas <b>nota</b> y <b>últimaNota</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-25": "Reemplaza cada uno de los bloques <b>Nota de inicio</b> con un bloque <b>establecer [nota] en [nota4]</b>.<br /><br />Deberás escribir <b>nota4</b> exactamente así para que funcione. Para las demás notas, usarás <b>nota4</b>, <b>notae4</b>, <b>notag4</b> y <b>notaa4</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-26": "Reemplace el bloque <b>wait [0.1] seconds</b> después de todos los condicionales con un bloque <b>if</b> como este:<br /><br />La condición debe ser <b>if [not [[note] = [lastNote]] then</b>.<br /><br />Puede encontrar el bloque <b>not</b> en la categoría Operadores. Como era de esperar, solo es verdadero si el valor dentro de él es falso. Por lo tanto, aquí, la condición solo es verdadera si el valor de la variable note no es igual al valor de la variable lastNote.<br /><br />Si ese es el caso, hay una nueva nota para reproducir, así que dentro del bloque if agregue un bloque <b>Start note [note]</b>.<br /><br />También agregue <b>set [lastNote] to [note]</b>. Esto asegurará que el programa recuerde cuál fue la última nota la próxima vez que se repita el bucle.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-27": "¿Puedes detectar cuál sería el pequeño error si termináramos el código aquí?<br /><br />Un error es una equivocación; en este caso, hay algo más que debemos hacer para asegurarnos de que siempre se reproduzca una nota al pulsar el botón: borrar la variable `lastNote` cuando detengamos los sonidos.<br /><br />Para ello, añade un bloque `<b>set [lastNote] to [0]</b>` al final del código.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-28": "¡Pruébalo!<br /><br />¡Ahora cuando muevas la mano la nota debería cambiar más rápido!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-29": "¡Bien hecho!<br /><br />¡Has creado un instrumento musical que puedes usar para tocar junto con canciones!<br /><br />Al usar la escala pentatónica para una canción que está en la misma tonalidad, ¡puedes tocar mientras mantienes la afinación!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-31": "¿Qué prefieres: usar el sensor infrarrojo o la inclinación para ajustar la nota?<br /><br />¿Qué otros sensores podrías usar?<br /><br />Intenta tocar junto con otras canciones en la tonalidad de Do.<br /><br />También podrías cambiar las notas para tocar la escala pentatónica en una tonalidad diferente. Muchas canciones están todas en la misma tonalidad, aunque algunas tienen cambios de tonalidad. ¿Cómo podrías hacer que Cog cambie la tonalidad en la que toca?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.name": "Reloj",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-3": "Vaya a la categoría <i>detección</i> y arrastre el bloque <b>[año] actual</b> al área de codificación.<br /><br />Cámbielo para que diga <b>[hora] actual</b> y haga clic en él.<br /><br />Al igual que los sensores en Cog cambian de valor, este bloque cambiará para representar la hora actual.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-4": "La interfaz de Blocks, como la mayoría de las computadoras, utiliza un reloj de 24 horas.<br /><br />Si es por la mañana, la hora actual estará entre las 0 y las 11.<br /><br />Si es por la tarde, la hora actual estará entre las 12 y las 23.<br /><br />Los relojes analógicos normales utilizan un reloj de 12 horas, donde hay dos segmentos de 12 horas (am y pm) en un día de 24 horas.<br /><br />Cog tiene 12 LED en el anillo, por lo que también utilizaremos un reloj de 12 horas. ¿Cómo podemos cambiar el número en la interfaz de Bloques de un reloj de 24 horas a un reloj de 12 horas?<br /><br />Podríamos verificar si la hora es mayor que 11, y si es así, restar 12.<br /><br />O podríamos usar el operador de módulo, que te da el resto después de hacer una división.<br /><br />Entonces aquí, si dividimos 17 por 12, obtenemos una respuesta de 1 con un resto de 5 (o 1r5). ¡Las 17:00 en el reloj de 24 horas son las 5:00 p. m. en el reloj de 12 horas, por lo que es correcto!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-5": "Introduce <b>[[hora actual]] mod [12]]</b> como ID del LED en el bloque <b>set LED</b>.<br /><br />Prueba a ejecutar el código pulsando la bandera verde: ¡Cog mostrará una luz roja que indica la posición de la manecilla de la hora en un reloj!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-6": "Probablemente queramos mostrar algo más que la hora en nuestro reloj, así que veamos cómo mostrar también los minutos.<br /><br />El bloque <b>minuto actual]</b> te mostrará el minuto como un número entre 0 y 59.<br /><br />Arrástralo al área de código y haz clic para ver el minuto actual.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-7": "Pero hay otro problema: ¡necesitamos mostrar 60 minutos en solo 12 LED!<br /><br />En un reloj, el minutero da una vuelta cada hora, comenzando en la posición de las 12 en punto. Cuando se dan 30 minutos después de la hora, el minutero está en la posición de las 6 en punto, a mitad de la vuelta.<br /><br />Los LED de Cog están numerados como las marcas de hora de un reloj. El minutero se mueve 5 minutos entre cada uno de los números del reloj. Esto tiene sentido porque 60 minutos / 12 números = 5 minutos por número.<br /><br />Por lo tanto, si usamos el operador de división para dividir el minuto actual entre 5, sabremos qué LED encender para mostrar el minutero de nuestro reloj.<br /><br />Sin embargo, existe otro problema: dividir el minuto entre 5 normalmente no da como resultado un número entero, y necesitamos especificar el LED como un número entero (o entero).<br /><br />Para pasar del número con punto decimal a un número entero, necesitamos redondearlo. Si solo se redondea, Blocks redondeará hacia arriba o hacia abajo, dependiendo de si la fracción es menor o igual a 0,5.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-10": "¿Cómo mostrarías también los segundos?<br /><br />Agrega otro bloque <b>Establecer LED</b> pero esta vez haz que establezca el LED <b>[[piso] de [[segundo actual]] / [5]] en [verde]</b>.<br /><br />Recuerda que puedes hacer clic derecho o presionar y mantener presionado un bloque para obtener la opción de duplicarlo: eso puede ahorrar mucho tiempo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-12": "Hagamos que la hora se actualice automáticamente. Añadamos un bucle indefinidamente y un bloque de espera de [5] segundos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-13": "¡Pruébalo!<br /><br />¡Ahora cada 5 segundos la hora se actualizará y las manecillas se moverán alrededor del reloj!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-14": "Es un poco confuso si las diferentes manos están en el mismo lugar, intenta agregar una pequeña pausa entre cada LED y cambiar la pausa al final a solo 3 segundos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-16": "Sería genial poder indicar si es AM o PM.<br /><br />Podríamos hacerlo cambiando el color de fondo del reloj según si la hora es menor a las 12.<br /><br />Reemplaza el bloque <b>Apagar todos los LED</b> con un bloque <b>si…si no</b> que verifique si la hora actual es menor a las 12.<br /><br />Luego, elige dos colores diferentes para los LED del anillo para AM y PM. En este ejemplo, hemos elegido naranja para AM y morado para PM; los colores deben ser diferentes de los que uses para mostrar las manecillas del reloj.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-17": "¡Pruébalo!<br /><br />¡Ahora tu reloj te mostrará si es am o pm cambiando de color!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-18": "¿De qué otra forma podríamos mostrar la hora?<br /><br />Este código mostrará la hora encendiendo todos los LED desde la posición de las 12 hasta la hora actual; así, a medida que avance la hora, se encenderán más LED.<br /><br />¡Borra tu código de reloj anterior y pruébalo!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-20": "También puedes usar un engranaje para mostrar que las horas avanzan más lentamente, encendiendo gradualmente el siguiente LED a medida que pasan los minutos.<br /><br />¡Borra tu código de reloj anterior y pruébalo!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-21": "¡Pruébelo!<br /><br />Los LED se encenderán lentamente a medida que pase el tiempo; por ejemplo, en esta imagen, ¡nuestro reloj muestra las 6 y media!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-22": "Si tienes tiempo, podemos intentar hacer que nuestro reloj original sea más sofisticado.<br /><br />Podemos animar la manecilla de los segundos para que parpadee cada segundo, así; de esta forma no importará si tapa las demás manecillas.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-23": "Para ello, vamos a utilizar una lista para llevar un registro de qué color debe tener cada LED.<br /><br />Vaya a la categoría <b>Variables</b> y haga clic en el botón <b>Crear una lista</b> para crear una lista llamada <b>leds</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-24": "Las listas son variables especiales que pueden contener una lista ordenada de variables individuales.<br /><br />Elimina el código anterior y agrega los bloques que se muestran en la imagen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-26": "Crea dos nuevas variables llamadas <b>hora</b> y <b>minuto</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-27": "Agrega bloques para asignar estas variables a las posiciones de las manecillas de las horas y los minutos, utilizando las mismas matemáticas que usaste antes.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-28": "Ahora modificaremos los elementos de la lista para establecer los colores de las manecillas de la hora y los minutos.<br /><br />El bloque <b>reemplazar elemento</b> cambiará el elemento en la posición especificada de la lista. Dado que la lista comienza a numerar sus elementos en 1, debemos sumar 1 a las variables de hora y minutos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-29": "Prueba a ejecutar el código pulsando la bandera verde.<br /><br />Ahora la lista se actualizará con diferentes códigos de color para las manecillas de la hora y los minutos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-30": "Creemos algo para solucionar mejor el problema cuando las manecillas de la hora y los minutos están en el mismo lugar.<br /><br />Agregue una declaración <b>if</b> para verificar si las variables de hora y minutos son las mismas (es decir, si las manecillas de la hora y los minutos están en el mismo lugar).<br /><br />Si es así, cambie el elemento de la lista a un color diferente: en este caso, elegimos morado estableciendo el rojo y el azul en 255 y el verde en 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-31": "Bien, ahora tenemos una lista que representa los colores que queremos mostrar en los LED de Cog. ¡Es hora de mostrarlos!<br /><br />Crea otra variable llamada <b>ledID</b> y úsala en un bucle para configurar los 12 LED de Cog.<br /><br />Para configurar los diferentes colores, haremos referencia a los elementos de la lista <b>leds</b> usando el bloque <b>item</b>, recordando sumar 1.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-32": "¡Pruébalo!<br /><br />Los 12 códigos de color en la lista de <b>leds</b> se mostrarán como colores en Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-33": "Vamos a poner el código en un bucle para que se actualice automáticamente.<br /><br />Agregue un bloque <b>esperar hasta</b> al final y configúrelo para que espere hasta que la manecilla de los minutos deba cambiar, comparando el valor donde debería estar la manecilla de los minutos con el valor almacenado en la variable <b>minuto</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-34": "Luego, coloque el código en un bucle <b>forever</b> para que se ejecute repetidamente.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-36": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-37": "Ahora, agrega bloques para configurar el LED del segundero en verde, espera un segundo y luego cámbialo al color que aparece en la lista de LEDs.<br /><br />De esta manera, recordamos el color del LED después de cambiarlo. La lista de LEDs se utiliza para recordar el estado de las manecillas de las horas y los minutos del reloj.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-38": "Coloca también el código de segunda mano en un bucle <b>infinito</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-39": "Tu código ahora debería verse así: ¡Pruébalo!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-40": "¡Bien hecho!<br /><br />¡Has usado muchas matemáticas para crear un reloj con Cog! Pensaste en diferentes maneras de mostrar la hora.<br /><br />Si llegaste hasta el final, también aprendiste sobre las listas como una forma de almacenar información ordenada, como el estado de cada LED en Cog.<br /><br />Próximos pasos:<ul><li>¿Puedes hacer que este nuevo reloj cambie el color de fondo dependiendo de si es a. m. o p. m.?</li><li>¿Tendría más sentido que la manecilla de los segundos girara una vez cada 5 minutos para mostrar la hora con mayor precisión? ¿Qué cambiarías para lograrlo?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.name": "Rueda de apoyo",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.description": "¡Hagamos una rueda giratoria!<br /><br />¡Esta es una rueda especial que llevará la cuenta de qué tan lejos ha rodado!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-1": "En actividades anteriores hemos visto cómo podemos usar el acelerómetro de Cog para medir la dirección de su inclinación.<br /><br />También podemos usar este sensor para calcular el ángulo de inclinación de Cog.<br /><br />Usaremos este dato para convertir a Cog en una rueda de medición, un dispositivo para medir distancias haciendo rodar una rueda sobre ellas.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-2": "Agrega un bloque <b>cuando se haga clic en la bandera verde</b> y un bucle <b>para siempre</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-4": "<b>Establezca</b> el <b>ángulo</b> en <b>atan2</b> de [Acelerómetro [Y]] y [Acelerómetro [X]].<br /><br />Puede encontrar el bloque <b>atan2</b> en la categoría de operadores.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-5": "Atan2 es una función matemática que usa trigonometría para calcular el ángulo dentro de un triángulo rectángulo cuando se dan las longitudes de los catetos adyacentes y opuestos.<br /><br />Aquí, estamos colocando la aceleración del eje Y y del eje X, que son perpendiculares entre sí (a 90 grados), y la función atan2 nos dirá el ángulo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-6": "¡Pruébalo!<br /><br />Presiona la bandera verde y luego mantén el engranaje verticalmente con la flecha amarilla apuntando hacia arriba y gíralo como si fuera un volante.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-7": "Al girar el engranaje en el sentido de las agujas del reloj, verá que el ángulo cambia de 0 grados cuando el engranaje apunta hacia arriba, hasta 180 grados cuando apunta hacia abajo.<br /><br />Luego saltará a -180 grados, antes de volver a aumentar a 0 grados a medida que continúe girando en el sentido de las agujas del reloj.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-8": "Para nuestra rueda giratoria, preferiríamos que contara de 0 a 360 grados.<br /><br />Agregue estos bloques dentro del <b>bucle infinito</b>:<ul><li><b>Si</b> [[ángulo] < [0]] entonces</li><ul><li>Cambie [ángulo] por [360]</li></ul></ul><br />Ahora, en lugar de -180 grados, nuestro ángulo se establecerá en +180 grados.<br /><br />Seguirá aumentando desde allí hasta 360, y luego volverá a 0 grados.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-9": "¡Pruébalo!<br /><br />Ahora, cuando giras el engranaje, el ángulo irá de 0 a 360 y luego dará una vuelta.<br /><br />Esta matemática funciona porque 360 ​​grados es un giro completo, así que cuando agregamos 360 grados adicionales a la rotación, terminamos apuntando en la misma dirección, pero ahora con un ángulo positivo que será más fácil de manejar a medida que contamos las revoluciones.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-10": "Agreguemos un sprite en pantalla para mostrar la rotación de Cog.<br /><br />Desde el menú <i>Elegir un Sprite</i>, seleccione la opción <i>pintar</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-13": "Y por último dibuja un triángulo usando la herramienta Línea y coloréalo de amarillo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-14": "Haz clic en la pestaña <i>Código</i> para volver a la pantalla de codificación.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-16": "¡Pruébalo!<br /><br />Presiona la bandera verde y luego gira el engranaje: ¡verás que el sprite también gira!<br /><br />Sin embargo, hay un problema: el sprite está a 90 grados de distancia del engranaje; esto se debe a que la interfaz de Bloques cuenta el punto a la izquierda como 0 grados, mientras que nosotros tratamos el punto que apunta hacia arriba como 0 grados.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-17": "Para convertir entre estas diferentes convenciones, cambia el código para añadir 90 grados al ángulo.<br /><br />¡Inténtalo de nuevo y el movimiento del sprite del engranaje coincidirá con el de tu engranaje real!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-18": "Seleccione Cog nuevamente.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-19": "Agreguemos un LED en Cog para mostrar que la detección de rotación está funcionando.<br /><br />Agregue 2 nuevas variables llamadas <i>LED</i> y <i>lastLED</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-20": "Nuestra variable de ángulo nos indica una rotación de 0 a 360 grados, pero solo tenemos 12 LED alrededor del anillo del engranaje.<br /><br />Esto significa que la resolución será de 30 grados por LED, ya que 360 ​​grados / 12 LED = 30 grados / LED.<br /><br />Añade estos bloques dentro del bucle infinito:<ul><li>Asignar [LED] a [[redondear [ángulo]/[30]] mod [12]]</li></ul><br />Dividimos el ángulo entre 30 para obtener un número entre 0 y 12, y luego lo redondeamos, ya que necesitamos un número entero para especificar qué LED encenderemos.<br /><br />Como nuestros LED solo están numerados del 0 al 11, usamos el bloque mod como hicimos en la actividad del reloj. Este es el operador <i>módulo</i> y devuelve el resto cuando se dividen los dos números; por lo tanto, en lugar de obtener el número 12 para el id del LED, obtendremos un 0 nuevamente, que es lo que queremos porque el LED 0 está en la posición de las 12 en punto en el engranaje.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-21": "Ahora, agrega también estos bloques dentro del bucle `forever`: `<ul><li>Si [no [[LED] = [lastLED]]] entonces</li><ul><li>Establece el LED [LED] en [azul]</li><li>Establece el LED [lastLED] en [negro]</li><li>Establece [lastLED] en [LED]</li></ul></ul><br />¿Puedes averiguar cómo funciona esta nueva sección de código y qué hará?<br /><br />Usamos las variables `LED` y `lastLED` para saber qué LED está encendido y si necesitamos cambiarlo. Cuando el valor de `LED` cambia de una iteración del bucle a la siguiente, la condición en la instrucción `if` se cumple.<br /><br />Cuando esto sucede, encendemos el nuevo LED y apagamos el anterior (poniéndolo en negro, que es lo mismo que apagar una luz). Finalmente, actualizamos la variable `lastLED` para que esté lista para la siguiente iteración del bucle.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-22": "¡Pruébalo!<br /><br />Presiona la bandera verde y luego gira el engranaje.<br /><br />¡Verás que ocurre algo raro! A veces, el LED está arriba y a veces abajo.<br /><br />Eso es un poco confuso y no es lo que buscábamos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-23": "Si lo piensas, eso se debe a que el LED gira en el sentido de las agujas del reloj al mismo tiempo que giramos el engranaje en ese mismo sentido.<br /><br />Lo que realmente queremos, para que el LED siempre esté en la parte inferior del engranaje, es que gire en sentido contrario al de la rotación del engranaje.<br /><br />¿Cómo podríamos lograrlo?<br /><br />Modifica tu código para que diga: <b>set [LED] to [[round [[360] - [angle]] / [30]] mod [12]]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-25": "Eso está bastante cerca, pero aún no es exactamente lo que buscábamos. Sería más intuitivo si el LED estuviera en la parte inferior del engranaje, en lugar de en la superior.<br /><br />¿Cómo podríamos hacerlo?<br /><br />Básicamente, necesitamos sumar 6 a la variable del LED; y así como sumar 6 horas hace que la manecilla de las horas gire media vuelta alrededor de la esfera de un reloj, sumar 6 a la variable del LED hará que gire media vuelta alrededor del anillo de 12 LEDs.<br /><br />Utilizaremos el operador módulo para iterar los números de 11 a 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-26": "¡Pruébalo!<br /><br />Ahora, cuando gires el engranaje, el LED que esté encendido estará en la parte inferior.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-27": "¡Bien! Ahora que tenemos buenos comentarios de los usuarios que indican que la detección de rotación funciona, ¡hagamos que el engranaje mida la distancia!<br /><br />Para lo siguiente, necesitarás un círculo de cartón; este será nuestra rueda.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-28": "Dibuja el contorno de la cara superior del engranaje y recorta un hexágono en el centro del círculo.<br /><br />(No es necesario que quede justo en el centro).<br /><br />Mide el diámetro del círculo.<br /><br />Este tiene un diámetro de unos 200 mm, lo que significa que el radio es de 100 mm.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-29": "Introduzcamos ese número en nuestro programa.<br /><br />Creemos dos nuevas variables llamadas <i>radio</i> y <i>circunferencia</i>.<br /><br />Añadamos nuevos bloques para asignarles valores antes del bucle infinito:<ul><li>Asignar a [radio] el valor [100]</li><li>Asignar a [circunferencia] el valor [2] * [[3.14] * [radio]]]</li></ul><br />Reemplacemos el 100 con el radio de nuestra rueda.<br /><br />Mediremos la distancia recorrida por la rueda al girar, donde cada revolución cubrirá una distancia igual a su circunferencia.<br /><br />Recordemos que la circunferencia es igual a 2 * pi * radio. Aquí aproximamos pi a 3.14.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-31": "Para poder contar las revoluciones, necesitaremos registrar cuándo el ángulo cambia de 360° a 0° y viceversa.<br /><br />Usaremos la variable `lastAngle` para esto. Cuando el ángulo pasa de 360° a 0°, el resultado de `[angle] - [lastAngle]` será -360°.<br /><br />En la práctica, nuestra medición probablemente pasará de unos 355° a 5°.<br /><br />Añade estos bloques dentro del bucle `forever`:<ul><li>Si [[angle] - [lastAngle] < [-180]] entonces</li><ul><li>Cambiar [revoluciones] en [1]</li></ul></ul><br />Así, si el ángulo disminuye mucho (180° o más) repentinamente, sabremos que debemos sumar 1 al contador de revoluciones.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-32": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-34": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-35": "Ahora añade este bloque:<ul><li>Establece [distance] en [[[totalRotation] / [360]] * [circumference]]</li></ul><br />La variable totalRotation indica la rotación total en grados, por lo que al dividirla entre 360 ​​obtenemos el número de revoluciones como un número racional, es decir, un número que puede tener decimales en lugar de solo números enteros.<br /><br />Multiplicando esto por la circunferencia obtenemos la distancia total que ha recorrido la rueda.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-36": "¡Pruébalo!<br /><br />¡Coloca el engranaje dentro de la rueda de cartón e intenta hacerla rodar!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-37": "Sería genial tener una forma de reiniciar fácilmente el contador de distancia.<br /><br />Agrega estos bloques:<ul><li>Al presionar el botón</li><li>Establecer [distancia] en [0]</li><li>Establecer [revoluciones] en [0]</li><li>Establecer [ángulo inicial] en [ángulo]</li><li>Establecer [último ángulo] en [ángulo]</li></ul><br />Necesitarás crear una nueva variable llamada <i>ángulo inicial</i>.<br /><br />La usaremos para asegurarnos de que podamos comenzar a contar desde cualquier ángulo en el que se encuentre el engranaje cuando presiones el botón, no solo cuando el engranaje esté apuntando hacia arriba.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-38": "Necesitaremos tener en cuenta el ángulo inicial en el cálculo de la rotación total, restándolo del ángulo actual.<br /><br />Modifica el bloque que asigna el valor a la variable `totalRotation` de la siguiente manera:<ul><li>Asigna a `[totalRotation]` el valor de `[[revolutions] * [360]] + [[angle] - [startingAngle]]]`.</li></ul><br />Esto restará el ángulo inicial del ángulo actual, de modo que podamos empezar a contar desde el ángulo en el que se encuentre el engranaje al pulsar el botón.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-39": "¡Pruébalo!<br /><br />Toma una regla y coloca la rueda dentada junto a ella en la marca 0.<br /><br />Pulsa el botón para reiniciar la rueda y luego gírala a lo largo de la regla; verás que la variable de distancia registra la distancia recorrida.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-41": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-42": "¡Pruébalo!<br /><br />Puedes medir distancias y presionar el botón para registrarlas en la lista para verlas cuando regreses a tu pantalla.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-43": "¡Bien hecho!<br /><br />¡Aprendiste a convertir un engranaje en un dispositivo para medir distancias! En la vida real, las ruedas dentadas se usan para medir largas distancias, y las hay con asas que puedes rodar.<br /><br />Usaste matemáticas para convertir el diámetro que mediste en un radio y luego en una circunferencia, y usaste eso junto con la medida del ángulo para calcular la distancia.<br /><br />Pensaste mucho en los ángulos y usaste una variable para registrar cómo cambiaba el ángulo del engranaje y condicionales para registrar cómo cambiaba el número total de revoluciones.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.name": "Juego del murciélago volador",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-2": "Haremos que el bate vuele de izquierda a derecha usando nuevamente el sensor de inclinación en cog.<br /><br />Como lo hiciste antes, crea una variable llamada <b>ay</b>.<br /><br />También llevaremos la puntuación en este juego, así que crea también una variable llamada <b>score</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-4": "Agreguemos el sprite ahora.<br /><br />Presione el botón <b>Elegir un sprite</b> y luego seleccione el sprite Murciélago.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-6": "¡Pruébalo!<br /><br />Presiona la bandera verde y luego inclina el engranaje de lado a lado; ¡el murciélago también se moverá!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-7": "Hagamos nuestro bate un poco más pequeño y hagamos que caiga por la pantalla de forma predeterminada.<br /><br />Agregue estos bloques:<ul><li>Al hacer clic en la bandera verde</li><li>Establecer tamaño en [50]%</li><li>Para siempre</li><ul><li>Cambiar y en [-10]</li><li>Esperar [0.1] segundos</li></ul></ul></ul><br />¡Ahora, cuando presione la bandera verde y ejecute el programa, el bate caerá lentamente por la pantalla!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-8": "Dejemos un camino para que el murciélago agite sus alas y vuelva a trepar.<br /><br />Seleccione Cog nuevamente.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-9": "Añade estos bloques:<ul><li>En objeto detectado [derecha]</li><li>Transmitir [aleteo]</li></ul><br />Usaremos el sensor de objeto IR derecho como botón para hacer que el murciélago agite sus alas, y usaremos un nuevo mensaje llamado <b>aleteo</b> para enviar esa instrucción al sprite del murciélago.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-10": "Selecciona el sprite del murciélago.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-11": "Busca el siguiente bloque de vestuario en la categoría Apariencia.<br /><br />Haz clic en él: ¡verás que el sprite del murciélago cambia a uno en una pose diferente!<br /><br />Haz clic varias veces: el sprite del murciélago tiene cuatro poses diferentes, llamadas vestuarios en la interfaz de Bloques.<br /><br />Podemos usar estos vestuarios para animar los movimientos del murciélago.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-13": "También debemos asegurarnos de que el disfraz siempre comience con el correcto al inicio del juego.<br /><br />Agregue un disfraz de cambio al bloque [bat-a] justo después del bloque establecido en tamaño [50]%.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-14": "¡Pruébalo!<br /><br />Presiona la bandera verde para iniciar el código y luego intenta tocar el sensor de objeto IR derecho con tu dedo: ¡el murciélago volará por la pantalla!<br /><br />Aún puedes inclinarte hacia la izquierda y la derecha para conducir.<br /><br />Presiona la señal de stop roja para detener la ejecución del código.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-16": "Bien, ¡es hora de hacer de esto algo más que un juego!<br /><br />Comencemos haciendo una lista de compras para nuestro bate.<br /><br />Vaya a la categoría <i>Variables</i> y haga clic en el botón <b>Hacer una lista</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-17": "Nuestro murciélago es un murciélago frugívoro, ¡y le gusta comer fruta!<br /><br />Crea una lista llamada <b>fruta</b>.<br /><br />Aparecerá una lista vacía en la pantalla.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-19": "A continuación, agregaremos un par de frutas a la lista de compras de nuestro murciélago.<br /><br />Agregue un bloque <b>agregar [cosa] a [fruta]</b> y cámbielo para que diga <b>agregar [plátano] a [fruta]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-20": "Repita el mismo procedimiento para agregar una <b>manzana</b> a la lista.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-21": "¡Presiona la bandera verde y verás que los plátanos y las manzanas se han añadido a la lista de frutas!<br /><br />En la parte inferior también se indica que la longitud de la lista es de 2 elementos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-22": "Hagamos que el murciélago elija algo que quiera de la lista de compras.<br /><br />Crea una nueva variable llamada <b>fruta</b>.<br /><br />Notarás que puedes tener una variable llamada fruta y una lista llamada fruta.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-24": "Encuentra la <b>longitud del bloque [fruta]</b> y arrástralo al área de codificación.<br /><br />Si lo presionas, verás que devuelve el número de elementos en la lista, en este caso 2.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-25": "Si combinas esos dos bloques de forma que digan <b>elemento [longitud de [fruta]] de [fruta]</b>, se encontrará el último elemento de la lista.<br /><br />Esto se debe a que el bloque <b>longitud de [fruta]</b> se evalúa primero y devuelve un valor de 2, como se vio antes. El bloque <b>elemento</b> se evalúa a continuación, y toma ese número 2 como entrada, y luego devuelve el segundo elemento de la lista.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-27": "Añade estos bloques debajo del bloque <b>agregar [manzana] a [fruta]</b>:<ul><li>Repetir [10]</li><ul><li>Establecer [fruta] en [elemento [elegir aleatorio [1] a [longitud de [fruta]]] de [fruta]]</li><li>Transmitir [mostrar fruta]</li><li>Piensa en [fruta] durante [5] segundos</li></ul></ul><br />Puedes encontrar el bloque pensar en la sección Apariencia y puedes agregarle la variable fruta.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-28": "¡Pruébalo!<br /><br />¡Ahora, cada 5 segundos, el murciélago elegirá una fruta al azar para pensar en ella!<br /><br />El código también enviará el mensaje <b>mostrar fruta</b>, que usaremos en breve.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-32": "Si el murciélago ha alcanzado los plátanos, queremos comprobar si esa era la fruta que quería conseguir.<br /><br />Agregue una condición <b>if … else</b> anidada dentro del bloque if y establezca la condición en <b>[fruit] = [banana]</b>, donde fruit es la variable que creó antes.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-34": "Para evitar sumar (¡o perder!) puntos más de una vez, haremos que los plátanos se escondan una vez que el murciélago los haya alcanzado.<br /><br />Agregue un bloque <b>hide</b> después del bloque if… else - eso significa que los plátanos siempre se esconderán cuando el murciélago los toque.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-36": "Añade otro sprite; esta vez, el sprite de la manzana.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-38": "Copia el código del sprite de Bananas al sprite de Apple arrastrándolo al sprite de Apple.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-39": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-40": "¡Pruébalo!<br /><br />Presiona la bandera verde para comenzar, luego intenta recolectar la fruta en la que está pensando el murciélago.<br /><br />Presiona la señal de stop roja para detener el código cuando hayas terminado.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-41": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-42": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-43": "¡Pruébalo!<br /><br />Ahora recibirás comentarios de Cog a medida que recolectas fruta.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-44": "¡Bien hecho!<br /><br />Aprendiste a usar disfraces en Blocks para animar sprites.<br /><br />También aprendiste a hacer una lista, a elegir elementos y a usarlos en un juego.<br /><br />Próximos pasos:<ul><li>¿Puedes agregar más frutas?</li><li>¿Puedes agregar algo que el murciélago nunca quiera comer?</li><li>¿Puedes hacer que el juego se vuelva más difícil con el tiempo?</li><li>¿Puedes hacer que Cog muestre la puntuación al final?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.name": "Cronómetro con temporizador de intervalos",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.description": "¡Hagamos un cronómetro con temporizador de vueltas!<br /><br />Este es un cronómetro especial que registrará tantos tiempos de vuelta como queramos.<br />Usaremos una lista para almacenarlos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-1": "¡Hagamos un cronómetro con temporizador de vueltas!<br /><br />Este es un cronómetro especial que registrará tantos tiempos de vuelta como queramos.<br />Usaremos una lista para almacenarlos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-2": "Comience haciendo una lista llamada <b>tiempos</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-3": "Añade estos bloques:<br /><ul><li>Al pulsar el botón</li><li>Añadir <b>temporizador</b> a <b>tiempos</b></li><li>Reiniciar temporizador</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-4": "Pulsa el botón del engranaje: ¡cada vez que lo pulses se añadirá una nueva hora a la lista!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-6": "Haremos que agitar el engranaje detenga el temporizador.<br /><br />Añade estos bloques:<br /><ul><li>Al agitar</li><li>Establece <b>iniciado</b> en <b>falso</b></li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-7": "Ahora cambiemos lo que hace el botón en función del estado del cronómetro, es decir, dependiendo de si está iniciado o no.<br /><br />Cambie el código debajo del bloque <b>al presionar el botón</b> a:<br /><ul><li>Al presionar el botón</li><li>Si <b>iniciado</b> = <b>verdadero</b> entonces</li><ul><li>Agregar <b>temporizador</b> a <b>tiempos</b></li></ul><li>De lo contrario</li><ul><li>Eliminar todos los <b>tiempos</b></li></ul><li>Reiniciar temporizador</li></ul><br />Por lo tanto, si el cronómetro se ha iniciado, el tiempo de vuelta se agregará a la lista. De lo contrario, la lista de tiempos antiguos se borrará y estará lista para comenzar una nueva lista.<br /><br />En ambos casos, el cronómetro se reiniciará y estará listo para registrar el siguiente tiempo de vuelta.<br /><br />¿Puedes detectar lo que falta en este código?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-8": "¡Bien hecho si notaste que también debemos establecer la variable <b>started</b> en <b>true</b> una vez que se haya iniciado el cronómetro!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-9": "Agite el engranaje para reiniciar todo, luego presione el botón para iniciar el temporizador: esto borrará los tiempos anteriores de la lista y reiniciará el temporizador.<br /><br />¡Cada vez que presione el botón después de eso, se agregará un nuevo tiempo a la lista!<br /><br />Si agita el engranaje nuevamente después de que se haya registrado el último tiempo, lo reiniciará para que la próxima vez que presione el botón inicie un nuevo conjunto de tiempos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-12": "¡Pruébalo!<br /><br />Ahora es mucho más fácil ver si el cronómetro está detenido o en marcha.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-14": "Una forma de solucionar esto es usar el bloque de difusión para enviar un mensaje que active las luces y el sonido.<br /><br />¿Recuerdas que el bloque de difusión y espera no terminaba de ejecutarse hasta que se completaba todo el código que activaba? El bloque de difusión no funciona así, por lo que, en cuanto envía el mensaje de pulsación del botón, termina de ejecutarse.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-15": "¡Pruébalo!<br /><br />Ahora es mucho más fácil ver si el cronómetro está detenido o en marcha.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-16": "¡Genial, ahora nuestro cronómetro funciona de maravilla!<br /><br />A menudo, al hacer circuitos, queremos saber nuestro tiempo promedio. ¡Hagamos que nuestro cronómetro también lo calcule!<br /><br />Añade dos variables: una llamada <b>promedio</b> y otra llamada <b>contador</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-18": "Para obtener el promedio, suma todos los números de la lista y luego divide por la cantidad de elementos.<br /><br />Iteraremos a través de la lista usando un bucle de repetición y sumaremos todos los elementos.<br /><br />Agregaremos un bloque de repetición y estableceremos la cantidad de repeticiones en <b>longitud de veces</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-19": "Utilizaremos la variable contador para llevar un registro de nuestra posición en la lista a medida que sumamos todos los tiempos.<br /><br />Dentro del bucle de repetición, agregue un bloque para <b>cambiar el contador en 1</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-20": "En los bloques, el primer elemento de la lista es el elemento 1, por lo que la primera vez que se repite el bucle, la variable del contador cambiará de 0 a 1. La segunda vez que se repite el bucle, cambiará a 2, etc.<br /><br />Luego, usaremos ese contador para aumentar la variable promedio en el siguiente número de la lista.<br /><br />Agregue el bloque <b>cambiar promedio por contador de elementos de veces</b>.<br /><br />Cuando el bucle de repetición haya terminado, habrá iterado a través de cada elemento de la lista y habrá agregado cada número a la variable promedio.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-21": "Vale, va bien, pero ahora la variable promedio en realidad almacena la suma de todos nuestros tiempos.<br /><br />Para obtener el promedio, tendremos que dividirlo por la cantidad de elementos en la lista.<br /><br />Agregue un bloque <b>establecer promedio en [promedio / contador]</b>.<br /><br />La variable contador está configurada actualmente para haber contado cuántos elementos había en la lista, por lo que podemos usarla como divisor para obtener el promedio.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-23": "¡Bien hecho!<br /><br />Has creado un cronómetro muy sofisticado que puede registrar muchísimos tiempos de vuelta, indicarte cuántos tiempos ha registrado e incluso calcular el promedio.<br /><br />¿Para qué podrías usar el cronómetro?<br /><br />¿Podrías usar las luces del engranaje para proporcionar más información cuando el cronómetro esté en marcha? ¿Quizás mostrar el paso de los segundos encendiendo los LED del engranaje?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.name": "Juego de preguntas",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.description": "¡Hagamos un juego de preguntas y respuestas!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-1": "¡Hagamos un juego de preguntas! <br/><br/>Introduciremos una lista de preguntas y respuestas, y usaremos engranajes como pulsadores para los concursantes. <br/><br/>Esta actividad utiliza varios engranajes conectados a un mismo programa. Si es posible, turnaos para compartir los engranajes entre grupos pequeños y ejecutar el programa. <br/><br/>Si solo tenéis acceso a un engranaje, pensad en cómo podríais modificar el código para usar también los sensores infrarrojos del engranaje como pulsadores, de modo que tres personas puedan jugar con un solo engranaje.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-2": "Comencemos preparando todo para el cuestionario. <br/><br/>Necesitaremos un sprite que actúe como anfitrión: elige tu favorito entre las opciones; en este ejemplo se usará un cangrejo, pero puedes usar cualquier sprite o dibujar el tuyo propio.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-3": "Necesitaremos hacer tres listas: una para <i>preguntas</i>, una para <i>respuestas</i> y una para llevar un registro de las <i>puntuaciones</i> de los concursantes. <br/><br/>Agregue tres listas llamadas preguntas, respuestas y puntuaciones.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-4": "Agrega estos bloques para completar la lista de preguntas. <br/><ul><li>Al hacer clic en la bandera verde</li><li>Elimina todas las [preguntas]</li><li>Agrega [¿Cuánto es 2+2?] a [preguntas]</li></ul>Ingresa tantas preguntas como quieras agregando más bloques <i>agregar [] a [preguntas]</i>. <br/><br/>Luego, haz lo mismo con las respuestas, asegurándote de que las preguntas coincidan con las respuestas.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-5": "Pruébelo presionando la bandera verde.<br/><br/>Las listas de preguntas y respuestas se completarán: tómese un minuto para verificar que todas las respuestas correspondan a las preguntas correctas.<br/><br/>Una vez que esté satisfecho, haga clic en las casillas de verificación junto a las listas de respuestas y preguntas para ocultarlas.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-6": "Ahora preparemos el marcador. <br/><br/>Crea una nueva variable llamada <i>número de jugadores</i> y agrega estos bloques: <ul><li>Al hacer clic en la bandera verde</li><li>Establecer [número de jugadores] en [2]</li><li>Eliminar todos los [puntajes]</li><li>Repetir [número de jugadores]</li><ul><li>Agregar [0] a los puntajes</li></ul>Cambia la configuración del número de jugadores al número que deseas tener; siempre puedes cambiarlo nuevamente más tarde.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-7": "Recorreremos la lista de preguntas y haremos que el sprite las formule. <br/><br/>Para ello, usaremos un bucle de repetición. Añade estos bloques: <ul><li>Al hacer clic en la bandera verde</li><li>Repetir [longitud de [preguntas]]</li></ul>Sin embargo, hay un pequeño problema: ¿qué pasa si el código que acabamos de ejecutar se ejecuta antes de que el otro código complete la lista de preguntas? <br/><br/>No está claro qué ocurriría exactamente; se trata de otro tipo de error, y podemos codificar las cosas de forma ligeramente diferente para asegurarnos de que el código se ejecute en el orden deseado.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-9": "Asigne al bloque el título <i>Rellenar preguntas</i> y haga clic en Aceptar.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-10": "Aparecerá un nuevo bloque en la paleta de bloques, y en el área de codificación verás un bloque de sombrero titulado <i>define [rellenar preguntas]</i>. <br/><br/>Cualquier código que pongamos debajo de ese bloque se ejecutará cada vez que llamemos al bloque <i>Rellenar preguntas</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-11": "Reemplace el bloque <i>Cuando se hace clic en la bandera verde</i> con el nuevo bloque <i>define [Rellenar preguntas]</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-12": "Coloque el nuevo bloque <i>Rellenar preguntas</i> antes del bucle de repetición.<br/><br/>Ahora, sabemos con certeza que la lista de preguntas se completará antes de evaluar su longitud y comenzar a iterar sobre ella.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-13": "Dentro del bucle de repetición, agregue estos bloques: <ul><li>Diga [elemento [1] de [preguntas]] durante [2] segundos</li><li>Transmita [respuesta ahora]</li><li>Eliminar [1] de [preguntas]</li><li>Eliminar [1] de [respuestas]</li></ul>Después de que se haya hecho cada pregunta, tanto esta como su respuesta se eliminarán de sus listas.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-16": "Crea una nueva variable llamada <i>número de jugador</i>. <br/><br/>Esta vez, asegúrate de seleccionar la opción <i>Solo para este sprite</i>. <br/><br/>Esta nueva variable será lo que llamamos una <b>variable local</b>; solo está disponible para este sprite (o este engranaje, en este caso). <br/><br/>Si vuelves al sprite, la variable desaparecerá de la lista de variables en la paleta de bloques y reaparecerá al seleccionar el engranaje.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-20": "Vuelve al sprite que añadiste antes.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-21": "Cambia el código para que dentro del bucle de repetición de las preguntas diga: <ul><li>Establecer [buzzer] en [0]</li><li>Reiniciar temporizador</li><li>Decir [elemento [1] de [preguntas]</li><li>Transmitir [respuesta ahora]</li><li>Esperar hasta que [[[buzzer] > [0]] o [[timer] > [10]]]</li><li>Eliminar [1] de [preguntas]</li><li>Eliminar [1] de [respuestas]</li></ul>Hemos usado otro <i>esperar hasta</i> con una condición <i>o</i>. <br/><br/>Ahora, cada vez que se hace una pregunta, el código esperará a que se establezca la variable buzzer o a que transcurran 10 segundos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-22": "Ahora, cada vez que se haga una pregunta, se pasará a la siguiente después de 10 segundos o tan pronto como se presione un timbre (el botón en el engranaje). <br/><br/>Aún debemos darle a nuestro concursante la oportunidad de responder la pregunta antes de pasar a la siguiente. <br/><br/>Crea un nuevo bloque llamado <i>verificar respuesta</i> y colócalo después del bloque <i>esperar hasta</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-23": "Debajo del bloque <i>define [check answer]</i>, agregue un bloque <i>if … else</i> con la condición <i>[buzzer] > [0]</i>. <br/><br/>Esto verificará si se presionó un timbre a tiempo o no.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-24": "Si se pulsa el botón, daremos a la persona que lo pulsó unos segundos para responder a la pregunta. <br/><br/>Añade estos bloques dentro de la condición if: <ul><li>Difundir [botón pulsado]</li><li>Decir [unirse [Sí, número de jugador] [botón pulsado]] durante [6] segundos</li></ul>El bloque <i>unir</i> se encuentra en la categoría Operadores; une dos bloques (o cadenas) de texto.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-26": "Hagamos algo con el mensaje de <i>confirmar respuesta</i>. <br/><br/>Seleccione Cog nuevamente.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-28": "Agregue un <i>set LEDs</i> usando el bloque ColorPicker dentro de la condición if y configúrelo para que muestre un LED rojo junto al sensor de objeto IR izquierdo y uno verde junto al sensor de objeto IR derecho.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-29": "Agrega estos bloques: <ul><li>Esperar hasta que [[[obstáculo detectado [izquierda]] = [verdadero]] o [[obstáculo detectado [derecha]] = [verdadero]]]</li><li>Si [[obstáculo detectado [derecha]] = [verdadero]] entonces</li></ul>Reemplazar el elemento [número de jugador] de [puntuaciones] con [[elemento [1] de [puntuaciones]] + [1]]<br/><br/>Si no<br/><ul><li>Reemplazar el elemento [número de jugador] de [puntuaciones] con [[elemento [1] de [puntuaciones]] - [1]]</li></ul>Apagar todos los LED. <br/><br/>El bloque <i>esperar hasta</i> esperará hasta que los sensores IR izquierdo o derecho detecten un objeto; aquí es donde esperamos a que el jugador seleccione si su respuesta es correcta o incorrecta. <br/><br/>Si aciertan, habrán cubierto el sensor IR correcto, ya que ahí es donde colocamos la luz verde. <br/><br/>En ese caso, su puntuación en el marcador se incrementará en 1. <br/><br/>De lo contrario, se reducirá en 1. <br/><br/>De esta forma, su puntuación aumentará si aciertan y disminuirá si fallan. <br/><br/>¡Así que ten cuidado! Si pulsas el botón pero no sabes la respuesta, ¡perderás puntos!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-30": "También deberíamos añadir una cuenta atrás para que el jugador sepa cuánto tiempo tiene para responder. <br/><br/>Usaremos el mensaje <i>buzzed</i> que configuramos anteriormente para ello. <br/><br/>Crea otra variable llamada <i>ledID</i> y, de nuevo, configúrala para que sea <i>solo para este sprite</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-31": "Añade estos bloques: <ul><li>Cuando recibo [buzzed]</li><li>Si [[buzzer] = [player number]] entonces</li><ul><li>Establece [ledID] en [0]</li><li>Repite [6]</li><ul><li>Establece el LED [ledID] en [purple]</li><li>Establece el LED [[ledID] + [1]] en [purple]</li><li>Espera [1] segundos</li><li>Cambia [ledID] por [2]</li></ul></ul></ul>Ahora, durante los 6 segundos que tiene el jugador para responder la pregunta, verá una cuenta regresiva en los LED de cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-32": "¡Pruébalo! <br/><br/>Las preguntas se harán una tras otra. Si pulsas el botón, tendrás 6 segundos para responder mientras el engranaje muestra una cuenta regresiva. Luego, se te pedirá que selecciones rojo o verde, según si respondiste mal o bien.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-34": "En la condición vacía <i>else</i> de la definición <i>check answer</i>, agregue estos bloques: <ul><li>Decir [¡Demasiado lento!] durante [2] segundos</li><li>Decir [join [La respuesta fue] [item [1] de [answers]] durante [5] segundos</li></ul>De esta manera, si nadie pulsa el botón a tiempo, el sprite leerá la respuesta correcta para todos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-35": "¡Es hora de agregar más engranajes para que podamos tener más jugadores!<br/><br/>Haga clic derecho en el engranaje y seleccione <i>duplicar</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-36": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-37": "Además de duplicarse el código, también se habrán duplicado las variables <i>locales</i> que creamos.<br/><br/>Con este nuevo engranaje seleccionado, cambie el número de jugador a 2.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-38": "¡Conecta un segundo engranaje y pruébalo!<br/><br/>El engranaje que vibre primero después de que se haga una pregunta tendrá la oportunidad de responder.<br/><br/>¡Puedes añadir más jugadores duplicando engranajes!<br/><br/>Recuerda actualizar la variable <i>número de jugadores</i> en cada engranaje.<br/><br/>También tendrás que configurar la variable número de jugadores para que coincida con el <i>número</i> de jugadores.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-39": "¡Bien!<br/><br/>Ahora necesitamos averiguar quién es el ganador al final del cuestionario.<br/><br/>Regresa al código del sprite<br/><br/>Crea otro bloque llamado <i>anunciar ganadores</i> y llámalo después del bucle de preguntas principal.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-40": "Primero, calcularemos cuál es la puntuación más alta. <br/><br/>Crea otro bloque llamado <i>encontrar puntuación máxima</i>. <br/><br/> Debajo del bloque <i>define [find max score]</i>, agrega estos bloques:<ul><li>set [maxScore] to [item [1] of [scores]]</li><li>set [playerID] to [1]</li><li>repeat [length of [scores]]</li><ul>if [[item [playerID] of [scores]] > [maxScore]] then</li><ul><li>set [maxScore] to [item [playerID] of [scores]]</li><ul><li>change [playerID] by [1]</li></ul></li></ul></li></ul><br/><br/> Necesitarás crear las variables <i>maxScore</i> y <i>playerID</i>. <br/><br/>Este código <li>recorrerá</li> el marcador, paso a paso, y asignará a la variable <i>maxScore</i> la puntuación más alta que encuentre.<br/><br/>Haz clic en esta sección del código para ejecutarlo; la variable <i>maxScore</i> debería terminar con el valor más alto de la lista de puntuaciones.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-41": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-42": "Añade estos bloques al bloque <i>define [cuántos jugadores tienen puntuación [score]]</i>:<ul><li>establece [resultado] a [0]</li><li>establece [ID del jugador] a [0]</li><li>repite [longitud de [puntuaciones]]</li><ul><li>cambia [ID del jugador] por [1]</li><li>si [[elemento [ID del jugador] de [puntuaciones]] = [puntuación]] entonces</li><ul><li>cambia [resultado] por [1]</li></ul></ul></ul>Este nuevo bloque (o función) es un poco diferente a los que creamos antes, ya que acepta un parámetro: la puntuación que queremos buscar.<br/><br/>Puedes arrastrar el parámetro <i>puntuación</i> desde el bloque define para usarlo en tu código. Es como una variable, pero solo se puede usar en esta función.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-43": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-44": "Comencemos a construir la función <i>anunciar ganadores</i> que creamos anteriormente. Agregue estos bloques al bloque <i>define [announce winners]</i>: <ul><li>Buscar puntuación máxima</li><li>Cuántos jugadores tienen la puntuación [maxScore]</li><li>Si [[result] = [1] entonces</li><ul><li>Diga [unirse a [El ganador, con una puntuación de ] [maxScore]] durante [5] segundos</li><li>Diga [unirse a [es Jugador ] [número de elemento de [maxScore] en [scores]]</li></ul></ul>Ahora, cuando esto se ejecuta, la variable <i>maxScore</i> se establecerá con la puntuación más alta según la función <i>buscar puntuación máxima</i>. Luego, la variable <i>resultado</i> se establecerá con el número de jugadores con esa puntuación según el bloque <i>cuántos jugadores tienen la puntuación [maxScore]</i>. Si solo hay un ganador, es muy fácil decir quién es, y podemos usar el número de elemento de [maxScore] en el bloque [scores] para consultar su puntuación en el marcador. Pero si hay un empate y hay más de un ganador, la cosa se complica un poco más.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-45": "Dentro de la parte <i>else</i> del bloque <i>if … else</i>, agrega estos bloques: <ul><li>Decir [join [join [Hay ] [result]] [ ¡ganadores!]] durante [5] segundos</li><li>Decir [join [Con puntuaciones de ] [maxScore]] durante [5] segundos</li><li>Establecer [winners] como [join [Player] [elemento n.° de [maxScore] en [scores]]</li><li>Establecer [playerID] como [elemento n.° de [maxScore] en [scores]]</li><li>Repetir hasta que [[playerID] = [longitud de [scores]]</li><li>Cambiar [playerID] en [1]</li><li>Si [[elemento [playerID] de [scores] = [maxScore]] entonces</li><li>Establecer [winners] como [join [join [winners] [ y [Jugador]] [IDjugador]</li><li>Decir [ganadores]</li></ul>Si hay más de un ganador, el sprite indicará cuántos hay y los listará. Las variables pueden almacenar más que solo números; aquí, la variable <i>ganadores</i> se usa para crear una cadena de texto que enumera a todos los ganadores.</br></br>El bucle <i>repetir hasta</i> itera desde la primera puntuación de la lista que coincide con la variable <i>puntuaciónmáx</i> hasta el final. Cada vez que encuentra otra puntuación que coincide, agrega ese jugador a la variable <i>ganadores</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-46": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-47": "¡Bien hecho! Programaste un concurso usando engranajes como pulsadores para los concursantes.<br/><br/>Usaste <b>listas</b> para almacenar las preguntas, las respuestas y los marcadores.<br/><br/>Usaste <b>variables locales</b> para que cada engranaje pudiera llevar un registro de su número de jugador por separado.<br/><br/>Aprendimos a usar <b>funciones</b> (creando nuestros propios bloques) para mantener nuestro código ordenado y más fácil de leer. Un código fácil de leer es más fácil de depurar, y dividir secciones largas y complejas de código en fragmentos más pequeños se llama <b>descomposición funcional</b>.<br/><br/>Las funciones también son muy útiles cuando se quiere ejecutar código más de una vez y no se quiere copiarlo y pegarlo repetidamente.<br/><br/>También aprendiste cómo las funciones pueden tener parámetros. ¿Cuántos jugadores con puntuación tiene la función que se debe buscar?<br/><br/>Siguientes pasos<ul><li>¿Puedes añadir más preguntas y respuestas (y quizás más engranajes) a tu cuestionario?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.description": "¡Vamos a crear un rastreador de movimiento!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-1": "¡Construyamos un rastreador de movimiento con Cog!<br/><br/>Usaremos el acelerómetro para recopilar datos sobre el movimiento y luego los usaremos para clasificar cada minuto que pasa como activo o no.<br/><br/>Luego podemos mostrar un tablero de actividad física y solicitar al usuario que se mueva si no ha estado muy activo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-2": "Crea una lista llamada <i>ax</i><br/><br/>La usaremos para almacenar lecturas recientes del eje x del acelerómetro.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-3": "Añade estos bloques:<ul><li>Al hacer clic en la bandera verde</li><li>Establecer [numSamples] en [10]</li><li>Eliminar todo [ax]</li><li>Repetir [numSamples]</li><ul><li>Agregar [Acelerómetro [X]] a [ax]</li></ul><li>Para siempre</li><ul><li>Establecer [sampleCounter] en [[[sampleCounter] mod [numSamples]] + [1]]</li><li>Reemplazar el elemento [sampleCounter] de [ax] con [Acelerómetro [X]]</li><li>Esperar [0.1] segundos</li></ul></ul><br/>Necesitarás crear las variables <i>numSamples</i> y <i>sampleCounter</i>.<br/><br/>¿Qué crees que hará este código?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-4": "¡Pruébelo!<br/><br/>Presione la bandera verde para ejecutar el código y luego mueva el engranaje.<br/><br/>Verá que la lista ax se actualiza cada 0,1 segundos con la última lectura (o <i>muestra</i>) del eje x del acelerómetro.<br/><br/>Cada nueva muestra en la lista ax reemplaza a la más antigua, y usamos el operador <i>mod</i> para garantizar que la variable <i>sampleCounter</i> recorra desde el final de la lista hasta el principio de la misma.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-5": "Necesitamos una forma de determinar si los datos recopilados muestran si el engranaje se está moviendo o no.<br/><br/>Una forma sencilla de hacerlo es observar cuánto cambia: el movimiento debería significar aceleración, que medirá el acelerómetro.<br/><br/>Crearemos un nuevo bloque llamado <i>obtener rango</i>, que calculará cuánto varían los datos en la lista de ejes.<br/><br/>Añade estos bloques:<ul><li>Definir [obtener rango]</li><li>Establecer [contador de rango] en [0]</li><li>Establecer [mínimo] en [elemento [1] de [eje]]</li><li>Establecer [máximo] en [elemento [1] de [eje]]</li><li>Repetir [longitud de [eje]]</li><ul><li>Cambiar [contador de rango] en [1]</li><li>Establecer [muestra] en [elemento [contador de rango] de [eje]]</li><li>Si [[muestra] < [min]] entonces</li><ul><li>Asignar [muestra] a [min]</li></ul><li>Si [[muestra] > [máximo]] entonces</li><ul><li>Asignar [muestra] a [máximo]</li></ul><li>Asignar [resultado] a [[máximo] - [min]]</li></ul></ul><br/>Esta función iterará a través de toda la lista ax, una muestra a la vez, y seleccionará los valores mínimo y máximo.<br/>Al final, asignará a la variable resultado la diferencia entre ambos.<br/>Un mayor recorrido implicará que se registre un rango de valores mayor.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-7": "¡Pruébalo!<br/>Ahora, cada segundo, el programa revisará la lista de muestras del acelerómetro y determinará si ha habido movimiento o no.<br/><br/>Toma las 10 lecturas individuales del acelerómetro (o muestras) y calcula una única detección de movimiento (verdadera o falsa).<br/><br/>Podemos modificar las variables que hemos configurado para ajustar este comportamiento.<br/><br/>Por ejemplo, podemos cambiar el <i>umbral de movimiento</i> para que el programa sea más o menos sensible a los movimientos.<br/><br/>También podemos cambiar el <i>número de muestras</i> para variar la duración de cada instantánea de movimiento que analizamos. Con 10 muestras tomadas a intervalos de 0,1 segundos, buscamos si ha habido movimiento durante el último segundo, pero si aumentamos el <i>número de muestras</i>, comprobará el movimiento durante un período más largo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-10": "Dentro de la condición <i>if [[result] > [motionThreshold] then</i>, agregue un bloque <i>change [activeSeconds] by [1]</i><br/>Con este código, contaremos cuántos segundos de cada 60 creemos que están activos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-12": "¡No olvidemos borrar la lista <i>activeMinutes</i> al inicio del programa!<br/>Agregue un bloque <i>eliminar todo [activeMinutes]</i> después del bloque <i>establecer [activeSecondsThreshold]</i><br/>Siempre debe recordar restablecer todas sus variables y listas al inicio de un programa: esto se llama inicializar sus variables, y si olvida hacerlo, ese es otro lugar donde pueden aparecer errores.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-13": "¡Pruébelo!<br/><br/>Cada vez que se detecte movimiento durante más de 30 segundos durante cada ventana de 60 segundos, ese minuto se registrará como verdadero en la lista <i>activeMinutes</i>.<br/><br/>De lo contrario, se registrará un <i>falso</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-14": "Obtengamos más información útil para mostrarle al usuario<br/>Cree dos nuevas variables llamadas <i>totalActiveSeconds</i> y <i>totalSeconds</i><br/>Inicialícelas a ambas configurándolas en 0 al inicio del programa",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-15": "¿Puedes pensar dónde deberías agregar bloques para aumentar estas nuevas variables?<br/><br/>Un lugar potencial es como se muestra aquí, donde <i>totalActiveSeconds</i> se incrementa cada vez que <i>activeSeconds</i> se incrementa, y <i>totalSeconds</i> se incrementa en cada iteración del bucle <i>repeat [60]</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-16": "¡Pruébalo!<br/>Ahora el programa también registrará la proporción de segundos activos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-19": "Añade estos bloques:<ul><li>Cuando recibo [estadísticas del informe]</li><li>Di [join [join [join [join [Has estado activo durante ] [totalActiveSeconds]] [ de ]] [totalSeconds]] [ segundos]] durante [5] segundos</li><li>Di [join [join [Eso es [alrededor de [[[totalActiveSeconds] / [totalSeconds]] * 100]]] [% del tiempo]] durante [5] segundos</li></ul><br/>Ahora, una vez por minuto, el sprite le dirá al usuario qué tan activo ha estado y cuál es ese porcentaje del tiempo transcurrido.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-20": "¡Pruébalo!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-21": "Agregue estos bloques:<ul><li>Establezca [minuteCounter] en [0]</li><li>Establezca [totalActiveMinutes] en [0]</li><li>Repita [duración de [activeMinutes]]</li><ul><li>Cambiar [minuteCounter] por [1]</li><li>Si [[item [minuteCounter] de [activeMinutes]] = [true]] entonces</li><ul><li>Cambiar [totalActiveMinutes] por [1]</li></ul></ul><li>Diga [join [join [join [join [And] [totalActiveMinutes]] [ de ]] [duración de [activeMinutes]]] [ minutos]] durante [5] segundos</li><li>Diga [join [join [Eso es] [[round [[[totalActiveMinutes] / [duración de [activeMinutes]] * 100]]] [% de los minutos]] para [5] segundos</li></ul><br/>Ahora el sprite también dirá cuántos minutos hemos clasificado como activos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-22": "¡Pruébelo!<br/><br/>Probablemente encontrará que los dos porcentajes informados difieren entre sí; esto se debe a las dos formas diferentes en que agrupamos y clasificamos los datos.<br/><br/>Cada vez que alguien programa un sistema para convertir muchas lecturas individuales en estadísticas más simples, debe tomar decisiones sobre cómo hacerlo; es nuestro trabajo como programadores tratar de asegurarnos de que el resumen sea lo más preciso posible y no engañoso.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-23": "El porcentaje de segundos activos sin duda parece un resumen más preciso de la actividad general de nuestro usuario, pero eso no significa que la lista de minutos activos no sea útil. Es una estimación más pesimista de la actividad, pero sí muestra si alguien no se está moviendo mucho.<br/><br/>Añadamos algo para animar al usuario a hacer ejercicio si no se ha movido mucho en los últimos 5 minutos.<br/><br/>Añade estos bloques:<ul><li>Si [[longitud de [minutosActivos]] > [4]] entonces</li><ul><li>Establecer [minutosActivosTotales] en [0]</li><li>Repetir [5]</li><ul><li>Si [[elemento [contadorDeMinutos] de [minutosActivos]] = [verdadero]] entonces</li><ul><li>Cambiar [minutosActivosTotales] en [1]</li></ul><li>Cambiar [contadorDeMinutos] en [-1]</li></ul><li>Si [[minutosActivosTotales] = [0]] entonces</li><ul><li>Emitir [señal] [usuario]</li><li>Decir [No te has movido mucho en los últimos 5 minutos]</li></ul></ul></ul><br/>Tras leer las estadísticas principales, el código comprobará si hay al menos 5 minutos registrados en la lista <i>activeMinutes</i>.<br/>Si los hay, retrocederá por los 5 minutos más recientes de la lista y contará cuántos de ellos fueron minutos activos.<br/>Si ninguno lo fue, se enviará el mensaje <i>signal user</i> y el sprite le informará al usuario de que no se ha movido mucho.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-24": "Vuelva a cambiar a Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-26": "¡Pruébalo!<br/>Coloca Cog en tu bolsillo y deja tu código ejecutándose mientras haces otro trabajo o te diviertes: mira lo que informa.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-27": "¡Bien hecho!<br/>¡Has convertido a cog en un monitor de actividad física!<br/>Medirá tu nivel de actividad y te recordará que te muevas si permaneces inmóvil demasiado tiempo.<br/><br/>En la vida real, estar sentado 5 minutos sin moverse está bien, pero es importante mantenerse activo y moverse con regularidad.<br/><br/>¿Cuánto tiempo al día crees que deberías estar activo? ¿Y con qué frecuencia?<br/><br/>Aprendiste a recopilar y analizar datos, y a clasificarlos a partir de un amplio conjunto de muestras en una simple medición de actividad, verdadera o falsa. Por cada minuto, se tomaron 600 mediciones del acelerómetro, y las redujimos a una sola nota que indicaba si ese minuto fue activo o no.<br/><br/>Piensa en el resto del software y los sistemas que toman decisiones y clasificaciones. ¿Qué tipo de decisiones tuvieron que tomar los programadores al diseñarlos y qué podría salir mal?<br/><br/><b>Próximos pasos<ul><li>Piensa si cambiarías alguno de los diversos umbrales y otras variables que controlan el comportamiento de nuestro rastreador de actividad física.</li><li>Piensa en qué otras estadísticas de resumen te gustaría que tu rastreador de actividad física reportara y cómo podrías calcularlas.</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.name": "Detección de gestos ML",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-1": "¡Usemos el aprendizaje automático para reconocer movimientos específicos con Cog!<br/><br/>¡Entrenaremos un modelo para reconocer gestos y los usaremos como parte de un juego de memoria basado en el aprendizaje de hechizos!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-3": "Seleccione el icono <i>+</i> y haga clic en la opción <i>Nuevo modelo de acelerómetro</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-5": "Los datos que usaremos para entrenar este modelo serán los tres ejes del acelerómetro. <br/><br/> Puedes ver estos datos en tiempo real en esta pantalla, al igual que en el panel del sensor.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-7": "Esto creará una clase llamada <i>nada</i>. <br/>Tendremos una clase para cada tipo de movimiento que queramos detectar, lo que también implica tener un caso base de ausencia de movimiento.<br/><br/>Ahora necesitamos recopilar datos de entrenamiento para la clase <i>nada</i>. Puedes recopilar muestras de datos para modelos de acelerómetro como este manteniendo pulsado el botón de Cog.<br/><br/>Toma Cog, mantenlo firme y pulsa el botón durante un par de segundos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-8": "Gira el engranaje a una posición diferente, mantenlo fijo y luego pulsa el botón de nuevo durante un par de segundos para recoger una nueva muestra.<br/>Repite este proceso con diferentes posiciones hasta obtener entre 10 y 20 muestras.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-9": "Ahora crea otra clase llamada <i>swoosh</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-10": "Esta vez, desea grabar muestras de cómo realizar un movimiento lento de un lado a otro.<br/>Mueva el engranaje suavemente hacia adelante y hacia atrás y mantenga presionado el botón para cada movimiento individual; suéltelo una vez que haya terminado el movimiento.<br/>Con suerte, el movimiento que grabe aquí se reconocerá más tarde y se clasificará como un swoosh.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-11": "Nuevamente, asegúrese de tener al menos 10 muestras.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-12": "Ahora crea otra clase llamada <i>flick</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-13": "Este será un movimiento rápido y breve.<br/>Nuevamente, grabe muestras presionando el botón el tiempo suficiente para capturar un movimiento.<br/>Intente obtener ejemplos de diferentes posiciones de finalización para asegurarse de que sean representativos de los movimientos que desea detectar más adelante.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-14": "Asegúrate de tener al menos 10 muestras de nuevo.<br/>Probablemente verás que, para la clase <i>nada</i>, las líneas de las muestras individuales son bastante planas. En el <i>swoosh</i> hay una que forma una gran curva hacia abajo y hacia arriba.<br/>Y las líneas del <i>flick</i> son mucho más irregulares; si vieras estas muestras, probablemente podrías clasificarlas en una de nuestras tres etiquetas: <i>nada</i>, <i>swoosh</i> y <i>flick</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-15": "¡Bien, veamos si podemos lograr que la computadora lo haga!<br/>Haz clic en el botón <i>Entrenar</i>. Esto examinará todos los datos de entrenamiento etiquetados e intentará construir un modelo que pueda clasificar los nuevos datos a medida que llegan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-16": "Verá un aviso sobre un gráfico de pérdida de carga y, a continuación, aparecerá un gráfico.<br/>El gráfico de pérdida muestra el rendimiento del modelo paso a paso, a medida que intenta clasificar repetidamente los datos de entrenamiento. Cada iteración de entrenamiento se denomina época (época), que es lo que se muestra en el eje x del gráfico de pérdida.<br/>Una pendiente descendente pronunciada en el gráfico de pérdida significa que el modelo cambia mucho en cada época y mejora su clasificación de datos.<br/>El entrenamiento finalizará cuando el nivel de pérdida ya no cambie mucho.<br/>Una pérdida baja significa que ha podido clasificar con precisión la mayoría de los datos de entrenamiento que le proporcionamos, por lo que queremos que la pérdida final sea baja.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-17": "Ahora, pulsa el botón <i>Ejecutar</i> para probar el modelo con nuevos datos.<br/>Luego, mueve el engranaje: intenta realizar los dos movimientos con los que lo entrenaste y comprueba si los reconoce.<br/>Las tres barras de porcentaje representan el nivel de confianza del modelo en su clasificación.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-19": "Cuando estés satisfecho, pulsa <i>Entrenar</i> para entrenar el modelo de nuevo.<br/>Luego, <i>Ejecutar</i> y comprueba si estás satisfecho con el rendimiento.<br/>Seguía teniendo problemas con el modelo, que detectaba un <i>swoosh</i> antes de cada <i>flick</i>, cuando no lo había. Para intentar solucionarlo, añadí algunos ejemplos a la clase <i>nada</i> en los que giraba Cog de horizontal a vertical; el tipo de movimiento que hago antes de un flick, que se estaba clasificando erróneamente como un swoosh.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-20": "Su modelo estará bien entrenado cuando cada detección sea distinta y clara, como aquí, donde va directamente de <i>nada → swoosh</i> y viceversa, y lo mismo para <i>nada → movimiento rápido</i> y viceversa.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-21": "Cuando estés completamente satisfecho, haz clic en el botón <i>Guardar</i>.<br/><b>No podrás realizar ningún cambio ni agregar más muestras a este modelo después de hacer clic en Guardar.</b><br/>Esto se debe a que los datos de entrenamiento originales ya no son necesarios y, por lo tanto, se descartan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-22": "¡Bien, con tu modelo guardado, estás listo para usarlo en un programa!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-23": "Regresar a la pestaña <i>Código</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-24": "Ir a la categoría <i>ML</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-26": "Añade estos bloques: <ul><li>Al hacer clic en la bandera verde</li><li>Cargar modelo de aprendizaje automático [gesto]</li><li>Etiquetar cada [1] segundo</li><li>Establecer umbral de confianza [0,5]</li></ul><br/>Esto iniciará el modelo de <i>gesto</i> que entrenamos. Actualizará su clasificación del movimiento que cree que está ocurriendo cada segundo.<br/><br/>¿Recuerdas que, al probar el modelo, vimos barras de porcentaje que indicaban su confianza en las detecciones? El <i>umbral de confianza</i> establece un umbral para la certeza que debe tener el modelo antes de emitir una clasificación.<br/>Lo dejaremos en 0,5 (o 50 %) por ahora, pero es posible que debamos aumentarlo más adelante si el modelo emite clasificaciones falsas.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-27": "¡Pruébalo!<br/>Presiona la bandera verde y el modelo comenzará a correr y a clasificar el movimiento.<br/>Prueba tus movimientos de <i>swoosh</i> y <i>flick</i>, ¡y deberías ver que se detectan!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-28": "Agrega estos bloques:<ul><li>Cuando se reciba la etiqueta del acelerómetro [swoosh]</li><li>Activa los LEDs del anillo [ring] en [verde]</li><li>Emite [swoosh] y espera</li><li>Espera [1] segundos</li><li>Apaga todos los LEDs</li></ul><p>Y</p><ul><li>Cuando se reciba la etiqueta del acelerómetro [flick]</li><li>Activa los LEDs del anillo [ring] en [rojo]</li><li>Emite [flick] y espera</li><li>Espera [1] segundos</li><li>Apaga todos los LEDs</li></ul><br/>Ahora Cog reaccionará mostrando luces y emitiremos un mensaje cada vez que se detecte un swoosh o un flick.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-29": "¡Pruébalo!<br/>Ahora, cuando hagas los movimientos, el engranaje se iluminará.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-30": "¡Vale, vamos a crear un juego de memoria usando el detector de movimiento!<br/>Añade un sprite de <i>Bruja</i> y muévelo a la esquina inferior izquierda.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-31": "Ahora seleccione el <i>Escenario</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-32": "Y ve a la pestaña <i>Disfraces</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-33": "Agrega el texto “Aprende a deletrear”.<br/>Esta será la pantalla de título del juego.<br/>También puedes agregar otras decoraciones si quieres; por ejemplo, aquí hemos añadido un trapecio morado y un contorno blanco alrededor del texto.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-34": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-36": "Añade también <i>Castillo 2</i> y <i>Casa de la Bruja</i> para tener cuatro fondos en total.<br/>Cambia el nombre del primero a <i>Pantalla de título</i> para que podamos identificarlo fácilmente.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-39": "También necesitamos uno para el movimiento de deslizamiento.<br/><br/>Añade estos bloques:<ul><li>Cuando reciba [deslizamiento]</li><li>Si [[fondo [nombre]] = [Castillo 2]] entonces<ul><li>Repetir [50]<ul><li>Cambiar el efecto [ojo de pez] en [10]</li><li>Cambiar el efecto [remolino] en [-10]</li></ul></li><li>Cambiar el fondo a [Casa de la Bruja]</li><li>Repetir [50]<ul><li>Cambiar el efecto [ojo de pez] en [-10]</li><li>Cambiar el efecto [remolino] en [10]</li></ul></li><li>Emitir [iniciar juego]</li></ul></li></ul><br/>Quizás te resulte más rápido hacer clic derecho y duplicar este código; solo asegúrate de modificarlo en los lugares correctos y añade el bloque de emisión.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-40": "Ahora selecciona el sprite de la <i>Bruja</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-41": "Necesitamos añadir algunas instrucciones a los pasos del tutorial.<br/><br/>Añade estos bloques:<ul><li>Cuando el fondo cambie a [Castillo 3]</li><li>Espera [2] segundos</li><li>Di [Es hora de salir del castillo] durante [2] segundos</li><li>Di [Agita la varita para transportarnos fuera]</li></ul><p>Y</p><ul><li>Cuando el fondo cambie a [Castillo 2]</li><li>Espera [2] segundos</li><li>Di [Vamos a mi casa a practicar hechizos] durante [2] segundos</li><li>Di [Agita la varita para transportarnos allí]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-42": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-43": "Con Cog seleccionado, presiona la bandera verde para ejecutar el código.<br/>Necesitarás hacer un <i>swoosh</i> y un <i>flick</i> para ayudar a la bruja a viajar mágicamente del castillo al bosque, y luego del bosque a su casa.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-44": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-45": "Añade estos bloques:<ul><li>Al recibir [iniciar juego]</li><li>Eliminar todos los [gestos]</li><li>Añadir [swoosh] a [gestos]</li><li>Añadir [flick] a [gestos]</li><li>Establecer [vidas] en [3]</li><li>Establecer [longitud de secuencia] en [2]</li></ul><br/>Necesitarás crear una lista llamada <i>gestos</i> y las variables <i>vidas</i> y <i>longitud de secuencia</i>.<br/>La lista de gestos mostrará todos los movimientos posibles que podemos realizar. Si quieres ampliar el juego con más movimientos, puedes añadirlos aquí una vez que hayas entrenado un modelo con ellos.<br/>Le daremos a nuestro jugador 3 vidas para empezar, y perderá una cada vez que se equivoque.<br/>Y comenzaremos con una secuencia de 2 movimientos.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-46": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-47": "Agrega estos bloques:<ul><li>Definir [crear una secuencia de [longitud] gestos]<ul><li>Eliminar todo [secuencia]</li><li>Repetir [longitud]<ul><li>Agregar [elemento [elegir aleatoriamente [1] a [longitud de [gestos]]] de [gestos]] a [secuencia]</li></ul></li></ul></li></ul><br/>Necesitarás crear otra lista llamada <i>secuencia</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-48": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-49": "Añade estos bloques:<ul><li>Cuando recibo [movimiento rápido]</li><li>Añadir [movimiento rápido] a [entrada del usuario]</li></ul><p>Y</p><ul><li>Cuando recibo [swoosh]</li><li>Añadir [swoosh] a [entrada del usuario]</li></ul><br/>Necesitarás crear otra lista llamada <i>entrada del usuario</i>.<br/>Aquí es donde registraremos los movimientos que ha realizado el jugador, para poder compararlos con los que debía hacer.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-50": "Agrega estos bloques después del bloque <i>crear una secuencia de [longitudSecuencia] gestos</i>:<ul><li>Di [Voy a leer algunos gestos] durante [2] segundos</li><li>Di [Debes hacerlos en el mismo orden] durante [2] segundos</li><li>Di [¿Listos?] durante [2] segundos</li><li>Repite [10]<ul><li>Di [secuencia] durante [2] segundos</li></ul></li><li>Borra toda la [entrada del usuario]</li><li>Espera hasta que [[longitud de la [entrada del usuario]] = [longitud de la [secuencia]]]</li><li>Si [[entrada del usuario] = [secuencia]] entonces<ul><li>Di [¡Bien hecho!] durante [2] segundos</li><li>Di [Hagámoslo más complicado] durante [2] segundos</li><li>Cambia [longitudSecuencia] en [1]</li><li>Realiza una secuencia de [longitudSecuencia] gestos</li></ul></li><li>Si no<ul><li>Si [[vidas] > [0]] entonces<ul><li>Di [¡Ups! Casi] durante [2] segundos</li><li>Di [Inténtalo de nuevo…] durante [2] segundos</li><li>Cambia [vidas] en [-1]</li></ul></li><li>Si no<ul><li>Finaliza el juego</li></ul></li></ul></li></ul><br/>Necesitarás crear un nuevo bloque llamado <i>finalizar juego</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-51": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-52": "Selecciona Cog de nuevo y ¡pruébalo!<br/>Aún puedes poner el juego en pantalla completa antes de iniciarlo, para que sea más fácil ver lo que dice la Bruja.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-53": "¡Bien hecho!<br/>Has aprendido sobre Aprendizaje Automático y has entrenado un modelo para clasificar gestos a partir de datos de movimiento.<br/>Pudiste recopilar muchas muestras para entrenar el modelo y probarlo antes de guardarlo y usarlo en tu código.<br/>¡Luego usaste funciones y listas para crear un juego de memoria!<br/><br/><b>Próximos pasos</b><br/>• ¿Podrías añadir un tercer gesto al juego?<br/>• Experimenta ajustando los parámetros de Aprendizaje Automático: el umbral de confianza y la frecuencia de etiquetado.<br/>• Crea un mejor final para el juego si el jugador es capaz de recordar secuencias de movimientos muy largas.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-2": "Imagina una variable como una caja de almacenamiento etiquetada. Una variable tiene tres partes: un nombre, un tipo y un valor.<br /><br /> El <b/>nombre</b> nos dice <i/>\"¿cómo llamamos a esta caja?\"</i> <br /> El <b/>tipo</b> nos dice <i/>\"¿qué tipo de cosas guardamos en esta caja?\"</i>><br /> El <b/>valor</b> nos dice <i/>\"¿qué es exactamente lo que guardamos actualmente en la caja?\"</i> <br /><br /> En este ejercicio, vamos a crear y usar una variable llamada <b/>mi contador</b> para ayudar a Marty a contar hasta diez.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-3": "Primero, definamos nuestra variable como <b/>mi contador</b>.<br /><br />Seleccione \"Crear una variable\" y llámela <b/>mi contador</b>. Haga clic en \"Aceptar\" y observe cómo la variable aparece en la esquina superior izquierda, con un valor actual de 0.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-6": "Si queremos que Marty cuente de 0 a 10, necesitamos añadir +1 a mi contador cada vez que le digamos un número.<br /><br />En las variables, podemos seleccionar el bloque «Cambiar mi contador en 1», que añadirá +1 a mi contador.<br /><br />Coloca esto antes de «Marty habla», como se muestra a continuación. Haz clic en estos bloques y escucha a Marty decir «uno».",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-7": "Haz clic nuevamente en el bloque de código y Marty dirá \"dos\". <br/><br/>¡Haz clic en el bloque de código hasta que Marty cuente del 1 al 10!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-10": "Queremos repetir este proceso hasta que mi contador supere 10.<br /><br />Selecciona el bloque \"más que\". Colócalo en el rombo de \"repetir hasta\" y cambia 50 por 10.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-12": "Recuerda el paso 8: queremos poner <b/>mi contador</b> a cero cada vez que queramos empezar a contar. <br /><br /> Arrastra el bloque <b/>poner mi contador a 0</b> y colócalo antes del bloque de repetición, así.<br /><br /> Ahora Marty siempre empezará desde 0.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-14": "¡Lo lograste! ¡Ahora sabes cómo usar variables, manipularlas y crear un <b/> ​​bucle iterativo </b> para ayudar a Marty a contar hasta diez!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.description": "¡Aprenda cómo las computadoras controlan el código que sucede al mismo tiempo!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-1": "En este tutorial, aprenderemos cómo los programadores usan <b/>programas paralelos, condiciones de carrera y exclusión mutua</b> para controlar el orden en que se ejecutan los fragmentos de código.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-3": "Entonces, ¿cómo recuperan el control los programadores cuando surgen condiciones de carrera? <br/><br/> Usan la exclusión mutua para decir cosas como: «No camines hacia atrás hasta que yo camine hacia adelante primero». <br/><br/> La exclusión mutua se puede implementar mediante muchos métodos diferentes, como sentencias if, bloques de espera, control de variables y muchos más. <br/><br/><br/><i/>Haz clic en la imagen para ampliar el diagrama.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-5": "Coloca un bloque <b/>caminar 2 pasos hacia adelante</b> después del bloque de la bandera verde.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-6": "Seleccione un segundo bloque <b/>cuando se hace clic en la bandera verde</b> y arrástrelo al área de secuencias de comandos para crear nuestro código paralelo de \"caminar hacia atrás\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-8": "¿Notaste que Marty caminó primero hacia adelante y luego hacia atrás? Investiguemos por qué.<br/><br/>Primero, borra todo tu código para que tengamos una pizarra en blanco.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-9": "Ahora vamos a recrear nuestro código paralelo, pero primero haremos nuestro código de <b/>caminar hacia atrás</b>.<br/><br/> Recrea el código que se muestra en la imagen a continuación.<br/><br/><i/>Si necesitas ayuda, ¡simplemente vuelve a los pasos 6 y 7!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-10": "Ahora vamos a recrear también nuestro código para <b/>caminar hacia adelante</b>. Tu código paralelo debería verse así: <br/><br/><i/>Si necesitas ayuda, ¡vuelve a los pasos 4 y 5!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-13": "Indiquémosle a Marty que camine hacia adelante y luego hacia atrás. <br/><br/>Marty tarda aproximadamente 3 segundos en caminar hacia adelante, así que colocaremos un bloque de espera antes de \"caminar hacia atrás\" y cambiaremos el parámetro a 3 segundos, tal como se muestra en el código de ejemplo a continuación.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-14": "Haz clic en la bandera verde y observa cómo Marty avanza primero, ¡tal como queríamos! <br/><br/>Sabemos que usar bloques de espera nos ayuda con la exclusión mutua, pero no son tan efectivos para código más extenso y complejo. <br/><br/>El tiempo de ejecución del código puede variar considerablemente, lo que dificulta predecir con precisión el tiempo de espera. <br/><br/>Veamos cómo usar el <b/>control de variables</b> para un método más preciso de exclusión mutua.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-15": "Usaremos una variable llamada \"próximo movimiento\" para excluir mutuamente nuestros códigos de \"caminar hacia atrás\" y \"caminar hacia adelante\". <br/><br/>Aunque ambos bloques de código se ejecutarán al hacer clic en la bandera verde, podemos decir: <br/><br/>No des un paso adelante hasta que el siguiente movimiento sea hacia adelante.</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-17": "Elimina el bloque de espera que agregamos anteriormente para que tu código coincida con el ejemplo a continuación. <br/><br/>¡Ahora estás listo para implementar el control de variables!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-19": "Queremos que Marty <b/>espere hasta</b> que el siguiente movimiento sea hacia adelante o hacia atrás para realizar el movimiento correspondiente. <br/><br/>Seleccione dos <b/>operadores iguales</b> y complételos como se muestra a continuación. <br/><br/>Puede obtener dos bloques de siguiente movimiento en la pestaña Variables naranja.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-20": "Ahora use los bloques verdes iguales para completar los bloques <b/>esperar hasta</b> vacíos, de modo que coincidan con el código de muestra a continuación:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-21": "Si queremos que Marty camine hacia adelante primero, debe caminar hacia atrás después, y viceversa.<br/><br/>Por lo tanto, queremos usar el bloque <b/>siguiente movimiento</b> para cambiar el siguiente movimiento después de caminar.<br/><br/>Coloca dos de estos bloques al final de cada fragmento de código y escribe \"adelante\" o \"atrás\" en cada uno, para que coincida con el código de ejemplo a continuación:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-22": "Finalmente, seleccione un bloque <b/>establecer siguiente movimiento a</b> para establecer si queremos que Marty vaya hacia adelante o hacia atrás primero.<br/><br/> Digamos que queremos que Marty camine hacia atrás primero: escriba \"hacia atrás\" en el espacio de parámetros y haga clic en el bloque para que el siguiente movimiento se establezca en hacia atrás.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-23": "¡Lo lograste! Ahora puedes usar el control de variables y las funciones de espera para excluir mutuamente el código paralelo.<br/> Haz clic en la bandera verde y observa cómo tu código paralelo trabaja en conjunto.<br/><br/>Ambos bloques de código se ejecutan simultáneamente, pero tu variable \"próximo movimiento\" nos asegura que siempre sepamos qué sigue.<br/><br/><i/>Para un desafío adicional, ¿por qué no intentas cambiar \"próximo movimiento\" a \"adelante\" (o incluso algo aleatorio como \"banana\") y observas cómo camina Marty ahora?",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-1": "Ahora que somos expertos en el control de variables de programas paralelos, ¡pongamos en práctica nuestro aprendizaje ayudando a Marty a mostrar todas sus caras divertidas!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-2": "Seleccione dos bloques de bandera verde.<br/><br/>Cuando se haga clic en la bandera verde, ambos bloques se activarán y ejecutarán todo el código que se encuentra debajo de ellos al mismo tiempo, en paralelo.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-5": "Ahora coloquemos el segundo bloque de sonido. <br/><br/>Utiliza el menú desplegable para seleccionar \"¡No!\", que combine con la cara de enfado de Marty.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-6": "Ahora coloquemos el último bloque de sonido. <br/><br/>¡Utiliza el menú desplegable para seleccionar \"Emocionado\", que combine con la cara de emoción de Marty!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-7": "Ahora, escribamos código para controlar las expresiones de Marty bajo el segundo bloque de bandera verde. Queremos que nuestro código diga: <br/><br/><i/>Al hacer clic en la bandera verde <br/>Ojos abiertos <br/>Ojos enojados <br/>Ojos emocionados</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-9": "Ahora coloquemos el segundo bloque de ojos. <br/><br/>¡Usa el menú desplegable para seleccionar \"enojado\" y mostrar la cara de enfado de Marty!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-10": "Ahora coloquemos el bloque final de los ojos. <br/><br/>¡Usa el menú desplegable para seleccionar \"Emocionado\" y mostrar la cara de emoción de Marty!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-11": "Probemos nuestro código. <br/><br/>Pulsa el bloque de la bandera verde y comprueba si las expresiones de Marty coinciden con el sonido correcto... <br/><br/>¿Coinciden? <b/>¡No!</b> <br/><br/>Esto se debe a que los sonidos y las expresiones tardan <b/>tiempos diferentes.</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-12": "En el último tutorial, usamos variables para <b/>exclusión mutua</b>, para asegurarnos de que dos cosas <b/>no</b> sucedieran al mismo tiempo. <br/><br/>En este tutorial, vamos a usar variables para <b/>sincronizar</b> nuestro código paralelo, asegurándonos de que las cosas correctas <b/> ​​sucedan al mismo tiempo</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-14": "En Variables, selecciona un bloque <b/>establecer Marty feels en 0</b> y colócalo antes del primer bloque de sonido como se muestra. <br/><br/>Rellena el 0 con \"sorprendido\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-15": "Selecciona otro bloque <b/>establece Marty feels en 0</b> y colócalo antes del segundo bloque de sonido como se muestra. <br/><br/>Rellena el 0 con \"enojado\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-16": "Selecciona un último bloque <b/>establece Marty feels en 0</b> y colócalo antes del último bloque de sonido como se muestra. <br/><br/>Rellena el 0 con \"emocionado\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-17": "Para que nuestras variables se sincronicen con las expresiones y los sonidos de Marty, colocaremos un bloque <b/>esperar hasta</b> antes de cada expresión. <br/><br/>Coloca tres bloques <b/>esperar hasta</b> como se muestra a continuación:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-18": "Queremos que Marty <b/>espere hasta</b> que Marty se sienta = sorprendido para abrir bien los ojos, por ejemplo<br/><br/>Seleccione tres operadores iguales y complételos como se muestra a continuación. <br/>Puede obtener los tres bloques <b/>Marty siente</b> de la pestaña Variables naranja.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-19": "Finalmente, en los bloques de espera colocaremos los bloques iguales relevantes como se muestra a continuación:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-20": "¡Lo lograste! ¡Genial!<br/>Ahora haz clic en la bandera verde y observa cómo tu código funciona en paralelo.<br/><br/>Cada expresión y sonido coinciden a medida que usamos el control de variables para sincronizar las caras graciosas de Marty.<br/><i/>¡Marty está sorprendido!<br/><i>¡Marty está enojado!<br/><i>¡Marty está emocionado!</i><br/><br/>Reto extra: ¿cuántas caras graciosas puedes hacer que Marty ponga usando el control de variables?",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-1": "En este tutorial, vamos a recrear el modo acústico utilizando todo lo que hemos aprendido hasta ahora.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-2": "Antes de comenzar este tutorial, prueba el modo desenchufado para recordar cómo funciona. <br/><br/>Desconecta tu Marty de la aplicación y haz clic en \"modo\" en la parte posterior para cambiar al modo desenchufado.<br/><br/>Reúne una ficha de cada color para probar el sensor de color de tu Marty, observa cómo funciona desenchufado, vuelve a conectarlo y regresa a este tutorial.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-3": "¡Comencemos!<br/><br/>Vamos a crear 5 programas paralelos para controlar cada color en modo desconectado:<br/><b/>verde</b> significa caminar <b/>hacia adelante</b>, <br/><b/>amarillo</b> significa caminar <b/>hacia atrás</b>, <br/><b/>morado</b> significa deslizarse <b/>hacia la derecha</b>, <br/><b/>azul</b> significa deslizarse <b/>hacia la izquierda</b>, <br/><b/>rojo</b> significa <b/>¡detente y celebra!</b>,",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-4": "Primero, coloque 5 bloques de bandera verde en el área de scripting, uno por cada color de casilla en Unplugged.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-5": "No queremos que Marty revise su sensor de color solo una vez, queremos que lo revise una y otra vez para realizar la acción correcta.<br/><br/>Entonces, coloquemos un bucle infinito debajo de cada bloque de bandera verde.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-6": "Para cada bloque de código, queremos decir:<br/><br/><i/><b/>Si</b> Marty detecta el color verde/azul/rojo/violeta/amarillo, <b/>entonces</b> realiza la acción correspondiente.</i><br/><br/>Así que coloquemos una declaración if en cada bucle forever.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-7": "En cada bloque de código, queremos comprobar si, por ejemplo, el sensor de color es verde antes de indicarle a Marty que avance.<br/><br/> Para ello, colocaremos un operador igual en cada sentencia if y las completaremos con un color desconectado en cada una.<br/><br/>El código debería verse así:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-9": "¡Genial! Ahora, queremos que Marty repita la acción correcta hasta que esté en otra tarjeta. <br/><br/>Para ello, usaremos un bloque <b/>repetir hasta</b>.<br/><br/>Coloca uno dentro de cada sentencia if, como se muestra aquí:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-10": "Para completar el bloque de repetición, queremos decir: <br/><br/><i/>repetir hasta que <b/>No</b> el sensor de color = verde</i>, por ejemplo. <br/><br/>Agregue un operador no en cada bloque de código como se muestra a continuación:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-11": "Para completar cada operador \"no\", básicamente copiamos el contenido de la instrucción \"if\", como se muestra a continuación. <br/><br/>Obtenemos un código que dice \"repetir hasta que el sensor de color \"no\" sea verde\", y así sucesivamente. <br/><br/>Puedes hacerlo rápidamente haciendo clic izquierdo en el bloque \"verde igual\" de la instrucción \"if\", luego en \"duplicar\" y arrastrándolo hacia el operador \"no\". <br/><br/><br/><i/>También puedes volver a los pasos 7 y 8 para obtener una pista sobre cómo completarlos correctamente.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-12": "¡Excelente trabajo! Ahora coloquemos la acción correcta en cada bloque de código. <br/><br/>Dentro del bloque de código que detecta el color verde, coloque <b/>caminar hacia adelante dos pasos</b> dentro del bloque \"repetir hasta\", como se muestra aquí:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-13": "Dentro del bloque de código que detecta el color púrpura, coloque <b/>deslice 1 vez hacia la derecha</b> dentro del bloque repetir hasta, como se muestra aquí. <br/><br/><br/><i/>¡Recuerde usar el cuadro desplegable para cambiar de izquierda a derecha!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-14": "Dentro del bloque de código que detecta el color azul, coloque <b/>deslizar 1 vez a la izquierda</b> dentro del bloque repetir hasta, como se muestra aquí.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-19": "Hay dos cosas más que debemos hacer si queremos recrear correctamente el modo desconectado. <br/><br/>Cuando Marty detecta un nuevo color, cambia el color de sus LED oculares a ese color y emite un pitido. <br/><br/>¡Incorporemos esto a nuestro código!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-20": "Coloque un bloque <b/>set Select LED eyes to</b> dentro de la instrucción if, pero encima del bloque repeat until en cada fragmento de código. <br/><br/>Cambie el color del LED al color correspondiente a ese bloque y asegúrese de usar el cuadro desplegable para seleccionar <b/>ambos ojos</b>. <br/><br/>Su código debería verse así:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-23": "¡Lo lograste! ¡Genial!<br/><br/>¡Usaste programas paralelos, variables, operadores, sensores, bucles y más para recrear el modo desconectado tú solo!<br/><br/><i/>Para un desafío extra, ¿qué más puedes hacer que Marty haga cuando vea cada color?",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-3": "Por ejemplo, en esta lista, podríamos decir: <br/><br/><i/>eliminar a la persona número 2</i>, en lugar de <i/>eliminar a Marty</i>. <br/><br/><i/>intercambiar a la persona número 3 y la número 4</i>, en lugar de <i/>intercambiar a Sam y Kirsty</i>. <br/><br/>Las listas ayudan a los programadores a controlar y almacenar información fácilmente, incluso cuando cambia.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-4": "En este tutorial, usaremos una lista para ayudar a Marty a memorizar una línea de fichas de colores sobre la que camina.<br/><br/>Antes de empezar a programar, necesitarás 4 fichas del modo desconectado colocadas en línea como esta:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-5": "Vaya a la pestaña Variables y haga clic en \"Crear una lista\". <br/><br/>Llame a la lista \"colores\" y haga clic en \"Aceptar\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-6": "Cada vez que Marty pase a una nueva casilla, añadiremos el color de su sensor de color a nuestra lista de \"colores\".<br/><br/>Seleccione el bloque <b/>añadir objeto a colores</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-7": "Selecciona un bloque sensor de color y colócalo en el bloque \"Añadir objeto a colores\". <br/><br/>Ahora nuestro código dice: \"Sea cual sea el color que Marty esté detectando, agrégalo a la lista de colores\".</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-8": "Después de agregar un color a nuestra lista de colores, queremos que Marty camine suficientes pasos para llegar a la siguiente ficha. <br/><br/>Coloca un bloque de <b/>caminar hacia adelante</b> como se muestra y cambia el <b/>2</b> por un <b/>7</b>. <br/><br/></i>¡Creemos que 7 pasos son suficientes para ir de una ficha desconectada a la siguiente, pero puedes probar esto ahora y cambiarlo si es necesario!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-9": "Antes de que Marty revise su sensor de color, debemos decirle que haga una pausa para obtener una lectura precisa. Agregue un bloque de <b/>movimiento de pausa</b> como se muestra a continuación:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-10": "Como queremos repetir este código para cada uno de nuestros 4 mosaicos de color, agreguemos un bucle de <b/>repetición</b> alrededor del código. <br/><br/>Cambie <b/>10</b> a <b/>4</b> para repetir el código 4 veces.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-11": "Ahora hagamos que Marty use sus ojos LED para decirnos qué colores ha visto. <br/><br/>Seleccione 4 bloques <b/>Establecer ojos LED en</b> y colóquelos después del bucle de repetición. <br/><br/>Use el cuadro desplegable para seleccionar <b/>ambos ojos</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-13": "¡Casi listo! <br/><br/>Agregue un bloque de <b/>esperar 1 segundo</b> antes de cada bloque LED como se muestra a continuación, para dar tiempo suficiente para cada cambio de color.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-3": "Lo primero que Marty necesita comprar son pilas. <br/><br/>Selecciona el bloque <b/>Añadir objeto a la lista de compras de Marty</b>. <br/><br/>En lugar de <b/>objeto</b>, escribe <b/>pilas</b>. Haz clic en el bloque y observa cómo aparecen las pilas en la lista.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-5": "¡Marty también necesita tuercas y tornillos! <br/><br/>Utilice el mismo bloque para añadir tuercas y tornillos a la lista.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-7": "Lo genial de las listas es que facilitan muchísimo la escritura de código. <br/><br/>Ambos bloques de código leen la lista de la compra de Marty. <br/><br/>Sin embargo, si no usáramos una lista, como en el ejemplo de la izquierda, tendríamos que modificar este código cada vez que cambiara la lista de la compra de Marty. <br/><br/>Si usamos una lista, como en el ejemplo de la derecha, podemos escribir código que funcione siempre, ¡sin importar la longitud de la lista ni qué elementos se agreguen o eliminen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-8": "Vamos a escribir este código que podemos usar para cualquier lista. <br/><br/>No importa cómo modifiquemos la lista, ¡Marty podrá leerla en voz alta con este código! <br/><br/>Este bucle de repetición es especial: los programadores lo llaman bucles iterativos. <br/><br/>Iteración significa repetir la misma tarea, cambiando algo cada vez hasta que se cumpla una condición. <br/><br/>Aquí puedes ver la tarea repetida, la condición y el cambio repetido.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-9": "Para iniciar nuestro bucle iterativo, seleccione un bloque de repetir hasta.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-10": "Vamos a crear la variable <b/>número de artículo</b> que usaremos para recorrer la lista de compras de Marty. <br/><br/>Vaya a la pestaña de variables, seleccione Crear una variable, llámela <b/>número de artículo</b> y haga clic en \"Aceptar\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-12": "No queremos que Marty diga hola, queremos que lea un artículo de la lista. <br/><br/>Ve a la pestaña Variables y selecciona el bloque <b/>artículo 1 de la Lista de la compra de Marty</b> y colócalo como se muestra. <br/><br/>Reemplaza el número 1 con la variable <b/>número de artículo</b>. <br/><br/>¡Excelente! Ahora, si el número de artículo es 3, Marty dirá \"cables\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-13": "Ahora agreguemos el cambio repetido a nuestro bucle.<br/><br/>En cada bucle, queremos agregar uno a la variable <b/>número de artículo</b>.<br/><br/>Coloque el bloque <b/>cambiar el número de artículo en 1</b> después del bloque hablar como se muestra:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-15": "Navegue a la pestaña Variables y complete el bloque \"mayor que\" como se muestra, de modo que diga: <br/><br/><i/>repetir hasta que: el número de artículo sea mayor que la Lista de la compra de Marty</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-16": "¡Lo lograste! <br/><br/>Antes de probar nuestro código, asegúrate de que la variable del número de artículo esté establecida en cero; si no, puedes restablecerla usando este bloque.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-17": "Loading...",
  "gui.menuBar.sensorsDashboard": "Loading...",
  "gui.menuBar.showCode": "Loading...",
  "gui.gui.toggleMartyMachineTab": "Loading...",
  "gui.gui.toggleSaveLoadTab": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.name": "Interacción entre Cog y Marty",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1.1": "¡Genial! Ahora haz clic en el botón \"Conectar\" para conectarte a Cog.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2": "A continuación, conectémonos con Marty. Haz clic en el botón \"Conectar un dispositivo\" y luego selecciona a Marty.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2.1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-2": "Ahora que estamos conectados a los robots, ¡comencemos a programar! Para ver los bloques de Cog, haz clic en el botón del dispositivo Cog.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3.hint": "El bloque de evento «al hacer clic en el engranaje» se encuentra en la categoría Evento. Arrástralo al área de script para empezar a programar.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5.hint": "El bloque «Mensaje de difusión» se encuentra en la categoría Eventos. Arrástralo al área de script para empezar a programar.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-6": "Ahora pasemos a Marty. Necesitamos seleccionarlo para ver sus bloques. Haz clic en el botón del dispositivo Marty.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7.hint": "El bloque \"en el mensaje\" se encuentra en la categoría Evento. Arrástrelo al área de script para comenzar a codificar.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-9": "¡Ya casi llegamos! Arrastra el bloque \"¡Baila!\" al área del script. Este bloque hará bailar a Marty al recibir el mensaje.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-10": "¡Excelente trabajo! Has programado con éxito a Cog y Marty para que interactúen entre sí. ¡Ahora haz clic en el botón de Cog para ver bailar a Marty!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.name": "Introducción a las luces y sonidos de Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.description": "Aprende a programar Cog con bloques, crea sonidos y luces que se activan al interactuar con Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-1": "¡Aprendamos a programar Cog con bloques!<br /><br />¡Nos conectaremos a Cog y haremos que se ilumine y emita sonidos al presionar el botón!<br /><br />También aprenderemos sobre el código en <b>serie</b> que se ejecuta como una secuencia y el código <b>paralelo</b> que se ejecuta al mismo tiempo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-2": "Primero, conectémonos a Cog. Haz clic en el botón \"Conectar un dispositivo\" y selecciona Cog. <br /><br /> Puedes omitir este paso si ya tienes un Cog conectado.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-4": "¡Genial! Ahora deberías tener un engranaje añadido y conectado al tuyo.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-5": "Seleccione la categoría Eventos",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6.hint": "El bloque de evento \"al pulsar el botón\" se encuentra en la categoría Evento. Arrástrelo al área de script para empezar a codificar.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-7": "Seleccione la categoría Looks",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8": "Agregue un bloque <b>Establecer [anillo] LED en [color]</b> arrastrándolo para conectarlo con el bloque Al presionar el botón",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8.hint": "El bloque \"Establecer LEDs [anillo] en [color]\" se encuentra en la categoría \"Apariencia\". Arrástrelo al área de script y conéctelo al bloque \"Al presionar el botón\".",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-9": "¡Pruébalo! <br /><br />¡Pulsa el botón de Cog y las luces deberían encenderse!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13": "Agrega un bloque <b>Apagar LEDs</b> debajo del bloque On Shake.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13.hint": "El bloque \"Apagar LED\" se encuentra en la categoría \"Apariencia\". Arrástrelo al área del script y conéctelo al bloque \"Agitar\".",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-14": "¡Pruébalo!<br /><br />¡Agita Cog y las luces deberían apagarse!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-15": "Cambie el bloque <b>Configurar los LED [anillo] en [color]</b> para controlar el LED del botón, seleccionando 'botón' en el menú desplegable.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-18": "¡Pruébalo!<br /><br />Presiona el botón en Cog y ¡todas las luces deberían encenderse!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19": "Agregue un bloque <b>Establecer [anillo] LED para patrón [Flash]</b> debajo del bloque Establecer color de LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19.hint": "El bloque «Configurar los LED [anillo] para que parpadeen [flash]» se encuentra en la categoría Apariencia. Arrástralo al área de script y conéctalo al bloque que configura los colores de los LED.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-20": "¡Pruébalo!<br /><br />Presiona el botón en Cog y ahora el anillo de LED debería comenzar a parpadear.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-21": "¡Cambia el patrón a 'Spin1' y pruébalo!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23.hint": "El bloque «Configurar los LED [anillo] para que parpadeen [flash]» se encuentra en la categoría Apariencia. Arrástralo al área de script y conéctalo al bloque que configura los colores de los LED.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-24": "Elimina el código debajo del bloque Al presionar el botón arrastrándolo nuevamente a la paleta de bloques",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-26": "Cambie los colores de los LED individuales usando el selector de color.<br /><br />Primero seleccione un color usando la rueda de color y los controles deslizantes de saturación y brillo, luego seleccione los LED que desea configurar en ese color.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-28": "¡Pruébalo! Presiona el botón y las luces cambiarán al color que hayas elegido.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30": "Agregue un bloque de <b>esperar [1] segundos</b> debajo de los bloques LED",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31": "Agrega otro bloque <b>Configurar LEDs usando el selector de color</b> debajo del bloque de espera y luego cambia los colores a los que prefieras.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31.hint": "El bloque \"Configurar LED con el Selector de Color\" se encuentra en la categoría \"Apariencia\". Arrástrelo al área del script y conéctelo al bloque de espera que acaba de agregar; luego, cambie los colores.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32": "También puedes cambiar el color del botón añadiendo un bloque <b>Configurar los LED [anillo] en [color]</b> y modificándolo para que el botón tenga el color que prefieras.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32.hint": "El bloque \"Establecer LEDs [anillo] en [color]\" se encuentra en la categoría \"Apariencia\". Arrástrelo al área del script y conéctelo al último bloque \"Establecer LEDs\" mediante el Selector de Color. Luego, seleccione \"Botón\" en el menú desplegable.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34.hint": "El bloque de evento \"al pulsar el botón\" se encuentra en la categoría Evento. Arrástrelo al área de script para empezar a codificar.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-35": "Seleccione la categoría Sonido",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36": "Agregue un bloque <b>Reproducir nota [C4] durante [1] segundos</b> debajo del bloque Al presionar el botón que acaba de agregar",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36.hint": "El bloque \"Reproducir nota [C4] durante [1] segundos\" se encuentra en la categoría Sonido. Arrástrelo al área de script y conéctelo al nuevo bloque \"Al pulsar el botón\" que agregó en el paso anterior.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38": "Agrega un bloque <b>Reproducir tono de [200] a [300] Hz durante [3] segundos</b> entre el bloque \"Al pulsar el botón\" y el bloque \"Reproducir nota\".",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38.hint": "El bloque \"Reproducir tono de [200] a [300] Hz durante [3] segundos\" se encuentra en la categoría Sonido. Arrástrelo al área del script y conéctelo entre el bloque \"Al pulsar el botón\" y la nota de reproducción que agregó en el paso anterior.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-39": "Cambie los números en el bloque Tono de reproducción para ir de 260 a 523 Hz durante 1 segundo.<br /><br />Cada nota musical tiene una frecuencia, y 523 Hz es la frecuencia de C5 - C en la quinta octava.<br /><br />Pruébelo presionando el botón en Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-40": "Cuando presionas el botón, los sonidos y las luces se activan al mismo tiempo: decimos que funcionan en <b>paralelo</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-41": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-42": "¡Excelente trabajo! ¡Has aprendido a programar Cog para que responda al presionar botones y sacudirlos, y para que emita sonidos y luces!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.name": "¡Crea un dado de 13 caras!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-1": "Programemos a Cog para que sea algo útil: ¡un dado!<br /><br />Haremos que Cog reaccione al ser sacudido mostrando una cantidad aleatoria de luces y emitiendo la misma cantidad de pitidos.<br /><br />Para hacer eso, vamos a aprender sobre <b>Variables</b>: bloques especiales que pueden <i>variar</i> o cambiar de valor, y <b>Condicionales</b>: bloques que toman una decisión.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-3": "Agregue un bloque de evento <b>On Shake</b> de la categoría <b>Eventos</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-5": "Haz clic en el botón <b>Crear una variable</b><br /><br />Asigna el nombre <b>ledID</b> a la nueva variable y pulsa Aceptar.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-6": "Seleccione la categoría <b>Control</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7": "Agregar un bloque de <b>repetición</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7.hint": "El bloque 'repetir' se encuentra en la categoría Control. Arrástrelo al área de script y conéctelo al bloque Al agitar.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8": "Ve a la categoría <b>Aspectos</b> y añade un bloque <b>Ajustar LED [1] a [color]</b> dentro del bloque de repetición.<br /><br />Cambia el color a tu color favorito :-)",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-9": "¡Pruébalo! <br /><br />¿Qué sucede si agitas el engranaje?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10": "Vuelve a la categoría <b>Variables</b> y añade un bloque <b>Cambiar [ledID] por [1]</b> justo después del bloque LED.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10.hint": "El bloque \"Cambiar [ledID] por [1]\" se encuentra en la categoría Variables. Arrástrelo al área del script y colóquelo de forma que encaje dentro del bloque de repetición, justo después del bloque \"Establecer LED\".",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-12": "¡Pruébalo!<br /><br />¿Qué pasa si agitas a Cog?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-13": "Inténtalo de nuevo: ¡se encenderán más LED!<br /><br />Pero si vuelves a agitar Cog después, no pasa nada nuevo. ¡Cambiemos eso!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14": "Agrega un bloque <b>Establecer [ledID] en [0]</b> justo después del bloque <b>Al agitar</b>, antes del bloque de repetición.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15.hint": "El bloque 'Apagar todos los LED' está en la categoría Apariencia.<br /><Br />Asegúrese de agregarlo entre el bloque 'establecer [ledID] a [0]' y el bloque 'repetir'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-16": "¡Inténtalo de nuevo!<br /><br />Ahora, cuando agites el engranaje, se reiniciarán tanto las luces como el valor de la variable <i>ledID</i>, de modo que cuente del 1 al 10.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-17": "Ir a la categoría <b>Operadores</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-18": "Arrastre el bloque <b>seleccionar aleatorio [1] a [10]</b> para reemplazar el número en el bloque de repetición<br /><br />Ahora, el bloque de repetición se repetirá una cantidad aleatoria de veces de 1 a 10, ¡cambiando cada vez!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-19": "Cog tiene 13 LED programables: 12 en el anillo y uno en el botón<br /><br />Cambie el bloque <b>seleccionar aleatorio</b> para elegir un número entre 1 y <b>13</b> en su lugar",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-21": "<i>ledID</i> es una <b>variable</b>: tiene un valor que se puede cambiar o <i>variar</i><br /><br />En este código, cuenta hasta encender un LED diferente cada vez que pasa por el bucle.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22": "Añadamos también retroalimentación sonora.<br /><Br />Ve a la categoría <b>Sonidos</b> y añade un bloque <b>Reproducir nota [C4] durante [1] segundos</b>.<br /><br />Modifícalo para que la nota se reproduzca durante <b>0,1 segundos</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23.hint": "El bloque «Esperar [1] segundos» se encuentra en la categoría Control. Añádelo al código arrastrándolo dentro del bucle de repetición.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-24": "¡Pruébalo!<br /><Br />¡Ahora también oirás una cantidad de pitidos que coincide con la cantidad de luces!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25": "Hagamos que suceda algo especial si obtienes la puntuación más alta: 13.<br /><br />Vaya a la categoría <b>Control</b> y agregue un bloque <b>Si __ entonces</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-26": "Ir a la categoría <b>Operadores</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-28": "Regrese a la categoría <b>Variables</b> y arrastre la <b>variable ledID</b> al <b>primer cuadro del bloque igual</b><br /><br />Luego <b>establezca el segundo cuadro en 13</b>, de modo que toda la línea diga <b>si ledID = 13 entonces</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30": "¡Añadamos algo dentro del bloque <b>if</b>!<br /><br />Ve a la categoría <b>sonidos</b> y añade un bloque <b>Reproducir melodía</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30.hint": "El bloque 'Reproducir melodía' se encuentra en la categoría Sonidos. Agrégalo al código arrastrándolo para que se conecte dentro de la condición if.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-31": "Cambie la melodía a <b>silbar</b> desde el menú desplegable",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32": "También agrega algunos efectos de iluminación desde el menú de apariencia<br /><br />Por ejemplo, podemos hacer que los LED del anillo y del botón muestren un patrón",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32.hint": "El bloque \"Establecer el patrón del LED [anillo] [Flash]\" se encuentra en la categoría \"Apariencia\". Agregue dos dentro de la condición \"si\" y modifique uno para establecer el patrón del botón.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-42": "¡Bien hecho!<br /><br />Aprendiste que una variable es algo que puede cambiar de valor. Podemos usarla para que nuestro código haga diferentes cosas sin necesidad de modificarlo.<br /><br />Aprendimos sobre los bloques if: estos permiten que el código solo se ejecute si se cumple una condición determinada.<br /><br />Y aprendimos a usar un bucle de repetición para repetir algo muchas veces; en este caso, encender un LED diferente cada vez.",
  "gui.spriteSelector.sprites": "SPRITES",
  "gui.deviceSelector.devices": "Loading...",
  "gui.spriteSelector.addSpriteFromLibrary": "Loading...",
  "gui.spriteSelector.addSpriteFromPaint": "Loading...",
  "gui.spriteSelector.addSpriteFromSurprise": "Sorpresa",
  "gui.spriteSelector.addSpriteFromFile": "Subir Sprite",
  "gui.deviceSelector.addDeviceByConnecting": "Conectarse a un dispositivo",
  "gui.deviceSelector.addDeviceFromLibrary": "Loading...",
  "gui.spriteSelector.noSpritesInUse": "No se utilizan sprites.",
  "gui.deviceSelector.noDevicesInUse": "Agregar un dispositivo",
  "gui.saveLoad.localStorageTitle": "En la aplicación",
  "gui.saveLoad.localStorageSubtitle": "Almacenamiento local",
  "gui.saveLoad.cloudStorageTitle": "En la nube",
  "gui.saveLoad.cloudStorageSubtitle": "Loading...",
  "gui.saveLoad.portableFileStorageTitle": "Portátil",
  "gui.saveLoad.portableFileStorageSubtitle": "Almacenamiento de archivos",
  "gui.saveLoad.createNewSaveFile": "Crea un nuevo archivo de guardado:",
  "gui.saveLoad.savedFilesTitle": "Tus archivos guardados:",
  "gui.saveLoad.deleteFile": "Borrar",
  "gui.saveLoad.loadFile": "Loading...",
  "gui.saveLoad.saveFile": "Ahorrar",
  "gui.saveLoad.saveFileNamePlaceholder": "Escribe aquí el nombre que quieras darle a tu nuevo archivo de guardado...",
  "gui.saveLoad.fileLoadError": "No se pudo cargar el proyecto.",
  "gui.saveLoad.fileSaveError": "No se pudo guardar el proyecto.",
  "gui.saveLoad.overwriteFile": "¿Está seguro de que desea sobrescribir este archivo?",
  "gui.saveLoad.copyToClipboard": "Copiar al portapapeles",
  "gui.saveLoad.copied": "Copiado!",
  "gui.saveLoad.saveProject": "Guardar proyecto",
  "gui.saveLoad.projectSaved": "¡Proyecto guardado exitosamente!",
  "gui.saveLoad.projectSaveFailed": "No se pudo guardar el proyecto",
  "gui.saveLoad.projectLoaded": "¡Proyecto cargado correctamente!",
  "gui.saveLoad.projectLoadFailed": "No se pudo cargar el proyecto",
  "gui.saveLoad.loadProjectPlaceholder": "Escriba aquí el nombre del archivo guardado en la nube que desea cargar...",
  "gui.saveLoad.createNewCloudSave": "Crear un nuevo archivo guardado en la nube:",
  "gui.saveLoad.saveFileCode": "El código de archivo guardado autogenerado es:",
  "gui.saveLoad.saveFilePlaceholder": "El código de archivo guardado autogenerado es:",
  "gui.saveLoad.loadProjectTitle": "Loading...",
  "gui.saveLoad.tipsTitle": "Consejos para guardar en la nube:",
  "gui.saveLoad.tips1": "Asegúrese de anotar o registrar el código autogenerado que se proporciona cada vez que guarde un archivo nuevo. Lo necesitará para cargarlo en el futuro.",
  "gui.saveLoad.tips2": "Aunque la aplicación Marty the Robot seguirá guardando automáticamente los archivos en el almacenamiento local, no existe una función de autoguardado para los archivos guardados en la nube. Si desea que sus archivos estén disponibles para su descarga en la nube, deberá guardarlos manualmente cada vez.",
  "gui.saveLoad.tips3": "Loading...",
  "gui.saveLoad.saveToFile": "Guardar en archivo",
  "gui.saveLoad.loadFromFile": "Cargar desde archivo",
  "gui.saveLoad.fileSaved": "¡Archivo guardado!",
  "gui.martyMachineModelEditor.model": "Nombre del modelo",
  "gui.martyMachineModelEditor.className": "Recopilar datos para",
  "gui.martyMachineModelEditor.createNewClass": "Loading...",
  "gui.martyMachineModelEditor.samples": "muestras",
  "gui.MartyMachineModelEditor.record": "Datos de registro",
  "gui.MartyMachineModelEditor.stop": "Loading...",
  "gui.MartyMachineModelEditor.train": "Loading...",
  "gui.MartyMachineModelEditor.run": "Correr",
  "gui.MartyMachineModelEditor.save": "Ahorrar",
  "gui.MartyMachineModelEditor.saving": "Loading...",
  "gui.martyMachineTab.addNew": "Loading...",
  "gui.martyMachineTab.newImageModelMarty": "Nuevo modelo de imagen (Marty)",
  "gui.martyMachineTab.newImageModelDevice": "Nuevo modelo de imagen (dispositivo)",
  "gui.martyMachineTab.newAccelerometerModel": "Nuevo modelo de acelerómetro",
  "gui.martyMachineTab.newAudioModel": "Nuevo modelo de audio",
  "gui.martyMachineTab.loadTMModel": "Cargar modelo TM",
  "gui.martyMachineTab.tutorials": "Tutoriales",
  "gui.martyMachineTab.alertSelectDevice": "¡Ups! Por favor, seleccione un dispositivo Marty o Cog para usar el modelo de acelerómetro.",
  "gui.martyMachineTab.alertConnectDevice": "¡Ups! Por favor, conecte el dispositivo para usar el modelo con acelerómetro.",
  "gui.martyMachineTab.alertModelNameExists": "Loading...",
  "martyMachine.modelNameExists": "¡Ups! El nombre del modelo ya existe, por favor elige otro nombre.",
  "martyMachine.backgroundNoiseClassNeedsSamples": "Loading...",
  "martyMachine.classNameExists": "¡Ups! El nombre de la clase ya existe. Por favor, elija uno diferente.",
  "martyMachine.selectClassAlert": "Agregue o seleccione una clase existente antes de grabar muestras.",
  "gui.MartyMachineNewModelConfirmationModal.label": "Loading...",
  "gui.MartyMachineNewModelConfirmationModal.headsUp": "¡Aviso importante! Si has realizado algún cambio en el modelo actual, no se guardará. ¿Deseas continuar?",
  "gui.MartyMachineNewModelConfirmationModal.close": "Cerca",
  "gui.MartyMachineNewModelConfirmationModal.continue": "Continuar",
  "gui.TfVisChart.loadingTitle": "Gráfico de pérdida de carga",
  "gui.TfVisChart.loadingSubtitle": "Esto puede tardar un poco, por favor espere...",
  "gui.MartyMachineModelEditor.requiresAtLeast10Samples": "Se requieren al menos 10 muestras.",
  "gui.MartyMachineModelEditor.createNewClass": "Loading...",
  "gui.howtos.marty-machine-create-model.name": "Loading...",
  "gui.howtos.marty-machine-create-model.step_create-model": "Crear nuevo modelo",
  "gui.howtos.marty-machine-create-audio-model.step_visit-user-guide": "Loading...",
  "gui.howtos.marty-machine-create-image-model.name": "Loading...",
  "gui.howtos.marty-machine-create-image-model.step_create-image-model": "Crear nuevo modelo de imagen",
  "gui.howtos.marty-machine-create-image-model.step_change-model-name": "Loading...",
  "gui.howtos.marty-machine-create-image-model.step_collect-data": "Loading...",
  "gui.howtos.marty-machine-create-image-model.step_train-model": "Modelo de tren",
  "gui.howtos.marty-machine-create-image-model.step_run-model": "Ejecutar modelo",
  "gui.howtos.marty-machine-create-image-model.step_save-model": "Guardar modelo",
  "gui.howtos.marty-machine-create-audio-model.name": "Crear modelo de audio",
  "gui.howtos.marty-machine-create-audio-model.step_create-audio-model": "Crear nuevo modelo de audio",
  "gui.howtos.marty-machine-create-audio-model.step_change-model-name": "Loading...",
  "gui.howtos.marty-machine-create-audio-model.step_collect-data": "Loading...",
  "gui.howtos.marty-machine-create-audio-model.step_train-model": "Modelo de tren",
  "gui.howtos.marty-machine-create-audio-model.step_run-model": "Ejecutar modelo",
  "gui.howtos.marty-machine-create-audio-model.step_save-model": "Guardar modelo",
  "gui.howtos.marty-machine-load-tm-model.name": "Loading...",
  "gui.howtos.marty-machine-load-tm-model.step_load-tm-model": "Loading...",
  "gui.howtos.marty-machine-load-and-run-image-model.name": "Loading...",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-and-run-image-model": "Loading...",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-model": "Loading...",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classification-on": "Activar clasificación",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classify-image": "Clasificar imagen",
  "gui.howtos.marty-machine-load-and-run-audio-model.name": "Loading...",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-and-run-audio-model": "Loading...",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-model": "Loading...",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classification-on": "Activar clasificación",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classify-audio": "Clasificación de audio"
}