{
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.description": "Fremgang fra BlocksJr til MartyBlocks!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-1": "Velkommen til MartyBlocks! <br /><br /> La oss oppsummere hva vi vet fra MartyBlocks Jr. for å bli vant til dette nye oppsettet.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-2": "Vi finner «startknappen» i Hendelser. <br /><br /> Dra den til skriptområdet for å starte kodingen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-3": "I Bevegelse finner vi «gjør deg klar!»-blokken. <br /><br /> Husk at det alltid er lurt å legge til denne blokken før Marty begynner å bevege seg.<br /><br /> Plasser denne under den grønne flaggblokken.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-5": "Du finner klossen for å gå fremover i Bevegelse. <br /><br /> Legg til klossen etter «Gjør deg klar!» og endre antall skritt Marty gjør i det hvite feltet. Skriv inn «4» slik at den samsvarer med BlocksJr-koden.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-6": "Du finner også lysbildeblokken i Motion. <br /><br /> Legg til blokken etter «Gå 4 skritt fremover», sett rullegardinmenyen til «høyre» og skriv inn «3» slik at den samsvarer med BlocksJr-koden.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-7": "Bruk den samme blokken for å få Marty til å skyve til venstre. <br /><br /> Legg til blokken etter «Skyv 3 ganger til høyre», sett rullegardinmenyen til «venstre» og skriv inn «2» slik at den samsvarer med BlocksJr-koden.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-8": "Til slutt legger vi til blokken for å gå baklengs. <br /><br /> Legg til blokken etter «Skyv 2 ganger til venstre», og skriv inn «1» slik at den samsvarer med BlocksJr-koden.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-9": "<b/>Du klarte det! Du har gått over fra BlocksJr til MartyBlocks.</b> <br /><br /> Nå er du klar til å utforske MartyBlocks og gjøre så mange kule ting med Marty!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.description": "Lær hvordan du lager og kontrollerer Sprites i MartyBlocks!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-1": "Vi kan bruke sprites til å gjøre så mange ting i MartyBlocks! Fra å kontrollere Marty til å kringkaste meldinger og ta imot innspill. <br /><br /><b/>La oss bruke musen til å kontrollere en sprite og utforske forskjellige bakgrunner!</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-3": "La oss velge en grønn flaggblokk for å begynne – dra den til skriptområdet for å starte kodingen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-5": "I Bevegelse, velg punktet mot musepekerblokken. <br /><br /> Legg til denne som vår første blokk i evighetsløyfen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-9": "Du klarte det! <br /><br /> <b/>Nå kan vi utforske en ny bakgrunn med spriten vår hver gang vi klikker på det grønne flagget! </b><br/><br /> Du kan bruke knappen med fire piler for å se spriten din i fullskjerm!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.description": "La oss utforske hendelser og sprites, og hvordan de kan kontrollere Martys bevegelser!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-1": "Nå som vi vet hvordan vi kontrollerer en Sprite, kan vi bruke en Sprite, et bakteppe og noen hendelsesblokker for å kontrollere Marty i Arktis!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-2": "Først og fremst, la oss åpne sprite-menyen for å velge vår arktiske sprite. <br /><br /><b/>Søk etter «polarbjørn»</b> og velg spriten for å plassere den i bakgrunnen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-3": "Flott! La oss nå sørge for at isbjørnen vår føler seg hjemme. <br /><br />Åpne bakgrunnsmenyen, og velg deretter den arktiske bakgrunnen for å gi isbjørnen vår et hjem!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-6": "For å starte kodingen trenger vi to separate hendelsesblokker. <br /><br />Velg hendelsesblokken med grønt flagg og hendelsesblokken «da denne spriten klikket».",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-7": "Vi ønsker å skrive kode som sier: <br /> <br /> <i> Når denne spriten klikket, bytt bakgrunn til arktisk. <br /> Når det grønne flagget klikket, bytt bakgrunn tilbake til standard.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-8": "La oss hente to «bytte bakgrunn»-blokker fra Looks, og legge dem til under hendelsesblokkene som vist <br /><br />Bruk rullegardinmenyen til å velge arktisk for den ene og bakgrunn1 (standard) for den andre.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-9": "La oss nå bruke Martys hendelsesblokker for å få ham til å reagere på denne koden. <br /><br />Naviger til Martys blokker ved å klikke på Marty i enhetsmenyen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-10": "Vi ønsker å skrive kode som sier: <br /> <i> Når bakgrunnen bytter til arktisk, vrik! </i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-11": "I hendelser, velg en blokk for «når bakgrunnen bytter til». <br /> Bruk rullegardinmenyen for å velge Arktis.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-12": "Til slutt navigerer du til Motion, velger «Wiggle!»-blokken og plasserer den som vist i eksempelkoden:",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-13": "Du klarte det! Klikk på det grønne flagget for å tilbakestille scenen, klikk deretter på isbjørnen for å lage en arktisk scene, og se Marty vrikke seg!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.description": "Bruk en sprite for å fortelle Marty at det er festtid!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-1": "Vi kan bruke sprites til å kommunisere med Marty, og med hverandre, ved å kringkaste meldinger.<br /><br />Vi skal bruke en sprite til å fortelle Marty at det er festtid!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-2": "Først velger vi et festbakteppe. <br/>Åpne bakgrunnsmenyen og søk etter <b/>fest</b> for å sette stemningen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-4": "Klikk på høyttaleren i sprites-menyen for å navigere til høyttalerens kode. Vi ønsker å skrive kode som sier: <br /><br /><i> når denne spriten klikket, kringkast «festtid!»</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-5": "Dra denne blokken inn i kodeområdet for å starte sprite-koden vår.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-6": "Dra blokken «kringkastingsmelding1» til posisjon som vist. <br /><br />",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-7": "Bruk rullegardinmenyen til å velge «ny melding», og opprett deretter en ny melding kalt «festtid!» for å kringkaste.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-10": "I arrangementer velger vi «når jeg mottar», drar det til skriptområdet og bruker rullegardinlisten til å velge «festtid!». <br /><br />Vi bruker dette til å fortelle Marty hva han skal gjøre når det er festtid – spille musikk og danse!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-11": "Velg startlydblokken og plasser den som vist nedenfor.<br/><br/>Bruk rullegardinmenyen til å velge «Feir!» og start festen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-12": "Til slutt navigerer du til Bevegelse, velger «Dans!»-blokken og plasserer den som vist i eksempelkoden nedenfor.<br/><br/>Nå kan Marty virkelig feste!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-13": "Du klarte det! Klikk på høyttaleren for å starte musikken, og se Marty feste!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.description": "Lær å bruke if-setninger for å holde Marty trygg!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-1": "I denne veiledningen skal vi lære hvordan <b/>if-setninger</b> og Martys <b/>hindringssensorer</b> fungerer! <br /><br /> Vi bruker dem sammen i en evig løkke for å hjelpe Marty med å slutte å gå hvis noe blokkerer veien hans.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-3": "Kode i if-setningen kjører bare hvis koden i diamanten er sann – vi kan gjøre så mye med if-setninger!<br /><br /> Dra en if-setningsblokk inn i skriptområdet for å starte koden vår.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-4": "Vi skal bruke Martys hindringssensorer til denne aktiviteten – du kan se dem her i de røde sirklene.<br /><br />De kan se om noe blokkerer Martys vei ved å bruke en spesiell type usynlig lys som kalles infrarødt (IR).",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-5": "IR-sensorer består av to deler: <b />sendere og mottakere.</b> <br /><br /><b />Senderen</b> sender ut usynlig lys, som reflekteres tilbake hvis det er en hindring i veien. <br /> <b />Mottakeren</b> ser etter IR-lys som reflekteres tilbake fra en hindring. <br /><br />Hvis mottakeren oppdager reflektert lys, vet sensoren at det er noe i veien. <br /><br />IR-sensorer brukes til å åpne automatiske dører, parkere biler og hjelpe Marty-roboter med å unngå hindringer! <br/><br/><br/><i/>Klikk på bildet for å utvide diagrammet.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-7": "Hvis Marty oppdager en hindring, vil vi at han skal stoppe slik at vi kan holde ham trygg. La oss sette inn en «stopp Marty umiddelbart»-blokk i if-setningen vår.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-8": "Vi vil ikke at Marty skal sjekke etter hindringer bare én gang, vi vil at han skal fortsette å sjekke om og om igjen, så la oss sette hvis-setningen vår inne i en evighetsløkke.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-10": "La oss plassere gangblokken vår i en evig løkke, slik at Marty fortsetter å gå med mindre han ser en hindring.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-11": "Du klarte det!<br /><br /> Plasser nå Marty på bakken foran en hindring, klikk på begge evighetsløkkene for å starte koden din, og se om Marty holder seg trygg!<br /><br /> Prøv å fjerne hindringen og sjekk om Marty vet at det er trygt å fortsette å gå.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.description": "Lær å bruke «if else»-utsagn for å holde Marty trygg!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-2": "Vi vet allerede hvordan man bruker en if-setning. <br /><br /> Kode i if-setningen vil bare kjøre <b/>hvis</b> koden i diamanten er sann - men hva om vi vil kontrollere hva som skjer når koden IKKE er sann? <br /><br /> If-else-setninger hjelper oss å si <b />hvis</b> dette er sant, kjør litt kode, <b/>ellers</b> kjør litt annen kode.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-3": "Velg en if-else-setning. <br /><br /> Dra den inn i skriptområdet for å starte koden vår.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-4": "Vi skal bruke Martys bakkesensorer til denne aktiviteten. De kan se om Martys fot er på en overflate eller ikke.<br /><br /> Vi vil sørge for at han bare går fremover <b/> ​​hvis BEGGE føttene er på bakken.<b/> <br /><br /> Velg <b/>to</b> «velg fotsensor på bakken»-blokker. Bruk rullegardinmenyen til å angi én til høyre fot og én til venstre. <br /><br /> Vi vil fortelle Marty at han skal gå fremover <b/>HVIS</b> begge føttene på bakken er sant.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-7": "La oss fylle ut hvis-ellers-setningen vår. Hvis begge føttene er på bakken, vil vi at Marty skal gå fremover. Plasser en gå-fremover-kloss i det øverste feltet som vist.<br /><br /> Siden vi vil at Marty skal sjekke at begge føttene er trygt på bakken etter <b/>hvert skritt</b>, endrer vi \"2\" til \"1\" i gå-blokken.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-9": "Nesten ferdig! Bortsett fra at vi ikke vil at koden vår bare skal kjøres én gang, vi vil at den skal kjøres om og om igjen, så la oss sette alt i en <b/>evig løkke</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-10": "Du klarte det! La oss nå teste koden din! <br /><br /> <b/> ​​Viktig:</b> Vi anbefaler at du plasserer Marty på en kant <b/>ikke høyere enn 12 cm</b> for å forhindre skade hvis du faller. <br/> Vi anbefaler å bruke en <b/>hvit overflate</b> (som et papirark) som Marty kan gå på, da dette kan bidra til nøyaktigheten av bakkedeteksjonen hans. <br /><br /> Plasser Marty på en liten avsats og klikk på evighetsløyfen for å teste Martys fallforebygging!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.description": "La oss lage et reaksjonstestspill!<br /><br />Vi programmerer Cog til å lyse tilfeldig, og spilleren har kort tid på seg til å trykke på knappen og score et poeng.<br /><br />Vi bruker en <i>variabel</i> for å holde oversikt over poengsummen og en timer for å sjekke om de er raske nok.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-1": "La oss lage et reaksjonstestspill!<br /><br />Vi programmerer Cog til å lyse tilfeldig, og spilleren har kort tid på seg til å trykke på knappen og score et poeng.<br /><br />Vi bruker en <i>variabel</i> for å holde oversikt over poengsummen og en timer for å sjekke om de er raske nok.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-2": "Først må du sørge for at du er koblet til et tannhjul.<br /><br />Hvis ikke, legg til et slik du gjorde i forrige veiledning ved å trykke på Legg til-knappen i enhetspanelet og velge et tannhjul, og deretter klikke på koble til. Hvis du trenger det, kan du hoppe tilbake til forrige veiledning for å se hvordan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-4": "<b>Legg til en</b> <i>sett [ring]-LED-er til [farge]</i> <b>blokk</b> fra <b>Utseende</b>-kategorien,<br /><br />Endre den for å angi <i>knappfargen</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-5": "Legg til en <b>vent [1] sekunder</b>-blokk fra <b>Kontroll</b>-kategorien",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-6": "Gå tilbake til kategorien <b>Utseende</b> og legg til en <b>Slå av alle LED-lamper</b>-blokk.<br /><br />Legg den til rett etter venteblokken, slik at Cog slår av knapp-LED-lampen etter 1 sekund.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-11": "Dra <b>timer</b>-blokken fra <b>Sensing</b>-kategorien til den første boksen på <blokken<br /><br />Sett deretter den andre boksen til 1, slik at linjen sier <i>hvis timer <1 så</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-12": "Timeren er en spesiell variabel som måler tid i sekunder.<br /><br />Uansett hvilken kode vi legger inn i if-blokken, vil den bare kjøres hvis timervariabelen er mindre enn 1 sekund.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-13": "Legg til en <b>Tilbakestill timer</b>-blokk under <b>Når flagget klikkes</b>-blokken.<br /><br />Dette vil tilbakestille timervariabelen tilbake til 0 rett før knappe-LED-en slås på.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-14": "Gå tilbake til kategorien <b>Utseende</b> og legg til en <b>Set [ring] LEDs to [color]</b>-blokk i if-blokken.<br /><br />Endre fargen til hva du vil, og sørg for at du legger den til i if-setningen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-15": "Legg til en <b>Spill note [C4] i [1] sekunder</b>-blokk fra <b>Lyd</b>-kategorien.<br /><br />Plasser den rett etter <b>Angi LED</b>-blokken, og endre den til å spille <b>C6</b> i <b>0,25 sekunder</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-16": "Legg til en <b>Slå av alle LED-lys</b>-blokk etter <b>Spill av note</b>-blokken.<br /><br />Koden i if-setningen kjøres bare (og derfor vil Cog bare lyse og pipe) hvis knappen trykkes innen 1 sekund etter at timeren er tilbakestilt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-18": "La oss nå få lyset til å tennes mer enn én gang!<br /><br />Gå til <b>Kontroll</b>-kategorien og legg til en <b>Gjenta</b>-blokk rundt koden under <b>Når flagget klikkes</b>-blokken<br /><br />Dette vil få Cog til å lyse flere ganger!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-20": "Gå til kategorien <b>Operatorer</b>, og endre tiden på venteblokken til et tilfeldig tall mellom 1 og 5 sekunder.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-22": "Det er litt kjedelig å holde oversikt over poengsummen din i hodet. La oss legge til kode for å holde oversikt over poengsummen automatisk!<br /><br />Gå til kategorien <b>Variabler</b> og lag en variabel som heter <b>poengsum</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-23": "Legg til en <b>Sett [min variabel] til [0]</b>-blokk rett etter <b>Når flagget klikket</b>-blokken, før repetisjonsløkken",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-24": "Endre variabelen til <b>poengsum</b> slik at den sier <i>Sett poengsum til 0</i><br /><br />Nå vil poengsummen bli tilbakestilt til 0 hver gang du starter spillet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-25": "Inne i if-setningen legger du til en «change [my variable] med 1 blokk» og velger <b>score</b>-variabelen fra menyen, slik at det står «change score with 1».",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-26": "Prøv det ut!<br /><br />Nå øker poengsummen med 1 hver gang du trykker på tiden!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-28": "Sett «forsinkelse» til 1 i starten av programmet, rett etter at du har nullstilt poengsummen",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-29": "La oss redusere forsinkelsen hver gang gjennom repetisjonsløkken!<br /><br />Legg til en <b>Change [delay] by [1]</b>-blokk inne i repetisjonsløkken.<br /><br />Vi venter ikke på at forsinkelsen skal reduseres for mye, så sett den til å endre 'delay' med -0,05. Det vil redusere den med 1/20 sekund hver gang.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-30": "I løpet av de 10 iterasjonene av repetisjonsløkken vil forsinkelsen reduseres fra 1 sekund til 0,5 (eller et halvt sekund)",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-32": "Prøv det ut!<br /><br />Merker du at spillet går raskere?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-34": "Legg deretter til en <b>set variable</b>-blokk etter repetisjonsløkken, og sett <b>ledID</b> til 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-36": "Legg til en <b>Set LED [1] to [color]</b>-blokk i denne nye repetisjonsløkken.<br /><br />Erstatt tallet med variabelen 'ledID', slik at det står 'Set LED [ledID] to [color]'.<br /><br />Angi deretter fargen til hva du vil!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-39": "Bra jobbet – du har gjort ganske avansert koding!<br /><br />Du har lært hvordan du bruker variabler for å holde oversikt over ting under et spill.<br /><br />Vi brukte en timer og en mindre-enn-operator for å sammenligne, sammen med en if-setning for å avgjøre om spilleren trykket på knappen i tide.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-40": "Neste steg!<ul><li>Kan du gjøre spillet vanskeligere? Hva med å legge til noen flere nivåer som blir enda raskere?</li><li>Bruk det du lærte i terningopplæringen, og få Cog til å feire hvis spilleren får en perfekt poengsum?</li><li>Hvis du har venner eller klassekamerater med tannhjul, kan dere bytte på å spille et spill med å slå muldvarp med mer enn ett tannhjul om gangen! Alle skal trykke på det grønne flagget samtidig, og deretter skal spillerne bytte på å prøve å score så mange poeng som mulig på tvers av alle tannhjulene. Til slutt legger du sammen poengsummen din ved å legge sammen antall lys på hvert av tannhjulene.</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.name": "Reaktivt lysshow!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.description": "La oss lage et lysshow som reagerer når du samhandler med Cog!</br></br>Vi lærer hvordan vi lager animasjoner på Cogs LED-lys, hvordan vi reagerer på objekter som registreres, hvor mye kraft som trykkes på knappen og på lys som registreres.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-1": "La oss lage et lysshow som reagerer når du samhandler med Cog!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-2": "Først må du sørge for at du er koblet til et tannhjul.<br /><br />Hvis ikke, legg til et slik du gjorde i forrige veiledning ved å trykke på Legg til-knappen i enhetspanelet og velge et tannhjul, og deretter klikke på koble til. Hvis du trenger det, kan du hoppe tilbake til forrige veiledning for å se hvordan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-4": "Gå til kategorien <b>Utseende</b> og legg til et <b>sett LED-lys ved hjelp av fargevelgerblokken</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-6": "Prøv det ut! Plasser en gjenstand på den venstre hindringssensoren.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-7": "Legg til en annen <b>på objektregistrert</b>-blokk fra <b>Hendelser</b>-kategorien.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-8": "Endre sensoren til høyre ved hjelp av rullegardinmenyen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-9": "Gå tilbake til kategorien <b>Utseende</b> og legg til et nytt <b>sett med LED-er ved hjelp av fargevelgerblokken</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-10": "Prøv det ut! Plasser en gjenstand på den høyre hindringssensoren.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-11": "Du kan lage animasjoner på Cog ved å bruke flere fargevelgerblokker koblet sammen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-12": "Den animasjonen besto av ni **bilder**, hver i en egen fargevelgerblokk, med en blokk for å slå av LED-lysene på slutten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-13": "Her er de individuelle bildene for den animasjonen.<br /><br />Kan du planlegge en egen animasjon og få den til å spille av når tannhjulet registrerer et objekt?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-14": "Kan du lage en animasjon som endres jevnt når du flytter Cog fra å sitte på én objektsensor til å sitte på den andre?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-15": "Så langt, hver gang vi har brukt knappen på Cog, har den registrert om den er trykket ned eller ikke.<br /><br />Vi kaller denne typen informasjon en <b>boolsk</b> – noe som enten er sant eller usant.<br /><br />I tillegg til å tenke på knappen som en boolsk input, kan vi også bruke den som en <b>analog</b> input – en som kan ha mange forskjellige verdier.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-16": "Gå til kategorien <b>Sensing</b> og merk av i boksen ved siden av blokken <b>Knappkraftverdi %</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-17": "Du vil se en skjerm som viser verdien til knappekraftsensoren.<br /><br />Hvis du trykker på knappen, vil verdien endres.<br /><br />La oss bruke den verdien til å få lysene på tannhjulet til å endre farge når du trykker hardere på knappen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-18": "Gå til kategorien <b>Hendelser</b> og legg til en <b>Når flagget klikkes</b>-blokk.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-19": "Gå nå til <b>Kontroll</b>-kategorien og legg til en <b>evig</b>-løkke.<br /><br />I motsetning til <b>repetisjonsløkken</b> som bare gjentok seg et visst antall ganger, vil <b>evig</b>-løkken fortsette å løkke til du trykker på den røde stoppknappen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-20": "Gå til kategorien <b>Utseende</b>, og legg til en <b>sett [ring]-LED-er til [farge]</b>-blokk i den evige løkken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-23": "<b>Metning</b> sier hvor livaktig du vil at fargen skal være.<br /><br />I dette eksemplet, for en nyanse på 360, vil en metning på 100 være den rødeste rødfargen som finnes.<br /><br />En metning på 0 vil være hvit – den minst røde fargen som finnes.<br /><br />Og en metning på 50 vil være i midten – rosa.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-24": "Til slutt angir <b>lysstyrke</b> (eller lysstyrke, eller verdi) hvor lys du vil at fargen skal være.<br /><br />I dette eksemplet, med en fargetone på 360 og en metning på 100, gir en lysstyrke på 100 igjen den rødeste rødfargen.<br /><br />En lysstyrke på 0 gir ingen rødfarge i det hele tatt – i dette tilfellet ville LED-lampen på Cog bare være slått av!<br /><br />En lysstyrke på 50 vil være i midten – en mørkerød farge.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-25": "La oss bruke <b>knappkraft</b> til å angi en av disse!<br /><br />Gå tilbake til <b>Sensing</b>-kategorien og dra <b>knappkraftverdi</b>-blokken inn i lysstyrkeområdet i <b>fargetone, metning, lysstyrke</b>-blokken.<br /><br />Legg også til en <b>ventetid på 0,1 sekunder</b> på slutten av evighetsløyfen, slik at lysene ikke endres for raskt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-26": "La oss også slå på lyset i knappen på Cog for moro skyld!<br /><br />Legg til en <b>Sett [ring] LED-lys til [farge]</b>-blokk før evighetsløyfen, og endre den til å angi <b>knappen</b>. Velg hvilken som helst farge du liker.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-27": "Prøv det ut! Når du trykker ned knappen, vil LED-lysene lyse sterkere og sterkere rødt!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-28": "Prøv det med knappetrykket som stiller inn metningen i stedet for lysheten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-30": "Til slutt, prøv å angi fargetonen i stedet.<br /><br />Verdien for fargetonen må gå fra 0 til 360, så vi må gjøre litt matematikk.<br /><br />Gå til kategorien <b>Operatorer</b> og dra en <b>fler</b> blokk inn i fargetonens verdi.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-32": "Se om du kan endre fargen på knappen også!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-33": "Neste steg er å se om vi kan få Cog til å reagere på sterke lys ved å lyse litt.<br /><br />Slett koden du lagde for å endre fargene basert på knappetrykk ved å dra den inn i blokkpaletten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-34": "Gå til kategorien <b>Sensing</b> og merk av i boksen ved siden av blokken <b>Ambient light value</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-35": "Noter deg hva verdien for omgivelseslyset vanligvis er.<br /><br />Skaff deg deretter en lommelykt og lys med den på Cog. Noter deg verdiene du får.<br /><br />Du vil sannsynligvis kunne nå den maksimale verdien sensoren kan gi – 4095!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-36": "Gå til kategorien <b>Kontroll</b> og legg til en <b>vent til</b>-blokk under blokken <b>Når flagget klikket</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-37": "Gå deretter til <b>Operatorer</b> og legg til en <b>større enn</b>-blokk i <b>vent til</b>-blokken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-38": "Gå tilbake til kategorien <b>Sensing</b> og dra blokken <b>Ambient light value</b> til venstre side av <b>>>blokken.<br /><br />Endre høyre side til et tall som bare nås når du lyser med en lommelykt på Cog.<br /><br />Du trenger ikke å legge inn det maksimale tallet, bare et som er høyere enn det du ser uten lommelykt.<br /><br />Her har jeg valgt 1500, så hele linjen viser <b>wait until ambient light value > 1500</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-39": "Legg til en <b>Sett [ring] LEDs til [farge]</b>-blokk under <b>vent til</b>-blokken.<br /><br />Legg også til en <b>Slå av alle LED-lys</b>-blokk øverst for å sikre at ting tilbakestilles.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-41": "La oss få lysene på Cog til å tennes gradvis når den oppdager en lommelykt.<br /><br />For å gjøre det bruker vi en variabel igjen!<br /><br />Gå til kategorien <b>Variabler</b> og lag en variabel som heter <b>lysstyrke</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-42": "Legg til en blokk for å <b>sette lysstyrken til 0</b> i begynnelsen av koden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-43": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-44": "Bruk <b>lysstyrke</b>-variabelen du nettopp lagde, og endre den slik at linjen viser <b>gjenta til lysstyrken er > 100</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-45": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-46": "Endre blokken <b>sett [ring] LED-er til [farge]</b> for å bruke en blokk for <b>fargetone, metning og lysstyrke</b>.<br /><br />Bruk variabelen <b>lysstyrke</b> for lysstyrke.<br /><br />Endre også fargen til en fin blåfarge ved å sette fargetone til 180.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-47": "Legg deretter til en <b>venteblokk</b> fra <b>Kontroll</b>-kategorien og endre den til <b>vent 0,1 sekunder</b>.<br /><br />Dette vil redusere nedtoningen litt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-48": "<b>repeat until</b>-blokken er litt som en kombinasjon av <b>repeat</b>-blokken du brukte før, som gjentok seg et bestemt antall ganger, og <b>wait until</b>-blokken du nettopp brukte.<br /><br />I dette tilfellet vil den fortsette å gjenta seg til betingelsen er oppfylt, og deretter vil den slutte å gjenta seg og kodekjøringen vil fortsette.<br /><br />I dette eksemplet vil den fortsette å gjenta løkken og gradvis øke lysstyrken til lysstyrken når maksimumsverdien på 100.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-49": "Prøv det ut!<br /><br />Klikk på det grønne flagget for å kjøre koden.<br /><br />Når du lyser med en lommelykt på Cog, vil lysene gradvis slå seg på!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-50": "La oss få lysene til å slukne igjen når du tar vekk lommelykten!<br /><br />Legg til en annen <b>vent til</b>-blokk, men denne gangen sett den til å vente til verdien for omgivelseslyset er mindre enn en terskel.<br /><br />Gjør dette ved å bruke en <b>&lt;</b> (mindre enn)-blokk fra <b>Operatorer</b>-kategorien.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-51": "Legg nå til en ny <b>repeat until</b>-blokk og la den gjentas til lysstyrken er mindre enn (<) 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-52": "Dupliser koden fra den forrige <b>repeat until</b>-løkken.<br /><br />Du kan gjøre dette ved å høyreklikke (eller trykke og holde) og deretter velge <b>Dupliser</b>.<br /><br />Sett den nye koden inn i den nye <b>repeat until</b>-løkken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-53": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-54": "Prøv det! Når du tar vekk lommelykten, vil lysene på Cog slukne igjen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-55": "La oss gjøre det slik at du ikke trenger å klikke på det grønne flagget hver gang du vil at Cog skal reagere.<br /><br />Legg til en <b>evig</b>-løkke slik at den starter etter <b>Slå av alle LED-er</b>-blokken og omgir all den andre koden.<br /><br />Nå vil Cog fortsette å reagere på sterke lys til du trykker på det røde stoppskiltet!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-56": "Bra jobbet – du har lært masse!<br /><br />Du lærte hvordan du lager animasjoner fra mange individuelle rammer.<br /><br />Du lærte hvordan du får Cog til å reagere på objektsensorene.<br /><br />Vi lærte om analoge verdier som kan variere, og brukte lysene på Cog til å indikere hvor mye kraft som ble brukt til å trykke på knappen.<br /><br />Vi lærte hvordan vi beskriver farger ved hjelp av fargetone, metning og lysstyrke (eller verdi).<br /><br />Vi lærte også hvordan vi bruker lyssensoren på Cog, og gjorde et raskt eksperiment for å ta noen avlesninger fra sensoren for å hjelpe oss med å skrive koden vår.<br /><br />Ved å bruke <b>vent til</b>- og <b>gjenta til</b>-blokker, variabler og sammenligningsoperatorer, fikk vi Cog til å lyse opp for å reagere på sterkt lys!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-57": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.name": "Vater",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.description": "La oss lage en annen nyttig ting med Cog! <br /><br />Denne gangen skal vi bruke Cogs vippesensor til å lage et vater – noe som viser om noe er i vater eller om det vipper. <br /><br />Mange vater fungerer bare i én dimensjon, men vi skal få vårt til å fungere i to!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-1": "<b>La oss lage et vater</b> som viser om noe er i vater eller vipper!<br /><br />Vi bruker Cogs vippesensor for å få det til å fungere i to dimensjoner.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-2": "Først må du sørge for at du er koblet til et tannhjul.<br /><br />Hvis ikke, legg til et slik du gjorde i forrige veiledning ved å trykke på Legg til-knappen i enhetspanelet og velge et tannhjul, og deretter klikke på koble til. Hvis du trenger det, kan du hoppe tilbake til forrige veiledning for å se hvordan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-3": "Gå til kategorien <b>Hendelser</b> og legg til en <b>on tilt [left]</b>-hendelsesblokk.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-5": "Klikk på <b>lys av</b>-ikonet for å slå av alle lysene.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-6": "Så setter du bare én LED-lampe til venstre til å være på.<br /><br />Prøv det! Vipp tannhjulet til venstre.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-7": "Legg til en annen <b>ved tilt [venstre]</b>-blokk fra kontrollkategorien og endre den slik at den sier <b>ved tilt [høyre]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-8": "Koble den <b>on tilt [right]</b>-blokken til et annet <b>sett med LED-er ved hjelp av fargevelgerblokken</b>, og angi at bare LED-en til høyre skal lyse.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-9": "Prøv det ut!<br /><br />Vipp tannhjulet til venstre og høyre.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-10": "Legg til et nytt sett med blokker <b>ved tilt</b> og <b>fargevelger</b>.<br /><br />Angi at den skal reagere ved <b>tilt [bakover]</b> og at bare LED-lampen i klokken 6-posisjonen skal slås på.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-12": "Prøv det ut!<br /><br />Vri tannhjulet i alle fire retninger og se hvordan lyset beveger seg rundt!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-13": "La oss vise denne informasjonen på skjermen også!<br /><br />Gå til kategorien <b>Sensing</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-14": "Merk av i avmerkingsboksen ved siden av <b>Akselerometer X</b>.<br /><br />Endre deretter X til Y fra rullegardinmenyen, og merk av i avmerkingsboksen ved siden av det.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-17": "Klikk deretter på knappen for å <b>legge til en ny graf</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-19": "En graf vil vises!<br /><br />Vi må velge sensorene vi vil vise. Klikk for å utvide kategorien <b>Akselerometer</b>, og merk deretter av i boksene ved siden av <b>X</b> og <b>Y</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-22": "Klikk på <b>x</b>-knappen for å lukke sensordashbordet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-24": "Gå nå til kategorien <b>Variabler</b> og lag to variabler kalt <b>ax</b> (for akselerometer x) og <b>ay</b> (for akselerometer y).",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-25": "Legg til disse blokkene i prosjektet ditt:<br /><br /><ul><li>Når flagget klikkes:</li><ul><li>For alltid:</li><ul><li>Sett ax til Akselerometer X</li><li>Sett ay til Akselerometer Y</li></ul></ul></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-27": "Legg til en <b>broadcast[message1]</b>-blokk i den evige løkken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-28": "La oss gi meldingen et bedre navn. Velg <b>Ny melding</b> fra rullegardinmenyen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-29": "Gi deretter den nye meldingen navnet <b>oppdater posisjon</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-32": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-33": "Endre det slik at det står <b>når jeg mottar [oppdater posisjon]</b> – det er meldingen vi nettopp laget.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-34": "Gå nå til kategorien <b>Bevegelse</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-35": "Legg til en <b>gå til x: [] y: []</b>-blokk.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-36": "Midten av skjermen har koordinatene [0,0].<br /><br />Koordinater til høyre for midten har x-verdier over 0.<br />Koordinater til venstre for midten har x-verdier under 0.<br />Koordinater over midten har y-verdier over 0.<br />Koordinater under midten har y-verdier under 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-37": "Vi ønsker å bevege ballen rundt for å vise hvor mye tannhjulet er vippet.<br /><br />Se tilbake på notatene du gjorde om hvilke akselerometeravlesninger du fikk da du vippet tannhjulet i hver av de fire retningene.<br /><br />Vi ønsker at ballen skal bevege seg til venstre og høyre når du vipper tannhjulet til venstre og høyre. For spriten er venstre og høyre satt av x-koordinaten.<br /><br />Du bør se at når du vippet tannhjulet til høyre, var y-verdien over 0, mens ax-verdien var nesten 0. Når du vippet til venstre, var y-verdien under 0.<br /><br />Dette betyr at vi bør bruke y-verdien til å angi x-koordinaten til spriten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-38": "Vi må også gjøre tallet større ved å multiplisere det.<br /><br />Gå til kategorien <b>Operatorer</b> og dra en <b>multiplikasjonsblokk</b> inn i x-koordinatboksen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-39": "Gå til kategorien <b>Variabler</b> og legg til <b>ay</b>-variabelen i multiplikasjonsblokken.<br /><br />Skriv <b>100</b> på den andre siden av multiplikasjonsblokken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-40": "Se på notatene dine om akselerometeravlesningene igjen.<br /><br />Hvilket tall endret seg da du vippet tannhjulet bakover og fremover?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-41": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-42": "Men det er et problem! Vi vil at spriten skal bevege seg oppover når du vipper tannhjulet fremover, noe som ville bety at den trengte en y-koordinat over 0.<br /><br />Men da du vippet tannhjulet fremover, var y-verdien under 0!<br /><br />For å fikse dette må vi multiplisere den med <b>-100</b> i stedet for <b>100</b>. Det ekstra minustegnet vil snu den fra å være under 0 til over 0, og omvendt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-43": "Gå tilbake til tannhjulkoden din ved å klikke på tannhjulsymbolet i enhetspanelet.<br /><br />Tannhjulet vil lyse opp og pipe når du velger det!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-44": "Trykk nå på det <b>grønne flagget</b> for å kjøre koden din.<br /><br />Du skal se ballen bevege seg rundt når du vipper tannhjulet!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-45": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-46": "Velg deretter fanen <b>Bakgrunner</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-47": "Tegn noen sirkler rundt midtpunktet.<br /><br />Gjør dem gjerne fargerike hvis du vil!<br /><br />Hint – hvis du er på en datamaskin, kan du holde nede shift for å sørge for at du får en sirkel i stedet for en ellipse.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-48": "Du kan velge <b>Kode</b>-fanen øverst for å gå tilbake til kodingsskjermen, og velge Tannhjul igjen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-49": "Prøv det ut!<br /><br />Når du vipper tannhjulet, vil du kunne se en veiledning for hvor nær du er å være i vater!<br /><br />Når tannhjulet står stille, er det alltid 1 G tyngdekraft som virker på det. Hvis du vipper tannhjulet mye, vil du se at du kan få ax eller ay til å være lik 1 – det vil skje når indikatoren er så langt den kan gå fra midten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-50": "Hvis du vipper i en 45-graders vinkel, vil indikatoren være i samme avstand fra midten, men ax og ay vil nå være rundt 0,7 – kan du tenke deg hvorfor det er slik?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-51": "Hvis vi tenker på helningsgraden som en rettvinklet trekant, forteller Pythagoras’ læresetning oss at hvis begge sidene i trekanten er omtrent 0,7, vil hypotenusen være 1!<br /><br />Det er det som skjer her, hvor 1 G av tyngdekraften ved 45 grader består av 0,7 G i X-retningen og 0,7 G i Y-retningen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-52": "Bra jobbet!<br /><br />Du har lært hvordan du bruker vippeføleren på Cog til å lage et vater – en enhet som viser om noe er i vater eller skråstilt.<br /><br />Vi lærte om sprites i Blocks-grensesnittet, og brukte variabler og en melding for å kommunisere mellom cog og spriten.<br /><br />Vi tenkte på hvordan vi kunne representere data – mengden vippe i x og y – på en måte som ville være lett å forstå – ved å bruke lys på cog og bevegelsen til spriten mot en måler i bakgrunnen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-53": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-54": "Se hva som skjer med <b>tiltretningen</b> når du beveger tannhjulet rundt.<br /><br />Når det er nesten flatt, vil tiltretningen være <b>ingen</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-55": "Legg til denne koden.<br /><br />Den bruker et par nye blokker.<br /><br /><b>if … else</b>-blokken fungerer veldig likt som <b>if</b>-blokken vi brukte tidligere. Hvis betingelsen er sann, vil koden i if-delen bli utført, men hvis betingelsen er usann, vil koden i else-delen bli utført i stedet.<br /><br />Ved å bruke <b>if … else</b>-blokken kan vi skrive alternativ kode som bare kjører hvis betingelsen ikke er sann.<br /><br />Den andre nye blokken er en <b>=</b>-blokk. Dette er en annen type komparator – den sammenligner to ting. Her sammenligner vi <b>Tilt-retningssensoren</b> og ordet <b>none</b>.<br /><br />Hvis Tilt-retningen er nøyaktig den samme som ordet <b>none</b>, vil betingelsen være sann, og knapp-LED-en vil bli satt til grønt, og ring-LED-ene vil bli slått av!<br /><br />Hvis Tilt-retningen er lik noe annet enn <b>none</b>, vil knapp-LED-en bli slått av i stedet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-56": "Prøv det ut!<br /><br />Nå får du signal på Cog også når den er i vater 🙂",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-1.2": "Først må du sørge for at du er koblet til et tannhjul.<br /><br />Hvis ikke, legg til et slik du gjorde i forrige veiledning ved å trykke på Legg til-knappen i enhetspanelet og velge et tannhjul, og deretter klikke på koble til. Hvis du trenger det, kan du hoppe tilbake til forrige veiledning for å se hvordan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-2": "Gå til kategorien Hendelser og legg til en <b>Ved objekt registrert [venstre]</b>-blokk.<br /><br />Vi bruker denne som startknapp.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-5": "Legg til blokker for å <i>sette [ay] til [akselerometer [Y]]</i> inne i den evige løkken.<br /><br />Du må bruke en <b>sett</b>-blokk fra kategorien variabler, <b>akselerometer</b>-blokken fra kategorien sensorer, og endre aksen til <b>Y</b> ved hjelp av rullegardinmenyen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-8": "Klikk på knappen for å velge en sprite du vil legge til.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-15": "Prøv det ut!<br /><br />Dekk til venstre objektsensor for å starte spillet, og vipp deretter Cog til venstre og høyre for å bevege pingvinen til venstre og høyre.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-16": "La oss legge til noen hindringer!<br /><br />Legg til <b>Tree1</b>-spriten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-18": "Fra Utseende-kategorien legger du til en <b>set size to [30]%</b>-blokk og en <b>hide</b>-blokk.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-20": "Inne i forever-løkken legger du til en <b>create clone of [myself]</b>-blokk.<br /><br />En klon er en identisk kopi av noe.<br /><br />I dette tilfellet vil create clone-blokken lage en kopi av tre-spriten og all koden som er koblet til den.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-21": "Etter den blokken, legg til en <b>vent[1] sekunder</b>-blokk.<br /><br />Dette betyr at et nytt tre vil bli laget hvert sekund.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-22": "Legg nå til en <b>når jeg starter som klon</b>-blokk.<br /><br />All kode som er knyttet til denne vil bli kjørt når klonen opprettes.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-25": "Endre det til å si <b>glide [2] secs to x: [x position] y: [200]</b>.<br /><br />Du finner x-posisjonsblokken i Bevegelseskategorien.<br /><br />Dette vil få treet til å bevege seg fra bunnen til toppen av skjermen i løpet av 2 sekunder, slik at x-posisjonen (venstre og høyre posisjon) holdes den samme.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-27": "Vi ønsker at hver klone av treet skal forsvinne når den når toppen av skjermen.<br /><br />For å gjøre dette, legg til en <b>slett denne klonen</b>-blokk fra Kontroll-kategorien, under glideblokken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-28": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-29": "La oss få spillet til å oppdage om pingvinen krasjer inn i et tre.<br /><br />Med Tre-spriten fortsatt valgt, legg til en annen <b>når jeg starter som klon</b>-blokk, og en <b>forever</b>-løkke under den.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-30": "Legg til en <b>if [] then</b>-blokk inne i forever-løkken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-31": "Endre det til å si <b>hvis [berører [Pingvin 2]] så</b>.<br /><br />Du finner berøringsblokken i kategorien Føling, og du kan velge Pingvin 2 fra rullegardinmenyen.<br /><br />Denne if-betingelsen vil være sann hvis treet berører pingvinen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-32": "Inne i if-betingelsen, legg til en <b>stop[all]</b>-blokk.<br /><br />Dette vil avslutte spillet hvis pingvinen støter på et tre.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-34": "La oss legge til en poengsum!<br /><br />Lag en annen variabel kalt <b>poengsum</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-35": "Med Tre-spriten fortsatt valgt, legg til en <b>set [score] to [0]</b>-blokk etter <b>when I receive [start]</b>-blokken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-36": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-37": "La oss gjøre spillet vanskeligere etter hvert som det går videre.<br /><br />Legg til en annen variabel kalt <b>forsinkelse</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-39": "Bruk nå forsinkelsesvariabelen til å angi tiden mellom trærne som opprettes.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-40": "Prøv det ut!<br /><br />Du vil legge merke til at trærne begynner å dukke opp mye raskere jo lenger du kommer!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-41": "La oss legge til noen lys på Cog for å gjøre ting mer spennende.<br /><br />Legg til en <b>broadcast [stop]- og wait</b>-blokk før <b>stop [all]</b>-blokken.<br /><br />Du må opprette en ny melding kalt <b>stop</b>.<br /><br /><b>broadcast [stop]- og wait</b>-blokken sørger for at koden som kjører når stoppmeldingen sendes, blir fullført før koden fortsetter og <b>stop [all]</b>-blokken kjører.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-42": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-43": "Legg til en <b>sett [ring] LED-lamper til [grønn]</b>-blokk og en <b>sett [ring] LED-lamper til mønsteret [Spin1]</b>-blokk som vist her.<br /><br />Det vil få lysene til å snurre på Cog når spillet starter.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-44": "Legg til en <b>når jeg mottar [stopp]</b>-blokk og en blokk for å <b>sette [ring]-LED-er til [rød]</b>.<br /><br />De vil gjøre at lysene blir røde når spillet er ferdig.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-45": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.name": "Musikkinstrument",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.description": "La oss gjøre Cog om til et musikkinstrument!<br /><br />Vi skal lage toner fra Cog som endrer seg basert på hvordan du bruker det, og lære om tonearter.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-1": "La oss gjøre Cog om til et musikkinstrument!<br /><br />Vi skal lage toner fra Cog som endrer seg basert på hvordan du bruker det, og lære om tonearter.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-2": "Først av alt, la oss måle hva Cog «ser» når du samhandler med objektsensoren.<br /><br />Skaff deg et blankt ark og bruk en linjal til å lage merker hver centimeter fra 0–5 cm. Nummerer merkene fra 0–5.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-3": "Plasser Cog på 0-merket med den høyre objektsensoren pekende mot avstandsmerkene.<br /><br />Endre IR-sensorverdiblokken [venstre] til den <i>høyre</i> sensoren, og merk av i boksen ved siden av den.<br /><br />Det vil vise avlesningen fra IR-sensoren – et annet navn for objektsensoren siden den bruker infrarødt lys for å fungere.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-4": "Skriv ned verdien til IR-sensoren til høyre uten noe foran den.<br /><br />Plasser deretter hånden på 5 cm-merket og noter ned tallet sensoren leser nå.<br /><br />Det er normalt at verdiene beveger seg litt opp og ned – prøv å skrive ned et tall som er midt i disse variasjonene.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-5": "Gjenta dette med hånden din på merkene 4 cm, 3 cm, 2 cm, 1 cm og 0 cm.<br /><br />Du bør ende opp med en måletabell.<br /><br />Du legger kanskje merke til at tallene endrer seg mye når hånden din er nær Cog, men mindre jo lenger unna hånden din kommer.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-6": "La oss få Cog til å spille en note når knappen trykkes ned.<br /><br />Legg til en <b>ved knappetrykk</b>-blokk.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-9": "Legg til en <b>Startnote [C4]</b>-blokk inne i if-delen av if … else-blokken.<br /><br />Dette er den laveste tonen vi lager, og vi lager den når avlesningen fra IR-sensoren er lav – dvs. hånden din er langt unna den.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-10": "Prøv det ut!<br /><br />Trykk på knappen uten at noe er foran Cog – du skal høre en tone.<br /><br />Trykk på knappen igjen med hånden et par cm foran cog – ingenting skal skje fordi vi gikk til else-delen av kondisjonalis i stedet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-11": "La oss kode flere notater!<br /><br />Vi legger til en annen <b>if … else</b>-blokk inni else-delen av den første.<br /><br />Å sette betingelsesverdier inni hverandre på denne måten kalles nesting.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-13": "Gjør det to ganger til, slik at du ender opp med fire if … else-blokker.<br /><br />Du kan gjøre dette raskere hvis du høyreklikker, eller trykker og holder inne den siste if… else-blokken og velger alternativet <b>Dupliser</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-15": "Endre den tredje tonen til <b>E4</b>.<br /><br />Endre den fjerde tonen til <b>G4</b>.<br /><br />Du legger kanskje merke til at vi hoppet over en tone! Vi skal bare spille fem toner, og vi velger dem fra noe som kalles den pentatoniske C-skalaen.<br /><br />Pentatonisk betyr at den har 5 toner per oktav, og C er den musikalske tonearten. En toneart forteller deg om kryssene og b-ene som brukes i en sang – de er de svarte tonene på et piano.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-21": "Sett betingelsen i repeat until-blokken til <b>[[knapp klikket] = False]</b>.<br /><br />Flytt <b>Stopp lyder</b>-blokken utenfor repeat until-løkken, og erstatt <b>wait until</b>-blokken med en <b>wait [0.1] seconds</b>-blokk.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-23": "Vi har laget Cog-noter som spiller i C-dur, så vi burde kunne spille med på hvilken som helst sang som også er i C-dur!<br /><br />For eksempel, prøv å spille med på «Let it Be» av The Beatles.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-24": "Det hadde vært enda kulere om vi kunne endre noter raskere, men vi må sørge for at vi ikke sender for mange kommandoer til Cog og overbelaster det.<br /><br />La oss bruke variabler for å holde oversikt over hvilken note vi spiller, og bare endre den når vi trenger det.<br /><br />Lag to nye variabler kalt <b>note</b> og <b>lastNote</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-26": "Erstatt <b>wait [0.1] seconds</b>-blokken etter alle betingelsene med en <b>if</b>-blokk slik:<br /><br />Betingelsen skal være <b>if [not [[note] = [lastNote]] then</b>.<br /><br />Du finner <b>not</b>-blokken i kategorien Operatorer. Som du kanskje forventer, er den bare sann hvis tingen inni den er usann. Så her er betingelsen bare sann hvis verdien av notevariabelen ikke er lik verdien av lastNote-variabelen.<br /><br />Hvis det er tilfelle, er det en ny note å spille, så legg til en <b>Start note [note]</b>-blokk inni if-blokken.<br /><br />Legg også til <b>set [lastNote] to [note]</b>. Dette vil sørge for at programmet husker hva den siste noten var neste gang i løkken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-27": "Kan du se hva den lille feilen ville vært hvis vi fullførte koden her?<br /><br />En feil er en feil – i dette tilfellet er det én ting til vi må gjøre for å sørge for at vi alltid spiller en note når knappen trykkes – og det er å fjerne lastNote-variabelen når vi stopper lydene.<br /><br />Gjør dette ved å legge til en <b>set [lastNote] to [0]</b>-blokk på slutten av koden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-28": "Prøv det ut!<br /><br />Nå, når du beveger hånden din, skal noten endre seg raskere!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-29": "Bra jobbet!<br /><br />Du har laget et musikkinstrument du kan bruke til å spille med på sanger!<br /><br />Ved å bruke den pentatoniske skalaen til en sang som er i samme toneart, kan du spille med mens du holder deg i harmoni!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-30": "Hvordan ellers kan du endre noten?<br /><br />Hva med å bruke hvordan Cog er vippet? Da kan du endre noten bare ved å vri Cog til venstre og høyre!<br /><br />Du kan endre koden din for å prøve det ut – her er et lite hint om hvordan du gjør det:",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.name": "Klokke",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-3": "Gå til kategorien <i>sensor</i> og dra <b>gjeldende [år]</b>-blokken inn i kodeområdet.<br /><br />Endre den til <b>gjeldende [time]</b> og klikk på den.<br /><br />Akkurat som sensorene på Cog endrer verdi, vil denne blokken endres til å representere gjeldende tid.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-5": "Sett inn <b>[[current [hour]] mod [12]]</b> som LED-ID i <b>set LED</b>-blokken.<br /><br />Prøv å kjøre koden ved å trykke på det grønne flagget – Cog vil vise et enkelt rødt lys som viser hvor timeviseren ville vært på en klokke!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-6": "Vi vil sannsynligvis vise mer enn bare timen på klokken, så la oss finne ut hvordan vi kan vise minuttene også.<br /><br /><b>current [minute]</b>-blokken vil gi deg minuttet som et tall mellom 0 og 59!<br /><br />Dra det inn i kodeområdet og klikk på det for å se gjeldende minutt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-8": "For klokken vår ønsker vi imidlertid ikke at minuttviseren skal flytte seg til neste posisjon før minuttviseren er helt der. For eksempel klokken 17:09 ønsker vi fortsatt at minuttviseren skal være i «1»-posisjonen.<br /><br />For å gjøre det må vi alltid runde nedover. Det finnes en måte å gjøre det på i Blocks – ved å bruke <b>floor</b>-operatoren. Du finner det på operatoren som som standard sier <b>[abs]</b>, i rullegardinlisten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-9": "Legg til en blokk for å <b>stille LED-lampen [[gulv] for [[gjeldende [minutt]] / [5]] til [blå]</b>.<br /><br />Prøv det! Trykk på det grønne flagget, og nå vil Cog vise minuttviseren som et blått lys, samt timeviseren som et rødt lys.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-10": "Hvordan ville du også vist sekundene?<br /><br />Legg til en annen <b>Set LED</b>-blokk, men denne gangen setter du LED <b>[[gulv] for [[gjeldende [sekund]] / [5]] til [grønn]</b>.<br /><br />Husk at du kan høyreklikke eller holde inne en blokk for å få muligheten til å duplisere den – det kan spare mye tid.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-11": "Prøv det ut!<br /><br />Nå får du tre «visere» på klokken – rød for timer, blå for minutter og grønn for sekunder!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-13": "Prøv det ut!<br /><br />Nå oppdateres tiden hvert 5. sekund, og viserne beveger seg rundt klokken!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-14": "Det er litt forvirrende hvis de forskjellige viserne er på samme sted. Prøv å legge til en liten pause mellom hver LED-lampe, og endre pausen på slutten til bare 3 sekunder.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-16": "Det hadde vært kult å kunne vise om det var am eller pm også.<br /><br />Vi kan gjøre dette ved å endre bakgrunnsfargen på klokken avhengig av om timen er mindre enn 12.<br /><br />Erstatt <b>Slå av alle LED-lys</b>-blokken med en <b>if … else</b>-blokk som sjekker om gjeldende time er < 12.<br /><br />Velg deretter to forskjellige farger for å angi ring-LED-lysene for pm og am. I dette eksemplet har vi valgt oransje for am og lilla for pm – fargene må være forskjellige fra de du bruker for å vise viserne på klokken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-18": "Hvordan kan vi ellers vise tiden?<br /><br />Denne koden viser timen ved å slå på alle LED-lampene fra klokken 12-posisjonen til gjeldende time – slik at flere LED-lamper vil slå seg på etter hvert som tiden blir senere.<br /><br />Slett den forrige klokkekoden din og prøv den ut!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-20": "Du kan også bruke ett tannhjul til å vise at timene går saktere, ved å gradvis slå på den neste LED-lampen etter hvert som minuttene går.<br /><br />Slett den forrige klokkekoden din og prøv den ut!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-21": "Prøv det ut!<br /><br />LED-lampene vil sakte tennes etter hvert som tiden går – for eksempel viser klokken vår halv sju på dette bildet!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-22": "Hvis du har tid, kan vi prøve å gjøre den originale klokken vår mer sofistikert.<br /><br />Vi kan animere sekundviseren til å blinke hvert sekund, slik som dette – da spiller det ingen rolle om den dekker over de andre viserne.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-23": "For å gjøre dette skal vi bruke en liste for å holde oversikt over hvilken farge hver LED skal ha.<br /><br />Gå til kategorien <b>Variabler</b> og klikk på knappen <b>Lag en liste</b> for å lage en liste kalt <b>leds</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-26": "Lag to nye variabler kalt <b>time</b> og <b>minutt</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-27": "Legg til blokker for å sette disse variablene til posisjonene til time- og minuttviserne, ved å bruke samme matematikk som du gjorde tidligere.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-28": "Nå skal vi endre elementene i listen for å angi fargene for time- og minuttviserne.<br /><br /><b>erstatt element</b>-blokken vil endre elementet på den angitte posisjonen i listen. Siden listen begynner å nummerere elementene sine på 1, må vi legge til 1 til time- og minuttvariablene.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-29": "Prøv å kjøre koden ved å trykke på det grønne flagget.<br /><br />Nå vil listen oppdateres med forskjellige fargekoder for time- og minuttviserne.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-30": "La oss lage noe som håndterer det bedre når time- og minuttviserne er på samme sted.<br /><br />Legg til en <b>if</b>-setning for å sjekke om time- og minuttvariablene er de samme (dvs. om time- og minuttviserne er på samme sted).<br /><br />Hvis det er tilfelle, endre elementet i listen til en annen farge – i dette tilfellet har vi valgt lilla ved å sette rød og blå til 255 og grønn til 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-31": "OK, så vi har nå en liste som representerer fargene vi ønsker å vise på LED-ene på Cog – det er på tide å vise dem!<br /><br />Lag en annen variabel kalt <b>ledID</b> og bruk den i en løkke for å angi de 12 LED-ene på Cog.<br /><br />For å angi de forskjellige fargene refererer vi til elementene på <b>leds</b>-listen ved hjelp av <b>item</b>-blokken – husk å legge til 1.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-32": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-33": "La oss sette koden inn i en løkke slik at den oppdateres automatisk.<br /><br />Legg til en <b>wait until</b>-blokk på slutten, og sett den til å vente til minuttviseren må endres, ved å sjekke verdien av hvor minuttviseren skal være mot verdien som er lagret i <b>minute</b>-variabelen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-34": "Sett deretter koden inn i en *forever*-løkke slik at den kjører gjentatte ganger.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-36": "Lag en annen variabel kalt <b>sekund</b>, og angi den på samme måte som vi har angitt sekundviserposisjonen tidligere.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-37": "Legg nå til blokker for å sette sekundviser-LED-en til grønn, vent et sekund, og endre den deretter tilbake til fargen som er i <b>LED-lysene</b>-listen.<br /><br />På denne måten har vi husket hvilken farge LED-lysene skal ha etter at vi har endret den. <b>LED-lysene</b>-listen brukes til å huske statusen til time- og minuttviserne på klokken vår.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-38": "Sett også den brukte koden i en <b>evig</b> løkke.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-39": "Koden din skal nå se slik ut – prøv det ut!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-40": "Bra jobbet!<br /><br />Du har brukt mye matematikk for å lage en klokke med Cog! Du tenkte på forskjellige måter du kunne vise tiden på.<br /><br />Hvis du kom til slutten, lærte du også om lister som en måte å lagre ordnet informasjon på, for eksempel statusen til hver LED-lampe på Cog.<br /><br />Neste trinn:<ul><li>Kan du få denne nye klokken til å endre bakgrunnsfargen avhengig av om det er am eller pm?</li><li>Ville det gitt mer mening om «sekundviseren» faktisk roterte hvert 5. minutt for å vise tiden mer nøyaktig? Hva ville du endret for å få det til å skje?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.name": "Uttrekkshjul",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.description": "La oss lage et uttrekkshjul!<br /><br />Dette er et spesielt hjul som holder oversikt over hvor langt det ruller!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-1": "I tidligere aktiviteter har vi sett hvordan vi kan bruke akselerometeret på Cog til å måle hvilken retning Cog vipper i.<br /><br />Vi kan også bruke denne sensoren til å finne ut vinkelen Cog er i.<br /><br />Vi bruker det til å gjøre Cog om til et trillehjul – det er en enhet for å måle avstander ved å rulle et hjul langs dem.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-2": "Legg til en <b>når grønt flagg klikket</b>-blokk og en <b>evig</b>-løkke.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-4": "<b>Angi</b> <b>vinkelen</b> til <b>atan2</b> for [Accelerometer [Y]] og [Accelerometer [X]].<br /><br />Du finner <b>atan2</b>-blokken i operatorkategorien.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-6": "Prøv det ut!<br /><br />Trykk på det grønne flagget og hold deretter Cog vertikalt med den gule pilen pekende opp, og roter den rundt som et ratt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-7": "Når du roterer tannhjulet med klokken, vil du se at vinkelen endres fra 0 grader når tannhjulet peker oppover, opp til 180 grader når tannhjulet peker nedover.<br /><br />Deretter vil den hoppe til -180 grader, før den øker tilbake til 0 grader mens du fortsetter å rotere med klokken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-10": "La oss legge til en sprite på skjermen for å vise rotasjonen til Cog.<br /><br />Fra <i>Velg en sprite</i>-menyen velger du alternativet <i>maling</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-11": "La oss tegne en sprite som representerer Cog!<br /><br />Start med å legge til en sirkel, og bruk deretter linjeverktøyet til å lage en sekskant rundt den.<br /><br />Sirkelen er bare en veiledning for å hjelpe oss med å få riktig sekskant – ikke bekymre deg hvis sekskanten din ikke er perfekt!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-12": "Slett sirkelen, og erstatt den med en mindre sirkel i midten for å representere knappen på Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-13": "Og til slutt tegner du en trekant med linjeverktøyet, og farger den gul.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-14": "Klikk på <i>Kode</i>-fanen for å gå tilbake til kodingsskjermen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-15": "Med spriten valgt, legg til disse blokkene:<ul><li>Når det grønne flagget klikkes</li><li>For alltid</li><ul><li>Pek i retning [vinkel]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-16": "Prøv det ut!<br /><br />Trykk på det grønne flagget og roter deretter tannhjulet – du vil se at spriten roterer også!<br /><br />Det er imidlertid et problem – spriten er 90 grader unna tannhjulet – det er fordi Blocks-grensesnittet teller venstrepunkt som 0 grader, mens vi behandler opppeking som 0 grader.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-17": "For å konvertere mellom disse ulike konvensjonene, endre koden for å legge til 90 grader til vinkelen.<br /><br />Prøv igjen, og bevegelsen til tannhjulsspriten vil matche den til ditt virkelige tannhjul!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-18": "Velg Tannhjul igjen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-20": "Vinkelvariabelen vår forteller oss en rotasjon fra 0 til 360 grader, men vi har bare 12 LED-er rundt ringen på tannhjulet.<br /><br />Det betyr at oppløsningen vil være 30 grader per LED, siden 360 grader / 12 LED-er = 30 grader / LED.<br /><br />Legg til disse blokkene i <b>forever loop</b>:<ul><li>Sett [LED] til [[round [angle]/[30]] mod [12]]</li></ul><br />Vi deler vinkelen med 30 for å få et tall mellom 0 og 12, og runder den deretter av siden vi trenger et heltall (eller heltall) for å spesifisere hvilken LED vi skal lyse opp.<br /><br />Siden LED-ene våre bare er nummerert fra 0 til 11, bruker vi mod-blokken slik vi gjorde i klokkeaktiviteten. Dette er modulusoperatoren og returnerer resten når de to tallene deles – så i stedet for å få tallet 12 for LED-ID-en, får vi en 0 igjen – som er det vi ønsker fordi LED 0 er i 12-posisjonen på tannhjulet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-21": "Legg nå til disse blokkene i <b>forever-løkken</b> også:<ul><li>Hvis [not [[LED] = [lastLED]]] så</li><ul><li>Sett LED [LED] til [blå]</li><li>Sett LED [lastLED] til [svart]</li><li>Sett [lastLED] til [LED]</li></ul></ul><br />Kan du finne ut hvordan den nye kodedelen fungerer og hva den vil gjøre?<br /><br />Vi bruker LED- og lastLED-variablene for å holde oversikt over hvilken LED som lyser, og om vi må endre den. Når verdien av LED endres fra én iterasjon av løkken til den neste, vil betingelsen i if-setningen være sann.<br /><br />Når det skjer, slår vi på den nye LED-en og slår av den gamle (ved å sette den til svart, som er det samme som å være av for et lys). Til slutt oppdaterer vi lastLED-variabelen slik at den er satt for neste gang i løkken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-22": "Prøv det ut!<br /><br />Trykk på det grønne flagget og roter deretter tannhjulet.<br /><br />Du vil legge merke til at noe morsomt skjer! Noen ganger er LED-lampen som lyser øverst, og noen ganger er den nederst!<br /><br />Det er litt forvirrende, og ikke det vi siktet til.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-23": "Hvis du tenker over det, er det fordi LED-en roterer med klokken samtidig som vi roterer tannhjulet med klokken.<br /><br />Det vi egentlig ønsker, at LED-en alltid skal være nederst på tannhjulet, er at den roterer i motsatt retning av hvordan vi roterer tannhjulet.<br /><br />Hvordan kan vi få det til å skje?<br /><br />Endre koden din slik at den sier <b>sett [LED] til [[rund [[360] - [vinkel]] / [30]] mod [12]]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-25": "Det er ganske nært, men det er fortsatt ikke helt det vi siktet til. Det ville vært mer intuitivt om LED-en var nederst på tannhjulet, i stedet for øverst.<br /><br />Hvordan kunne vi gjøre det?<br /><br />I utgangspunktet må vi legge til 6 til LED-variabelen – og akkurat som å legge til 6 timer vil rotere timeviseren halvveis rundt en urskive, vil å legge til 6 til LED-variabelen rotere halvveis rundt ringen med 12 LED-er.<br /><br />Vi vil stole på mod-operatoren for å løkke tallene rundt fra 11->0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-26": "Prøv det ut!<br /><br />Når du roterer tannhjulet, vil LED-lampen som lyser være nederst.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-27": "OK! Nå har vi fått noen gode tilbakemeldinger fra brukerne om at rotasjonsfølingen fungerer. La oss få tannhjulet til å måle avstand!<br /><br />Til neste del trenger du en sirkel av kartong – dette blir hjulet vårt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-28": "Tegn en sirkel rundt den øvre siden av tannhjulet, og skjær deretter ut en sekskant midt i sirkelen.<br /><br />(du trenger ikke å være helt i midten)<br /><br />Mål diameteren på sirkelen din.<br /><br />Den her er omtrent 200 mm i diameter, som betyr at radiusen er 100 mm.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-29": "La oss sette inn det tallet i programmet vårt.<br /><br />Lag to nye variabler kalt <i>radius</i> og <i>circumference</i>.<br /><br />Legg til nye blokker for å sette dem før den evige løkken:<ul><li>Sett [radius] til [100]</li><li>Sett [circumference] til [2] * [[3.14] * [radius]]]</li></ul><br />Erstatt 100 der med den radiusen til hjulet ditt er.<br /><br />Vi måler tilbakelagt avstand når hjulet roterer, hvor hver omdreining av hjulet vil dekke en avstand lik hjulets omkrets.<br /><br />Husk at omkretsen er lik 2 * pi * radius. Her tilnærmer vi pi som 3,14.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-31": "For å la oss telle antall omdreininger, må vi holde oversikt over når vinkelen endres fra 360 -> 0, og omvendt.<br /><br />Vi bruker lastAngle-variabelen til dette. Når vinkelen går fra 360 til 0 grader, vil resultatet av [vinkel] - [lastAngle] være -360.<br /><br />I praksis vil målingen vår sannsynligvis hoppe fra noe sånt som 355 -> 5 grader.<br /><br />Legg til disse blokkene i <b>forever-løkken</b>:<ul><li>Hvis [[vinkel] - [lastAngle] < [-180]] så</li><ul><li>Endre [omdreininger] med [1]</li></ul></ul><br />Så, hvis vinkelen plutselig reduseres mye (180 grader eller mer), vet vi at vi bør legge til 1 til omdreiningstallet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-32": "Vi må også spore omdreininger i motsatt retning. Når det skjer, vil vinkelen hoppe fra 0 -> 360 grader.<br /><br />Legg til disse blokkene i <b>forever-løkken</b>:<ul><li>Hvis [[vinkel] - [lastAngle]] > [180]] så</li><ul><li>Endre [omdreininger] med [-1]</li></ul></ul><br />Det betyr at hvis vinkelen plutselig hopper mye opp, reduserer vi omdreiningstallet med 1.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-34": "Nå er det på tide å regne ut hvor langt hjulet har rullet!<br /><br />Legg til denne blokken i <b>forever loop</b>:<ul><li>Sett [totalRotation] til [[[revolutions] * [360]] + [[angle]]]</li></ul><br />Dette vil legge til 360 grader for hver rotasjon til gjeldende vinkelmåling for å få den totale rotasjonen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-35": "Legg nå til denne blokken:<ul><li>Sett [avstand] til [[[totalRotation] / [360]] * [omkrets]]</li></ul><br />Variabelen totalRotation gir den totale rotasjonen i grader, så ved å dele den med 360 får vi antall omdreininger som et rasjonelt tall - et tall som kan ha ting etter desimaltegnet i stedet for bare hele tall.<br /><br />Å multiplisere det med omkretsen forteller oss den totale avstanden hjulet har rullet!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-36": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-37": "Det hadde vært flott å ha en måte å enkelt nullstille avstandstelleren på.<br /><br />Legg til disse blokkene:<ul><li>Ved knappetrykk</li><li>Sett [avstand] til [0]</li><li>Sett [omdreininger] til [0]</li><li>Sett [startvinkel] til [vinkel]</li><li>Sett [lastAngle] til [vinkel]</li></ul><br />Du må lage en ny variabel kalt <i>startvinkel</i>.<br /><br />Vi bruker den for å sikre at vi kan begynne å telle fra hvilken som helst vinkel tannhjulet er i når du trykker på knappen, ikke bare når tannhjulet peker oppover.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-39": "Prøv det ut!<br /><br />Skaff deg en linjal og plasser tannhjulet ved siden av det ved 0-merket.<br /><br />Trykk på knappen for å tilbakestille tannhjulet, og roter deretter hjulet langs linjalen – du skal oppdage at avstandsvariabelen holder oversikt over hvor langt du har rullet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-40": "Du har kanskje lagt merke til at det var en liste over avstander i den siste videoen.<br /><br />For å lage det, klikk på <b>Lag en liste</b>-knappen og lag en liste som heter <i>avstander</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-41": "Legg deretter til en <b>legg til [avstand] til [avstander]</b>-blokk rett etter blokken for å trykke på knappen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-42": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-43": "Bra jobbet!<br /><br />Du har lært hvordan du gjør et tannhjul om til en enhet for å måle avstander! I virkeligheten brukes trillehjul til å måle lange avstander, og du får hjul med håndtak du kan rulle langs.<br /><br />Du brukte litt matematikk for å konvertere diameteren du målte til en radius og deretter en omkrets, og brukte det sammen med vinkelmålingen for å beregne avstanden.<br /><br />Du tenkte mye på vinkler og brukte en variabel for å holde oversikt over hvordan vinkelen på tannhjulet endret seg, og betingelsesverdier for å registrere hvordan antallet totale omdreininger endret seg.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.name": "Flygende flaggermusspill",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.description": "La oss lage et nytt spill!<br /><br />Denne gangen skal vi lage et spill om en fruktflaggermus som er ganske kresen på hva den spiser.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-1": "La oss lage et nytt spill!<br /><br />Denne gangen skal vi lage et spill om en fruktflaggermus som er ganske kresen på hva den spiser.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-4": "La oss legge til spriten nå.<br /><br />Trykk på <b>Velg en sprite</b>-knappen og velg deretter flaggermus-spriten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-5": "Med Flaggermus-spriten valgt, legg til disse blokkene:<ul><li>Når jeg mottar [oppdater posisjon]</li><ul><li>Sett x til [[ay] * 200]</li></ul></ul><br />Dette betyr at hver gang <b>ay</b>-variabelen oppdateres, flytter vi også flaggermusens posisjon.<br /><br />Ay-variabelen vil stort sett variere mellom -1 og 1, så ved å multiplisere med 200 setter vi x-posisjonen til å være mellom -200 og 200.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-6": "Prøv det ut!<br /><br />Trykk på det grønne flagget, og vipp deretter tannhjulet fra side til side, så beveger balltret seg også!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-8": "La oss lage en vei slik at flaggermusen kan blafre med vingene og klatre igjen.<br /><br />Velg Tannhjul igjen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-9": "Legg til disse blokkene:<ul><li>På objekt registrert [høyre]</li><li>Send [flap]</li></ul><br />Vi bruker den høyre IR-objektsensoren til å være knappen for å få flaggermusen til å flakse med vingene, og vi bruker en ny melding kalt <b>flap</b> for å sende den instruksjonen til flaggermus-spriten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-10": "Velg flaggermus-spriten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-11": "Finn den neste kostymeblokken i Utseende-kategorien.<br /><br />Prøv å klikke på den – du skal se at flaggermusens sprite endres til en i en annen positur!<br /><br />Klikk på den et par ganger – flaggermus-spriten har fire forskjellige positurer, som kalles kostymer i blokkgrensesnittet.<br /><br />Vi kan bruke disse kostymene til å animere bevegelser på flaggermusen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-12": "Legg til disse blokkene:<ul><li>Når jeg mottar flap</li><li>Gjenta [4]</li><ul><li>Neste kostyme</li><li>Endre y med [10]</li></ul></ul><br />Siden flaggermusen har fire kostymer, gjør vi denne løkken fire ganger for å gå gjennom dem alle.<br /><br />Samtidig flytter vi flaggermusen oppover skjermen slik at den flyter opp mens den flakser med vingene.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-13": "Vi bør også sørge for at kostymet alltid starter med det riktige i starten av spillet.<br /><br />Legg til et byttekostyme i [bat-a]-blokken rett etter at blokkstørrelsen er satt til [50]%.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-14": "Prøv det ut!<br /><br />Trykk på det grønne flagget for å starte koden, og prøv deretter å trykke på den høyre IR-objektsensoren med fingeren – flaggermusen vil fly opp på skjermen!<br /><br />Du kan fortsatt vippe til venstre og høyre for å styre.<br /><br />Trykk på det røde stoppskiltet for å stoppe koden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-16": "Ok – det er på tide å gjøre dette til mer en lek!<br /><br />La oss begynne med å lage en handleliste til balltreet vårt.<br /><br />Gå til kategorien <i>Variabler</i> og klikk på knappen <b>Lag en liste</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-17": "Flaggermusen vår er en fruktflaggermus, og de liker å spise frukt!<br /><br />Lag en liste som heter <b>frukt</b>.<br /><br />En tom liste vil vises på skjermen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-18": "Vi kan legge til ting i listen ved å bruke de nye blokkene som har dukket opp i variabeldelen.<br /><br />Først må vi sørge for at balltreet har en tom liste når spillet starter.<br /><br />Legg til disse blokkene:<ul><li>Når det grønne flagget klikkes</li><li>Slett all [frukt]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-19": "Deretter legger vi til et par frukter på handlelisten til flaggermusen vår.<br /><br />Legg til en <b>legg til [ting] i [frukt]</b>-blokk, og endre den til å si <b>legg til [banan] i [frukt]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-20": "Gjør det samme igjen for å legge til et <b>eple</b> på listen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-21": "Trykk på det grønne flagget, så ser du at banan- og eplevarene er lagt til fruktlisten!<br /><br />Nederst står det også at listen er på 2 varer.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-22": "La oss få flaggermusen til å velge noe den vil ha fra handlelisten.<br /><br />Lag en ny variabel som heter <b>frukt</b>.<br /><br />Du vil legge merke til at du kan ha en variabel som heter frukt og en liste som heter frukt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-24": "Finn <b>lengden på [fruit]</b>-blokken og dra den til kodeområdet.<br /><br />Hvis du trykker på den, vil du se at den returnerer antall elementer i listen – i dette tilfellet 2.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-25": "Hvis du kombinerer disse to blokkene slik at de sier <b>item [length of [fruit]] av [fruit]</b>, vil den finne det siste elementet i listen.<br /><br />Det er fordi <b>length of [fruit]</b>-blokken evalueres først, og returnerer en verdi på 2, slik du så før. <b>item</b>-blokken evalueres deretter, og tar tallet 2 som input, og returnerer deretter det andre elementet i listen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-28": "Prøv det ut!<br /><br />Nå vil flaggermusen velge en tilfeldig frukt hvert 5. sekund å tenke på!<br /><br />Koden vil også sende meldingen <b>vis frukt</b>, som vi snart skal bruke.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-31": "Med bananene valgt, legg til disse blokkene:<ul><li>Når det grønne flagget klikkes</li><li>For alltid</li><ul><li>Hvis [berører [Bat]] så</li></ul></ul><br />Denne koden vil også kjøre når spillet startes, og vil sjekke om balltret berører bananene.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-32": "Hvis flaggermusen har nådd bananene, vil vi sjekke om det var frukten den ønsket å få.<br /><br />Legg til en <b>if … else</b>-betingelse nestet i if-blokken, og sett betingelsen til <b>[fruit] = [banana]</b>, der fruit er variabelen du opprettet tidligere.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-33": "Hvis frukten er riktig, øker vi poengsummen med 1 og sender riktig melding.<br /><br />Ellers reduserer vi poengsummen med 1 og sender feil melding.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-34": "For å unngå å score (eller miste!) poeng mer enn én gang, vil vi få bananene til å gjemme seg når flaggermusen har nådd dem.<br /><br />Legg til en <b>skjul</b>-blokk etter hvis… ellers-blokken – det betyr at bananene alltid vil gjemme seg når flaggermusen berører dem.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-36": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-38": "Kopier koden fra bananene til eple-spriten ved å dra den til eple-spriten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-39": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-40": "Prøv det ut!<br /><br />Trykk på det grønne flagget for å starte, og prøv deretter å samle frukten som flaggermusen tenker på!<br /><br />Trykk på det røde stoppskiltet for å stoppe koden når du er ferdig.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-41": "La oss legge til litt tilbakemelding om hvorvidt du får riktig frukt.<br /><br />Velg Cog igjen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-42": "Legg til disse blokkene:<ul><li>Når jeg mottar [riktig]</li><li>Sett [ring]-LED-ene til [grønn]</li><li>Spill note [C6] i [0,5] sekunder</li><li>Slå av alle LED-ene</li></ul><br />Og<br /><br /><ul><li>Sett [ring]-LED-ene til [rød]</li><li>Når jeg mottar [feil]</li><li>Spill note [C4] i [0,5] sekunder</li><li>Slå av alle LED-ene</li></ul><br />Disse vil bruke de riktige og feilaktige meldingene du kodet tidligere for fruktene, og få Cog til å lyse og spille av en lyd hver gang du samler en frukt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-43": "Prøv det ut!<br /><br />Nå får du tilbakemelding fra Cog mens du samler frukt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-44": "Bra jobbet!<br /><br />Du har lært hvordan du bruker kostymer i Blocks for å animere sprites.<br /><br />Du lærte også hvordan du lager en liste og velger elementer fra den, og bruker disse som en del av et spill.<br /><br />Neste trinn:<ul><li>Kan du legge til mer frukt?</li><li>Kan du legge til noe som flaggermusen aldri vil spise?</li><li>Kan du gjøre spillet vanskeligere etter hvert som tiden går?</li><li>Kan du få Cog til å vise poengsummen på slutten?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.description": "La oss lage en stoppeklokke med rundetidtaker!<br /><br />Dette er en spesiell stoppeklokke som holder oversikt over så mange rundetider vi vil.<br />Vi bruker en liste for å lagre disse.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-1": "La oss lage en stoppeklokke med rundetidtaker!<br /><br />Dette er en spesiell stoppeklokke som holder oversikt over så mange rundetider vi vil.<br />Vi bruker en liste for å lagre disse.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-2": "Start med å lage en liste som heter <b>ganger</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-4": "Trykk på knappen på tannhjulet – hver gang du trykker på den, vil et nytt tidspunkt bli lagt til i listen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-5": "Det er imidlertid et par problemer. Første gang vi la til var det litt tilfeldig, siden vi ikke hadde satt opp tidtakeren først.<br /><br />Vi har heller ingen måte å stoppe tidtakeren og tømme listen over rundetider.<br /><br />La oss fikse det!<br /><br />Legg til en variabel kalt <b>started</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-6": "Vi skal få risting av tannhjulet til å stoppe timeren.<br /><br />Legg til disse blokkene:<br /><ul><li>Ved risting</li><li>Sett <b>startet</b> til <b>false</b></li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-7": "La oss nå endre hva knappen gjør basert på stoppeklokkens status - dvs. avhengig av om den er startet eller ikke.<br /><br />Endre koden under <b>ved trykk på knapp</b>-blokken til å være:<br /><ul><li>Ved trykk på knapp</li><li>Hvis <b>startet</b> = <b>true</b>, så</li><ul><li>Legg til <b>timer</b> til <b>tider</b></li></ul><li>Ellers</li><ul><li>Slett alle <b>tider</b></li></ul><li>Tilbakestill timer</li></ul><br />Så, hvis stoppeklokken har blitt startet, vil rundetiden bli lagt til i listen. Hvis ikke, vil listen over gamle tider bli slettet, slik at en ny liste kan startes.<br /><br />I begge tilfeller vil timeren bli tilbakestilt, klar til å registrere neste rundetid.<br /><br />Kan du finne hva som mangler i denne koden?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-8": "Bra jobbet hvis du så at vi også må sette <b>started</b>-variabelen til <b>true</b> når stoppeklokken har startet!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-9": "Rist på tannhjulet for å tilbakestille alt, og trykk deretter på knappen for å starte timeren – det vil slette de gamle tidene fra listen og tilbakestille timeren.<br /><br />Hver gang du trykker på knappen etter det, vil en ny tid bli lagt til listen!<br /><br />Hvis du rister på tannhjulet igjen etter at siste tid er registrert, vil du tilbakestille den slik at neste knappetrykk starter et nytt sett med tider.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-11": "Vi må også legge til tilbakemeldinger som viser når knappen er trykket inn og når stoppeklokken går.<br /><br />På slutten av <b>på-knapp-trykk</b>-blokkene, legg til disse blokkene:<br /><ul><li>Sett <b>ring</b>-LED-ene til <b>grønn</b></li><li>Spill tonen <b>C6</b> i <b>0,5</b> sekunder</li><li>Sett <b>ring</b>-LED-ene til <b>blå</b></li><li>Sett <b>ring</b>-LED-ene til mønsteret <b>Spin1</b></li></ul><br />Nå, hver gang du trykker på knappen, vil du få en bekreftelseslyd, og lyset vil blinke grønt, før de begynner å spinne blått for å indikere at stoppeklokken går.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-12": "Prøv det ut!<br /><br />Det er mye enklere nå å se om stoppeklokken er stoppet eller startet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-13": "Kan du finne feilen i koden vår?<br /><br />Hva skjer hvis du prøver å registrere tider på mindre enn 0,5 sekunder?<br /><br />Det vil du ikke kunne – fordi koden fra forrige knappetrykk fortsatt vil kjøre og spille noten.<br /><br />Hvordan kan vi fikse dette, mens vi fortsatt spiller noten i 0,5 sekunder?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-14": "En måte å fikse dette på er å bruke kringkastingsblokken til å sende en melding som utløser lys og lyd i stedet.<br /><br />Husker du at kringkastings- og venteblokken ikke ville fullføre kjøringen før all koden den utløste var ferdig? Kringkastingsblokken gjør ikke det, så snart den har sendt knappetrykkmeldingen, vil den fullføre kjøringen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-15": "Prøv det ut!<br /><br />Det er mye enklere nå å se om stoppeklokken er stoppet eller startet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-16": "Kult, nå fungerer stoppeklokken vår ganske bra!<br /><br />Ofte når vi kjører kretser, vil vi vite gjennomsnittstiden vår. La oss få stoppeklokken til å beregne det også!<br /><br />Legg til to variabler, én kalt <b>gjennomsnitt</b> og én kalt <b>teller</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-18": "For å få gjennomsnittet legger du sammen alle tallene i listen, og deler deretter på antall elementer.<br /><br />Vi itererer gjennom listen ved hjelp av en repetisjonsløkke, og legger sammen alle elementene.<br /><br />Legg til en repetisjonsblokk og sett antall repetisjoner til <b>lengde på ganger</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-21": "OK, det går bra, men nå lagrer gjennomsnittsvariabelen faktisk summen av alle tidene våre.<br /><br />For å få gjennomsnittet må vi dele det på antall elementer i listen.<br /><br />Legg til en <b>set average til [average / counter]</b>-blokk.<br /><br />Tellervariabelen er for øyeblikket satt til å ha telt hvor mange elementer som var i listen, så vi kan bruke den som divisor for å få gjennomsnittet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-23": "Bra jobbet!<br /><br />Du har laget en veldig fancy stoppeklokke som kan registrere massevis av rundetider, fortelle deg hvor mange rundetider den er registrert, og til og med beregne gjennomsnittet for deg!<br /><br />Hva kan du bruke rundetimeren til å ta tiden?<br /><br />Kan du bruke lysene på tannhjulet til å gi mer tilbakemelding når stoppeklokken går? Kanskje vise sekunder som går ved å slå på LED-lysene på tannhjulet?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.name": "Quiz-spill",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.description": "La oss lage et quiz-spill!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-1": "La oss lage et quiz-spill! <br/><br/>Vi setter inn en liste med spørsmål og svar, og bruker tannhjul som summere for deltakerne. <br/><br/>Denne aktiviteten bruker flere tannhjul koblet til ett program. Hvis mulig, bytt på å dele tannhjul mellom små grupper for å kjøre programmet. <br/><br/>Hvis du bare har tilgang til ett tannhjul, tenk på hvordan du kan endre koden til å bruke IR-sensorene på tannhjulet som summere også, slik at tre personer kan spille på ett tannhjul.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-2": "La oss begynne med å gjøre ting klare til quizen. <br/><br/>Vi trenger en sprite som skal fungere som vert – velg din favoritt blant alternativene. Dette eksemplet bruker en krabbe, men du kan bruke hvilken som helst sprite, eller tegne din egen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-3": "Vi må lage tre lister – én for *spørsmål*, én for *svar* og én for å spore *poengsummene* til deltakerne. <br/><br/>Legg til tre lister kalt *spørsmål*, *svar* og *poengsummene*.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-4": "Legg til disse blokkene for å fylle ut spørsmålslisten. <br/><ul><li>Når det klikkes på det grønne flagget</li><li>Slett alle [spørsmål]</li><li>Legg til [Hva er 2+2?] i [spørsmål]</li></ul>Sett inn så mange spørsmål du vil ved å legge til flere <i>legg til [] i [spørsmål]</i> blokker. <br/><br/>Gjør deretter det samme for svarene, og sørg for at spørsmålene dine stemmer overens med svarene dine.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-6": "La oss nå gjøre resultattavlen klar. <br/><br/>Lag en ny variabel kalt <i>antall spillere</i>, og legg til disse blokkene: <ul><li>Når det grønne flagget klikkes</li><li>Sett [antall spillere] til [2]</li><li>Slett alle [scores]</li><li>Gjenta [antall spillere]</li><ul><li>Legg til [0] i scores</li></ul>Endre innstillingen for antall spillere til antallet du har tenkt å ha – du kan alltid endre den igjen senere.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-7": "Vi itererer gjennom spørsmålslisten og lar spriten spørre hvert av dem. <br/><br/>For å gjøre dette bruker vi en repetisjonsløkke. Legg til disse blokkene: <ul><li>Når det grønne flagget klikkes</li><li>Gjenta [lengde på [spørsmål]]</li></ul>Det er imidlertid et lite problem – hva om koden vi nettopp har kjørt kjøres før den andre koden fyller ut spørsmålslisten? <br/><br/>Det er litt usikkert hva som egentlig vil skje – dette er en annen type feil, og vi kan kode ting litt annerledes for å sikre at koden kjører i den rekkefølgen vi ønsker.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-9": "Gi blokken tittelen <i>Fyll ut spørsmål</i>, og klikk OK.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-10": "En ny blokk vil dukke opp i blokkpaletten, og i kodeområdet vil du se en «hat block» med tittelen <i>define [fill in questions]</i>. <br/><br/>Uansett hvilken kode vi legger under den blokken, vil den kjøres når vi kaller <i>Fill in questions</i>-blokken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-12": "Plasser den nye <i>Fyll inn spørsmål</i>-blokken før repetisjonsløkken. <br/><br/>Nå vet vi sikkert at spørsmålslisten vil bli fylt ut før vi evaluerer lengden og begynner å iterere gjennom den.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-13": "Inne i repetisjonsløkken legger du til disse blokkene: <ul><li>Si [element [1] av [spørsmål]] i [2] sekunder</li><li>Send [svar nå]</li><li>Slett [1] av [spørsmål]</li><li>Slett [1] av [svar]</li></ul>Etter at hvert spørsmål er stilt, vil både det og svaret bli fjernet fra listene.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-16": "Lag en ny variabel kalt <i>spillernummer</i>. <br/><br/>Denne gangen må du sørge for å velge alternativet <i>Kun for denne spriten</i>. <br/><br/>Denne nye variabelen vil være det vi kaller en <b>lokal variabel</b>, den er bare tilgjengelig for denne spriten (eller dette tannhjulet, i dette tilfellet). <br/><br/>Hvis du endrer tilbake til spriten, vil variabelen forsvinne fra variabellisten i blokkpaletten, og vil dukke opp igjen når du velger tannhjul.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-18": "Vi ønsker bare å aktivere summerne når et spørsmål er stilt, så vi bruker meldingen <i>svar nå</i> som ble sendt da spriten stilte et spørsmål. <br/><br/>Legg til disse blokkene: <ul><li>Når jeg mottar [svar nå]</li><li>Sett [ring]-LED-ene til [blå]</li><li>Sett [ring]-LED-ene til mønsteret [Spin1]</li><li>Vent til [[[knapp klikket] = [true]] eller [[summer] > [0]]]]</li></ul>Du må lage en ny variabel kalt <b>summer</b> – vi bruker denne til å spore hvilken summer som trykkes først. <br/><br/>Du finner <i>eller</i>-blokken i kategorien Operatører. <br/><br/>Betingelsen i vent til-blokken er enten at knappen klikkes eller at summervariabelen er større enn 0. <br/><br/>På den måten kan vi vente til enten knappen på dette tannhjulet trykkes, eller en annen summer trykkes og summervariabelen settes et annet sted.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-19": "Legg til disse blokkene: <ul><li>Hvis [[button clicked] = [true]] then</li><ul><li>Sett [buzzer] til [player number]</li><li>Sett [ring] LED-er til [green]</li></ul>Ellers</li><ul><li>Slå av alle LED-er</li></ul></ul>Med denne koden, hvis det var knappen på dette tannhjulet som ble trykket først, setter vi <i>buzzer</i>-variabelen til dette <i>spillernummeret</i>, og slår lysene på tannhjulet grønt. <br/><br/>Ellers vil det bety at noen andre kom dit først, eller at vi gikk tom for tid, og vi vil bare slå av lysene i stedet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-21": "Endre koden slik at det står følgende i repetisjonsløkken for spørsmålene: <ul><li>Sett [summer] til [0]</li><li>Tilbakestill timer</li><li>Si [element [1] av [spørsmål]</li><li>Send [svar nå]</li><li>Vent til [[[summer] > [0]] eller [[timer] > [10]]]</li><li>Slett [1] av [spørsmål]</li><li>Slett [1] av [svar]</li></ul>Vi har brukt en annen <i>vent til</i> med en <i>eller</i>-betingelse. <br/><br/>Nå, hver gang etter å ha stilt et spørsmål, vil koden vente enten på at summervariabelen skal settes, eller på at 10 sekunder skal gå.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-22": "Nå, hver gang et spørsmål stilles, går det videre til neste spørsmål enten etter 10 sekunder eller så snart en summer (knappen på tannhjulet) trykkes inn. <br/><br/>Vi må fortsatt gi deltakeren vår en sjanse til å faktisk svare på spørsmålet før vi går videre til neste. <br/><br/>Lag en ny blokk kalt <i>sjekk svar</i> og plasser den etter <i>vent til</i>-blokken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-24": "Hvis summeren trykkes, gir vi personen som trykket på den noen sekunder til å svare på spørsmålet. <br/><br/>Legg til disse blokkene i if-betingelsen: <ul><li>Broadcast [buzzed]</li><li>Si [join [Ja, spillernummer] [buzzer]] i [6] sekunder</li></ul><i>join</i>-blokken finnes i Operators-kategorien, den kobler sammen to klumper (eller strenger) med tekst.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-26": "La oss gjøre noe med meldingen <i>bekreft svar</i>. <br/><br/>Velg Cog igjen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-27": "Legg til disse blokkene: <ul><li>Når jeg mottar [bekreft svar]</li><li>Hvis [[summer] = [spillernummer] så</li></ul>. <br/><br/>Senere vil vi ha flere tannhjul tilkoblet og kjøre denne koden. Denne if-betingelsen vil sjekke om det var dette tannhjulet som var den vellykkede summeren.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-28": "Legg til en <i>set LEDs</i> ved hjelp av ColorPicker-blokken i if-betingelsen, og angi at den skal vise en rød LED ved siden av den venstre IR-objektsensoren og en grønn ved siden av den høyre IR-objektsensoren.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-29": "Legg til disse blokkene: <ul><li>Vent til [[[obstacle sensed [left]] = [sann]] eller [[obstacle sensed [right]] = [sann]]]</li><li>Hvis [[obstacle sensed [right]] = [sann]] så</li></ul>Erstatt elementet [spillernummer] av [poengsummer] med [[element [1] av [poengsummer]] + [1]]<br/><br/>Ellers<br/><ul><li>Erstatt elementet [spillernummer] av [poengsummer] med [[element [1] av [poengsummer]] - [1]]</li></ul>Slå av alle LED-lamper. <br/><br/><i>vent til</i>-blokken vil vente til enten venstre eller høyre IR-sensor registrerer et objekt – det er her vi venter på at spilleren skal velge om de fikk svaret riktig eller galt. <br/><br/>Hvis de fikk riktig svar, har de dekket til den riktige IR-sensoren, siden det er der vi har satt det grønne lyset. <br/><br/>I så fall erstatter vi poengsummen deres på poengtavlen med samme tall pluss 1. <br/><br/>Hvis ikke, erstatter vi poengsummen deres på poengtavlen med samme tall minus 1. <br/><br/>På denne måten øker vi poengsummen deres hvis de svarer riktig på spørsmålet, og reduserer den hvis de svarer feil. <br/><br/>Så vær forsiktig – hvis du svarer raskt, men ikke vet svaret, mister du poeng!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-31": "Legg til disse blokkene: <ul><li>Når jeg mottar [buzzed]</li><li>Hvis [[buzzer] = [spillernummer]] så</li><ul><li>Sett [ledID] til [0]</li><li>Gjenta [6]</li><ul><li>Sett LED [ledID] til [lilla]</li><li>Sett LED [[ledID] + [1]] til [lilla]</li><li>Vent [1] sekunder</li><li>Endre [ledID] med [2]</li></ul></ul></ul>I løpet av de 6 sekundene spilleren har på seg til å svare på spørsmålet, vil de nå se en nedtelling på LED-ene på tannhjulet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-32": "Prøv det ut! <br/><br/>Spørsmålene blir stilt etter hverandre. Hvis du trykker på buzzeren, får du 6 sekunder til å svare mens cog viser en nedtelling, og deretter blir du bedt om å velge rødt eller grønt avhengig av om du svarte feil eller riktig.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-34": "I den tomme <i>else</i>-betingelsen i <i>sjekk svaret</i>-definisjonen, legg til disse blokkene: <ul><li>Si [For treg!] i [2] sekunder</li><li>Si [bli med i [Svaret var] [element [1] av [svar]] i [5] sekunder</li></ul>På denne måten, hvis ingen vibrerer i tide, vil spriten lese opp det riktige svaret for alle.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-35": "Det er på tide å legge til flere tannhjul slik at vi kan ha flere spillere!<br/><br/>Høyreklikk på tannhjulet og velg <i>dupliser</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-36": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-37": "I tillegg til at koden blir duplisert, vil de *lokale* variablene vi lagde også ha blitt det. <br/><br/>Når dette nye tannhjulet er valgt, endrer du spillernummeret til 2.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-38": "Koble til et nytt tannhjul og prøv det ut!<br/><br/>Nå vil det tannhjulet som summer først etter at et spørsmål er stilt, få sjansen til å svare.<br/><br/>Du kan legge til flere spillere ved å duplisere tannhjulet flere ganger!<br/><br/>Husk å oppdatere <i>spillernummer</i>-variabelen på hvert tannhjul.<br/><br/>Du må også angi antall spillere-variabelen slik at den samsvarer med <i>antallet</i> spillere.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-39": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-40": "Først skal vi finne ut hva den høyeste poengsummen er. <br/><br/>Lag en annen blokk kalt <i>find max score</i>. <br/><br/> Under <i>define [find max score]</i>-blokken legger du til disse blokkene:<ul><li>set [maxScore] to [item [1] of [scores]]</li><li>set [playerID] to [1]</li><li>repeat [length of [scores]]</li><ul>if [[item [playerID] of [scores]] > [maxScore]] then</li><ul><li>set [maxScore] to [item [playerID] of [scores]]</li><ul><li>endre [playerID] med [1]</li></ul></li></ul></li></ul><br/><br/> Du må lage variablene <i>maxScore</i> og <i>playerID</i>. <br/><br/>Denne koden vil <li>iterere</li> gjennom resultattavlen – gå gjennom den én oppføring om gangen – og sette <i>maxScore</i>-variabelen til den høyeste poengsummen den finner underveis.<br/><br/>Klikk på den delen av koden for å kjøre den – <i>maxScore</i>-variabelen skal ende opp med å bli satt til den høyeste verdien i poengsumlisten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-41": "Nå som vi vet hva den høyeste poengsummen er, må vi vite hvor mange spillere som fikk den poengsummen. <br/><br/>Lag en ny blokk kalt <i>hvor mange spillere med poengsum [poengsum]</i> – du kan gjøre dette ved å trykke på knappen <i>Legg til et inputtall eller en tekst</i> i vinduet Lag en blokk.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-42": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-43": "For å prøve det, prøv å kjøre blokken «how many players with score []» med poengsumparameteren satt til et tall som er i poengsumlisten din. Resultatvariabelen vil bli satt til antall spillere med den poengsummen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-44": "La oss begynne å bygge <i>announce winners</i>-funksjonen som vi opprettet tidligere. Legg disse blokkene til <i>define [announce winners]</i>-blokken:<ul><li>Find max score</li><li>How many players with score [maxScore]</li><li>If [[result] = [1] then</li><ul><li>Si [ join [The winner, with a score of ] [maxScore]] i [5] sekunder</li><li>Si [join [is Player ] [item # of [maxScore] in [scores]]</li></ul></ul>Når dette kjører, vil <i>maxScore</i>-variabelen bli satt til den høyeste poengsummen av <i>find max score</i>-funksjonen. Deretter vil <i>result</i>-variabelen bli satt til antall spillere med den poengsummen av <i>how many players with score [maxScore]</i>-blokken. Hvis det bare er én vinner, er det veldig enkelt å bare si hvem de er – og vi kan bruke <i>item # of [maxScore] in [scores]</i>-blokken for å slå opp hvor den poengsummen er på resultattavlen. Men hvis det er uavgjort og det er mer enn én vinner, er ting litt mer komplisert.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-45": "Inne i <i>else</i>-delen av <i>if … else</i>-blokken, legg til disse blokkene<ul><li>Si [join [join [There are ] [result]] [winners!]] i [5] sekunder</li><li>Si [join [With scores of ] [maxScore]] i [5] sekunder</li><li>Sett [winners] til å [join [Player] [item # of [maxScore] in [scores]]</li><li>Sett [playerID] til [item # of [maxScore] in [scores]</li><li>Gjenta til [[playerID] = [length of [scores]]</li><li>Endre [playerID] med [1]</li><li>Hvis [[item [playerID] of [scores] = [maxScore]] så</li><li>Sett [winners] til å [join [join [winners] [and Player]] [playerID]</li><li>Si [winners]</li></ul>Hvis det er mer enn én vinner, vil spriten si hvor mange det er, og deretter liste dem opp. Variabler kan lagre mer enn bare tall - her brukes <i>winners</i>-variabelen til å bygge opp en tekststreng som viser alle vinnerne.</br></br><i>repeat until</i>-løkken itererer fra den første poengsummen i listen som samsvarer med <i>maxScore</i>-variabelen, og helt til slutten. Hver gang den finner en annen poengsum som samsvarer, legger den den spilleren til i <i>winners</i>-variabelen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-46": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-47": "Bra jobbet! Du kodet et spillprogram ved hjelp av tannhjul som deltakernes summere!<br/><br/>Du brukte <b>lister</b> til å lagre spørsmål, svar og resultattavler.<br/><br/>Du brukte <b>lokale variabler</b> slik at hvert tannhjul kunne holde oversikt over spillernummeret sitt separat.<br/><br/>Vi lærte om å bruke <b>funksjoner</b> (lage våre egne blokker) for å holde koden vår ryddig og lettere å lese. Lettlest kode er enklere å feilsøke - og å dele opp lange kompliserte kodedeler i mindre biter kalles <b>funksjonell dekomposisjon</b><br/><br/>Funksjoner er også supernyttige der du kanskje vil kjøre kode mer enn én gang, og du ikke vil kopiere og lime den inn om og om igjen.<br/><br/>Du lærte også hvordan funksjoner kan ha parametere. Funksjonen for hvor mange spillere med poengsum tar inn en poengsum for å se etter<br/><br/>Neste trinn<ul><li>Kan du legge til flere spørsmål og svar (og kanskje flere tannhjul) i quizen din?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.name": "Bevegelsessporing",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.description": "La oss lage en bevegelsesmåler!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-1": "La oss bygge en bevegelsesmåler med Cog!<br/><br/>Vi bruker akselerometeret til å samle inn data om bevegelse, og deretter bruker vi det til å klassifisere hvert minutt som går som et aktivt minutt eller ikke.<br/><br/>Vi kan deretter vise et dashbord med fysisk aktivitet og be brukeren om å bevege seg rundt hvis de ikke har vært veldig aktive.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-2": "Lag en liste kalt <i>ax</i><br/><br/>Vi bruker denne til å lagre nylige avlesninger fra akselerometerets x-akse.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-3": "Legg til disse blokkene:<ul><li>Når det klikkes på grønt flagg</li><li>Sett [numSamples] til [10]</li><li>Slett alle [ax]</li><li>Gjenta [numSamples]</li><ul><li>Legg til [Accelerometer [X]] til [ax]</li></ul><li>For alltid</li><ul><li>Sett [sampleCounter] til [[[sampleCounter] mod [numSamples]] + [1]]</li><li>Erstatt elementet [sampleCounter] i [ax] med [Accelerometer [X]]</li><li>Vent [0,1] sekunder</li></ul></ul><br/>Du må opprette variablene <i>numSamples</i> og <i>sampleCounter</i>.<br/><br/>Hva tror du denne koden vil gjøre?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-4": "Prøv det ut!<br/><br/>Trykk på det grønne flagget for å kjøre koden, og flytt deretter tannhjulet rundt.<br/><br/>Du vil se at økslisten oppdateres hvert 0,1 sekund med den siste avlesningen (eller <i>prøven</i>) fra akselerometerets x-akse.<br/><br/>Hver ny prøve i økslisten erstatter den eldste, og vi bruker <i>mod</i>-operatoren for å sikre at <i>sampleCounter</i>-variabelen går i løkke fra slutten av listen tilbake til begynnelsen av den.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-6": "La oss legge til blokker for å tolke dette området og klassifisere det som bevegelse eller ikke.<br/><br/>Legg til disse blokkene:<ul><li>Når det grønne flagget klikkes</li><li>Sett [motionThreshold] til [0.2]</li><li>For alltid</li><ul><li>Vent [1] sekunder</li><li>Hent område</li><li>Hvis [[result] > [motionThreshold]], så</li><ul><li>Sett [motionDetected] til sann</li></ul><li>Ellers</li><ul><li>Sett [motionDetected] til usann</li></ul></ul></ul><br/>Her har vi definert en terskel - en verdi som vi sammenligner området for akselerometerprøver mot. Hvis området er høyere enn denne terskelen, sier vi at vi har oppdaget bevegelse, og hvis ikke, sier vi at vi ikke har det.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-7": "Prøv det ut!<br/>Nå vil programmet se på listen over prøver fra akselerometeret hvert sekund og avgjøre om det tror det har vært bevegelse eller ikke.<br/><br/>Det tar de 10 individuelle akselerometeravlesningene (eller prøvene) og beregner en enkelt sann eller usann deteksjon for bevegelse.<br/><br/>Vi kan endre variablene vi har satt for å justere denne oppførselen.<br/><br/>For eksempel kan vi endre <i>motionThreshold</i> for å gjøre programmet mer eller mindre følsomt for bevegelser.<br/><br/>Vi kan også endre <i>numSamples</i> for å variere hvor lenge et øyeblikksbilde av bevegelse vi ser på hver gang. Med 10 prøver tatt med intervaller på 0,1 sekunder ser vi etter om det har vært bevegelse i løpet av det siste sekundet, men hvis du økte <i>numSamples</i>, ville det sjekke for bevegelse over et lengre vindu.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-8": "OK, så vi har bygget et program som vil prøve å avgjøre, sekund for sekund, om tannhjulet har blitt flyttet i det hele tatt.<br/><br/>La oss gjøre mer med disse dataene!<br/><br/>Det ville være bra å avgjøre om vi tror et minutt har vært aktivt eller ikke generelt.<br/><br/>For å gjøre det, la oss telle antall aktive sekunder i hvert minutt.<br/><br/>Legg til en ny variabel kalt <i>activeSecondsThreshold</i> og en <i>set [activeSecondsThreshold] til [30]</i>-blokk rett etter <i>set [motionThreshold]</i>-blokken og før forever-løkken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-9": "Legg til en annen variabel kalt activeSeconds.<br/>Like innenfor den <i>forever</i>-løkken legger du til en <i>set [activeSeconds] to [0]</i>-blokk, og deretter en <i>repeat [60]</i>-blokk som omgir resten av koden i forever-løkken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-10": "Inne i betingelsen <i>if [[result] > [motionThreshold] then</i>, legg til en <i>change [activeSeconds] by [1]</i>-blokk.<br/>Med denne koden teller vi hvor mange sekunder av hver 60 vi tror er aktive.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-11": "Lag en ny liste kalt activeMinutes<br/>Rett etter <i>repeat [60]</i>-løkken (men fortsatt innenfor forever-løkken), legg til disse blokkene:<ul><li>Hvis [[activeSeconds] > [activeSecondsThreshold]] så</li><ul><li>Legg til [true] til [activeMinutes]</li></ul><li>Ellers</li><ul><li>Legg til [false] til [activeMinutes]</li></ul></ul><br/>Nå, etter hvert 60. sekund - så én gang i minuttet - sammenligner vi det totale antallet aktive sekunder i det minuttet med <i>activeSecondThreshold</i>-variabelen for å klassifisere om vi tror at minuttet som helhet har vært aktivt eller ikke.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-12": "La oss ikke glemme å tømme <i>activeMinutes</i>-listen i starten av programmet!<br/>Legg til en <i>delete all of [activeMinutes]</i>-blokk etter <i>set [activeSecondsThreshold]</i>-blokken.<br/>Du bør alltid huske å tilbakestille alle variablene og listene dine i starten av et program – dette kalles å initialisere variablene dine, og hvis du glemmer å gjøre det, er det et annet sted hvor feil kan komme inn!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-14": "La oss få litt annen nyttig informasjon å vise brukeren.<br/>Lag to nye variabler kalt <i>totalActiveSeconds</i> og <i>totalSeconds</i><br/>Initialiser dem begge ved å sette dem til 0 i starten av programmet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-15": "Kan du tenke deg hvor du bør legge til blokker for å øke disse nye variablene?<br/><br/>Et potensielt sted er som vist her, hvor <i>totalActiveSeconds</i> økes hver gang <i>activeSeconds</i> økes, og <i>totalSeconds</i> økes for hver iterasjon av <i>repeat [60]</i>-løkken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-16": "Prøv det ut!<br/>Nå vil programmet også registrere andelen aktive sekunder.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-17": "La oss rapportere noe av denne informasjonen på en mer brukervennlig måte.<br/><br/>Legg til en <i>broadcast [rapportstatistikk]</i>-blokk rett før slutten av <i>forever</i>-løkken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-18": "Legg til en ny sprite – du kan velge hvilken som helst du liker. I dette eksemplet har vi valgt en robot.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-19": "Legg til disse blokkene:<ul><li>Når jeg mottar [rapportstatistikk]</li><li>Si [join [join [join [join [Du har vært aktiv i ] [totalActiveSeconds]] [av ]] [totalSeconds]] [ sekunder]] i [5] sekunder</li><li>Si [join [join [Det er [rund av [[[totalActiveSeconds] / [totalSeconds]] * 100]]] [% av tiden]] i [5] sekunder</li></ul><br/>Nå, én gang i minuttet, vil spriten fortelle brukeren hvor aktiv de har vært og hva det er som en prosentandel av tiden som har gått.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-20": "Prøv det ut!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-21": "Legg til disse blokkene:<ul><li>Sett [minuteCounter] til [0]</li><li>Sett [totalActiveMinutes] til [0]</li><li>Gjenta [length of [activeMinutes]]</li><ul><li>Endre [minuteCounter] med [1]</li><li>Hvis [[item [minuteCounter] of [activeMinutes]] = [true]] så</li><ul><li>Endre [totalActiveMinutes] med [1]</li></ul></ul><li>Si [join [join [join [Og] [totalActiveMinutes]] [out of ]] [length of [activeMinutes]]] [minutes]] i [5] sekunder</li><li>Si [join [join [Det er] [[round [[[totalActiveMinutes] / [length of [activeMinutes]] * 100]]] [% of the minutes]] i [5] sekunder</li></ul><br/>Nå vil sprite også si hvor mange av minuttene vi har klassifisert som aktive.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-22": "Prøv det ut!<br/><br/>Du vil sannsynligvis oppdage at de to rapporterte prosentene er forskjellige fra hverandre – det skyldes de to forskjellige måtene vi grupperte og klassifiserte dataene på.<br/><br/>Hver gang noen programmerer et system for å konvertere mange individuelle avlesninger til enklere statistikk, må de ta avgjørelser om hvordan de skal gjøre det – det er vår jobb som programmerere å prøve å sørge for at sammendraget er så nøyaktig som mulig og ikke misvisende.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-23": "Prosentandelen aktive sekunder føles definitivt som et mer nøyaktig sammendrag av hvor aktiv brukeren vår har vært totalt sett, men det betyr ikke at listen over aktive minutter ikke er nyttig. Det er et mer pessimistisk estimat av aktivitet, men det viser om noen ikke beveger seg mye.<br/><br/>La oss legge til noe som oppfordrer brukeren til å få litt mosjon hvis de ikke har beveget seg mye de siste 5 minuttene.<br/><br/>Legg til disse blokkene:<ul><li>Hvis [[length of [activeMinutes]] > [4]] så</li><ul><li>Sett [totalActiveMinutes] til [0]</li><li>Gjenta [5]</li><ul><li>Hvis [[item [minuteCounter] of [activeMinutes]] = [true]] så</li><ul><li>Endre [totalActiveMinutes] med [1]</li></ul><li>Endre [minuteCounter] med [-1]</li></ul><li>Hvis [[totalActiveMinutes] = [0]] så</li><ul><li>Kringkast [signalbruker]</li><li>Si [Du har ikke beveget seg mye de siste 5 minuttene]</li></ul></ul></ul><br/>Etter å ha lest ut hovedstatistikken, vil koden sjekke om det er registrert minst 5 minutter i <i>activeMinutes</i>-listen.<br/>Hvis det er det, vil den gå bakover gjennom de 5 siste minuttene i listen, og telle hvor mange av dem som var aktive minutter.<br/>Hvis ingen av dem var det, vil <i>signalbruker</i>-meldingen bli sendt, og spriten vil gi brukeren beskjed om at de ikke har beveget seg mye.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-24": "Bytt tilbake til Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-25": "Legg til disse blokkene:<ul><li>Når jeg mottar [signal fra bruker]</li><li>Gjenta [3]</li><ul><li>Sett LED-lysene for [ring] til [rød]</li><li>Spill tonen [A5] i [0,5] sekunder</li><li>Sett LED-lysene for [ring] til [hvit]</li><li>Vent [0,5] sekunder</li></ul><li>Slå av alle LED-lysene</li></ul><br/>Nå vil Cog også pipe og lyse for å gi brukeren beskjed om at de bør bevege seg mer.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-26": "Prøv det ut!<br/>Stikk cog i lommen og la koden kjøre mens du gjør noe annet arbeid eller morer deg – se hva den rapporterer.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-27": "Bra jobbet!<br/>Du har gjort Cog om til en aktivitetsmåler!<br/>Den måler hvor aktiv du er, og minner deg på å bevege deg hvis du står stille for lenge.<br/><br/>I virkeligheten er det absolutt greit å sitte stille i 5 minutter, men det er viktig å holde seg aktiv og bevege seg regelmessig.<br/><br/>Hvor mye av dagen synes du du bør være aktiv? Og hvor ofte?<br/><br/>Du lærte om hvordan du samler inn og analyserer data, og klassifiserer dem fra et stort sett med prøver til en enkel sann eller usann måling av aktivitet. For hvert minutt ble det tatt 600 målinger fra akselerometeret, og vi reduserte alt dette til ett enkelt notat om hvorvidt det minuttet var aktivt eller ikke.<br/><br/>Tenk på annen programvare og systemer som tar avgjørelser og klassifiseringer. Hvilke typer avgjørelser måtte programmererne ta da de designet dem, og hva kunne potensielt gå galt?<br/><br/><b>Neste trinn<ul><li>Tenk på om du ville endre noen av de ulike tersklene og andre variablene som styrer oppførselen til aktivitetsmåleren vår.</li><li>Tenk på hvilke andre sammendragsstatistikker du ønsker at aktivitetsmåleren din skal rapportere, og hvordan du kan beregne dem.</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.name": "ML-bevegelsesregistrering",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-1": "La oss bruke maskinlæring til å gjenkjenne spesifikke bevegelser med Cog!<br/><br/>Vi skal trene en modell til å gjenkjenne gester, og bruke disse som en del av et hukommelsesspill basert på læring av formler!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-2": "Klikk på fanen <i>Maskinlæring</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-3": "Velg <i>+</i>-ikonet og klikk på alternativet <i>Ny akselerometermodell</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-4": "Trykk på <i>Fortsett</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-5": "Dataene vi bruker til å trene denne modellen vil være de tre aksene til akselerometeret. <br/><br/> Du kan se disse dataene i sanntid på denne skjermen, akkurat som i sensordashbordet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-8": "Roter tannhjulet til en annen posisjon, hold det stødig og trykk deretter på knappen igjen i et par sekunder for å samle en ny prøve.<br/>Gjenta dette med forskjellige posisjoner til du har 10–20 prøver.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-10": "Denne gangen vil du ta opp eksempler på en langsom, sidelengs susende bevegelse.<br/>Flytt tannhjulet forsiktig frem og tilbake, og hold knappen nede for hver enkelt bevegelse – slipp taket når bevegelsen er ferdig.<br/>Bevegelsen du tar opp her vil forhåpentligvis bli gjenkjent senere og klassifisert som en susende lyd.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-12": "Lag nå en annen klasse som heter *flick*",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-13": "Dette blir en kort, skarp vippebevegelse.<br/>Igjen, ta opp eksempler ved å trykke knappen nede akkurat lenge nok til å fange opp én bevegelse.<br/>Prøv å få eksempler på forskjellige avslutningsposisjoner for å sørge for at det er representativt for bevegelsene du ønsker å oppdage senere.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-14": "Sørg for at du har minst 10 prøver igjen.<br/>Du vil sannsynligvis se at for <i>ingenting</i>-klassen er linjene på de individuelle prøvene ganske flate. I <i>swoosh</i> er det én som lager en stor kurve ned og opp.<br/>Og linjene for <i>flick</i> er mye mer taggete – hvis du så disse prøvene, ville du sannsynligvis kunne klassifisere dem i en av våre tre etiketter – <i>ingenting</i>, <i>swoosh</i> og <i>flick</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-16": "Du vil se en melding om et lastingstapplott, og deretter vil en graf vises.<br/>Tapsplottet viser hvor godt modellen gjør det fra trinn til trinn mens den gjentatte ganger prøver å klassifisere treningsdataene. Hver iterasjon av trening kalles en <i>epoke</i> – det er det som er på x-aksen i tapsplottet.<br/>En bratt nedadgående gradient i tapsplottet betyr at modellen endrer seg mye for hver epoke, og blir bedre til å klassifisere dataene.<br/>Treningen vil være ferdig når tapsnivået ikke endrer seg mye lenger.<br/>Et lavt tap betyr at den har vært i stand til å klassifisere mesteparten av treningsdataene vi ga den nøyaktig – så vi ønsker at den endelige tapsmengden skal være lav.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-17": "Trykk nå på <i>Kjør</i>-knappen for å prøve å kjøre modellen på nye data.<br/>Flytt deretter Cog rundt – prøv å gjøre de to bevegelsene du trente den på, og se om den kan gjenkjenne dem.<br/>De tre prosentsøylene representerer modellens konfidensnivå i klassifiseringen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-18": "Du kan oppleve at bevegelser noen ganger blir feilklassifisert – eller at det for eksempel er lett å få en *swoosh* feilaktig oppdaget rett før et *flipp*.<br/>For å fikse dette kan vi prøve å legge til flere treningsdata.<br/>Klikk på klassen du vil legge til prøver i, og registrer deretter flere.<br/>Hvis det er noen du tror du har rotet til, kan du klikke på de individuelle prøvene for å slette dem.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-20": "Modellen din vil være godt trent når hver deteksjon er tydelig og tydelig – som her hvor den går rett fra *ingenting* → *swoosh* og tilbake, og det samme for *ingenting* → *flikk* og tilbake.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-21": "Når du er helt fornøyd, klikker du på <i>Lagre</i>-knappen.<br/><b>Du vil ikke kunne gjøre noen endringer eller legge til flere eksempler i denne modellen etter at du har klikket på lagre.</b><br/>Det er fordi de opprinnelige treningsdataene ikke lenger er nødvendige og derfor forkastes.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-23": "Gå tilbake til <i>Kode</i>-fanen",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-24": "Gå til ML-kategorien",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-25": "Kryss av i boksen ved siden av blokken <i>akselerometeretikett</i>.<br/>Når vi starter klassifiseringen, vil det vise oss hva modellen oppdager.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-26": "Legg til disse blokkene:<ul><li>Når det klikkes på grønt flagg</li><li>Last inn maskinlæringsmodell [gesture]</li><li>Merk én gang hvert [1] sekund</li><li>Angi konfidensgrense [0,5]</li></ul><br/>Dette vil starte <i>gesture</i>-modellen som vi trente opp. Den vil oppdatere klassifiseringen av hvilken bevegelse den tror skjer hvert sekund.<br/><br/>Husker du at da vi testet modellen, så vi prosentvise søyler om hvor sikker den var på deteksjoner? <i>konfidensgrensen</i> setter en terskel for hvor sikker modellen må være før den gir en klassifisering.<br/>Vi lar den stå på 0,5 (eller 50 %) foreløpig, men vi må kanskje øke den senere hvis modellen gir falske klassifiseringer.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-27": "Prøv det ut!<br/>Trykk på det grønne flagget, så begynner modellen å løpe og klassifisere bevegelser.<br/>Prøv <i>swoosh</i>- og <i>flick</i>-bevegelsene dine, så skal du se at de blir oppdaget!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-28": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-29": "Prøv det ut!<br/>Når du gjør bevegelsene, vil tannhjulet lyse opp",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-30": "Ok, la oss lage et hukommelsesspill med bevegelsesdetektoren!<br/>Legg til en <i>hekse</i>-sprite og flytt den til nederste venstre hjørne.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-31": "Velg nå <i>Scene</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-32": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-34": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-35": "Velg bakgrunnen for <i>Slott 3</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-36": "Legg også til <i>Slott 2</i> og <i>Heksehuset</i>, slik at du har fire bakgrunner totalt.<br/>Gi den første nytt navn til <i>tittelskjermen</i>, slik at vi enkelt kan identifisere den.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-39": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-40": "Velg nå <i>Hekse</i>-spriten",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-41": "Vi må legge til noen instruksjoner i veiledningen.<br/><br/>Legg til disse blokkene:<ul><li>Når bakgrunnen bytter til [Slott 3]</li><li>Vent [2] sekunder</li><li>Si [Det er på tide å forlate slottet] i [2] sekunder</li><li>Si [Sveip tryllestaven for å transportere oss ut]</li></ul><p>Og</p><ul><li>Når bakgrunnen bytter til [Slott 2]</li><li>Vent [2] sekunder</li><li>Si [La oss gå hjem til meg for å øve på trolldom] i [2] sekunder</li><li>Si [Knips tryllestaven for å transportere oss dit]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-42": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-43": "Med Cog valgt, trykk på det grønne flagget for å kjøre koden!<br/>Du må gjøre en <i>swoosh</i> og et <i>flick</i> for å hjelpe heksa med å reise magisk fra slottet til skogen, og deretter fra skogen til huset sitt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-44": "Med heksa i huset sitt, la oss starte spillet ordentlig.<br/>Dette blir et hukommelsesspill, hvor heksa leser opp en rekke bevegelser, og spilleren må huske dem og gjøre dem i rekkefølge.<br/>Velg <i>Hekse</i>-spriten igjen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-45": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-46": "Lag en ny blokk kalt <i>lag en sekvens med [lengde]-bevegelser</i>.<br/>Du må bruke både alternativene <i>Legg til et inputnummer eller en tekst</i> og <i>Legg til en etikett</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-47": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-48": "Legg nå til blokken <i>lage en sekvens av [sequenceLength]-bevegelser</i>.<br/>Funksjonen «lage en sekvens» tar inn verdien av <i>sequenceLength</i>-variabelen som et argument for <i>length</i>-parameteren.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-49": "Legg til disse blokkene:<ul><li>Når jeg mottar [flikk]</li><li>Legg til [flikk] i [brukerinndata]</li></ul><p>Og</p><ul><li>Når jeg mottar [swoosh]</li><li>Legg til [swoosh] i [brukerinndata]</li></ul><br/>Du må lage en annen liste kalt <i>brukerinndata</i>.<br/>Det er her vi holder oversikt over bevegelsene spilleren har gjort, slik at vi kan sammenligne dem med de de skulle gjøre",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-50": "Legg til disse blokkene etter blokken <i>lag en sekvens av [sequenceLength]-bevegelser</i>:<ul><li>Si [Jeg skal lese opp noen bevegelser] i [2] sekunder</li><li>Si [Du må gjøre dem i samme rekkefølge] i [2] sekunder</li><li>Si [Klar?!] i [2] sekunder</li><li>Gjenta [10]<ul><li>Si [sekvens] i [2] sekunder</li></ul></li><li>Slett alle [brukerinndata]</li><li>Vent til [[lengde på [brukerinndata]] = [lengde på [sekvens]]]</li><li>Hvis [[brukerinndata] = [sekvens]], så<ul><li>Si [Bra gjort!] i [2] sekunder</li><li>Si [La oss gjøre det mer komplisert] i [2] sekunder</li><li>Endre [sequenceLength] med [1]</li><li>Lag en sekvens av [sequenceLength] gester</li></ul></li><li>Ellers<ul><li>Hvis [[liver] > [0]] så<ul><li>Si [Oops! Ikke helt] i [2] sekunder</li><li>Si [Prøv igjen…] i [2] sekunder</li><li>Endre [liver] med [-1]</li></ul></li><li>Ellers<ul><li>Avslutt spillet</li></ul></li></ul></li></ul><br/>Du må lage en ny blokk kalt <i>avslutt spillet</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-51": "Legg til disse blokkene for å definere funksjonen for å fullføre spillet:<ul><li>Definer [fullfør spillet]<ul><li>Si [Det er nok for nå. Bra gjort!] i [2] sekunder</li><li>Si [bli med [bli med [Du lærte en trylleformel med] [[sekvenslengde] - [1]]] [gester]] i [10] sekunder</li><li>Stopp [alle]</li></ul></li></ul><br/>Når spilleren går tom for liv, vil de få beskjed om poengsummen sin - hvor lang en sekvens av bevegelser de klarte å memorere og utføre",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-52": "Velg Cog igjen og prøv det ut!<br/>Du kan fortsatt gjøre spillet i fullskjermmodus før du starter det, for å gjøre det lettere å se hva heksa sier.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-53": "Bra jobbet!<br/>Du har lært om maskinlæring og <b>trent</b> en modell til å <b>klassifisere</b> gester fra bevegelsesdata.<br/>Du klarte å samle mange <b>eksempler</b> for å trene modellen og teste den før du lagret den og brukte den i koden din.<br/>Deretter brukte du funksjoner og lister for å lage et hukommelsesspill!<br/><br/><b>Neste trinn</b><br/>• Kan du legge til en tredje gest i spillet?<br/>• Eksperimenter med å justere maskinlæringsparametrene – konfidensgrensen og merkingsfrekvensen.<br/>• Lag en bedre avslutning på spillet hvis spilleren er i stand til å huske veldig lange sekvenser av bevegelser.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-2": "Tenk deg en variabel som en merket oppbevaringsboks. En variabel har tre deler: et navn, en type og en verdi.<br /><br /> <b/>Navnet</b> forteller oss <i/>«hva kaller vi denne boksen?»</i> <br /> <b/>Typen</b> forteller oss <i/>«hva slags ting oppbevarer vi i denne boksen?»</i><br /> <b/>Verdien</b> forteller oss <i/>«hva oppbevarer vi egentlig i boksen for øyeblikket?»</i> <br /><br /> I denne øvelsen skal vi lage og bruke en variabel kalt <b/>telleren min</b> for å hjelpe Marty med å telle til ti!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-3": "La oss først gjøre variabelen vår til <b/>min teller</b>.<br /><br />Velg «Lag en variabel» og kall den <b/>min teller</b>. Klikk på «ok» og se hvordan variabelen dukker opp i øvre venstre hjørne, med en gjeldende verdi på 0.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-4": "For å kode med <b/>my counter</b>-variabelen vår, kan vi dra den fra kategorien Variabler til skriptområdet.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-5": "La oss få Marty til å lese variabelen vår!<br /><br />Velg blokken «Marty speak», og erstatt «hello» med variabelen <b/>my counter</b> som vist nedenfor. Klikk på denne blokken, så skal du høre Marty si «zero».",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-6": "Hvis vi vil at Marty skal telle opp fra 0 til 10, må vi sette +1 på <b/>telleren min</b> hver gang vi ber Marty si et tall.<br /><br />I variabler kan vi velge blokken <b/>endre telleren min med 1</b>, som vil sette +1 på <b/>telleren min</b>.<br /><br />Plasser denne før «Marty snakker» som nedenfor. Klikk på disse blokkene og hør Marty si «en»!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-9": "La oss prøve en ekstra utfordring – hva om vi ville få Marty til å telle fra 0 til 10 bare ved å klikke på den grønne flaggknappen?<br /><br /> Vi ville trengt at Marty gjentok koden vår mange ganger til han når ti.<br /><br /> Vi kan kontrollere dette ved å bruke en <b/>repeat until</b>-blokk – plasser den eksisterende koden vår inni den slik:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-10": "Vi ønsker å gjenta denne prosessen til <b/>telleren min</b> blir mer enn 10.<br /><br /> Velg mer-enn-blokken. Plasser den i diamanten <b/>gjenta til</b>, og endre 50 til 10.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-12": "Tenk tilbake på trinn 8, vi vil sette <b/>telleren min</b> til null hver gang vi vil begynne å telle. <br /><br /> Dra <b/>sett telleren min til 0</b>-blokken og plasser den før repetisjonsblokken vår slik.<br /><br /> Nå vil Marty alltid starte fra 0.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-14": "Du klarte det! Nå vet du hvordan du bruker variabler, manipulerer dem og lager en <b/> ​​iterativ løkke </b> for å hjelpe Marty med å telle til ti!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.description": "Lær hvordan datamaskiner kontrollerer kode som skjer samtidig!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-2": "Parallelle programmer er separate kodebiter som vi ber en datamaskin om å kjøre samtidig.<br/><br/>Akkurat som mennesker, er det noen ting som datamaskiner, og Martys, ikke kan gjøre samtidig.<br/><br/>For eksempel, <b/>mennesker kan ikke gå fremover og bakover samtidig – og det kan ikke Marty heller!</b><br/><br/>Å prøve å gjøre dette skaper det vi kaller en <b/>kappløpstilstand</b>, der programmet vårt faktisk ikke kan kjøre all parallellkoden vår samtidig.<br/><br/>Dette kan føre til uforutsigbar oppførsel – dårlige nyheter for programmerere!<br/><br/><br/><i/>Klikk på bildet for å utvide diagrammet.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-3": "Så, hvordan tar programmerere tilbake kontrollen når kappløpsbetingelser dukker opp? <br/><br/> De bruker <b/>gjensidig utelukkelse</b> for å si ting som: <i/>ikke gå bakover før jeg går fremover først.</i> <br/><br/> Gjensidig utelukkelse kan implementeres ved hjelp av mange forskjellige metoder, for eksempel if-setninger, venteblokker, variabelkontroll og mye mer!<br/><br/><br/><i/>Klikk på bildet for å utvide diagrammet.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-5": "Plasser en <b/>gå 2 skritt frem</b>-kloss etter den grønne flaggblokken.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-6": "Velg en annen <b/>når grønt flagg klikket</b>-blokk og dra den inn i skriptområdet for å lage vår parallelle \"gå bakover\"-kode.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-8": "La du merke til at Marty gikk <b/>fremover først, og deretter bakover?</b> La oss undersøke hvorfor.<br/><br/>Først, slett all koden din slik at vi har et blankt ark.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-9": "Nå skal vi gjenskape den parallelle koden vår, men først skal vi <b/>gå bakover</b>-koden.<br/><br/> Gjenskap koden som vises på bildet nedenfor.<br/><br/><i/>Hvis du trenger hjelp, kan du bare hoppe tilbake til trinn 6 og 7!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-10": "La oss nå gjenskape <b/>gå fremover</b>-koden vår også. Parallellkoden din skal se slik ut: <br/><br/><i/>Hvis du trenger hjelp, kan du bare gå tilbake til trinn 4 og 5!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-12": "Som vi lærte tidligere, omgår programmerere kappløpsbetingelser ved å bruke gjensidig utelukkelse. <br/><br/>Dette betyr at vi kan trykke på «gå» på begge kodedelene samtidig, men vi kan kontrollere hvilken handling <b/>som faktisk</b> skjer først. <br/><br/>Først bruker vi en venteblokk for å gjensidig utelukke koden vår. <br/><br/><br/><i/>Klikk på bildet for å utvide diagrammet.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-16": "Lag en variabel kalt neste trekk. Vi bruker denne til å kontrollere hvilket trekk Marty gjør neste gang.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-17": "Fjern venteblokken vi la til tidligere, slik at koden din samsvarer med eksemplet nedenfor. <br/><br/>Nå er du klar til å implementere variabelkontroll!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-18": "I stedet for å vente et visst antall sekunder før han går, vil vi at Marty skal <b/>vente til</b> neste trekk er satt til riktig verdi: fremover eller bakover. <br/><br/>Legg til en vent til-blokk før hver gåblokk, som vist her:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-19": "Vi vil at Marty skal <b/>vente til</b> neste trekk=forover eller neste trekk=bakover for å utføre det relevante trekket. <br/><br/>Velg to <b/>likhetsoperatorer</b>, og fyll dem ut som vist nedenfor. <br/><br/>Du kan få to neste trekk-blokker fra den oransje Variabler-fanen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-20": "Bruk nå de grønne «lik»-blokkene til å fylle ut de tomme <b/>vent til</b>-blokkene, slik at de samsvarer med eksempelkoden nedenfor:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-21": "Hvis vi vil at Marty skal gå fremover først, bør han gå bakover deretter, og omvendt.<br/><br/>Så vi vil bruke den angitte <b/>neste trekk</b>-blokken for å endre neste trekk etter at vi har gått.<br/><br/>Plasser to av disse blokkene på slutten av hver kodebit, og skriv «fremover» eller «bakover» i hver av dem, slik at de samsvarer med eksempelkoden nedenfor:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-22": "Til slutt velger du en <b/>set next move to</b>-blokk for å angi om Marty skal gå fremover eller bakover først.<br/><br/> La oss si at vi vil at Marty skal gå bakover først – skriv «backwards» i parameterrommet og klikk på blokken slik at next move settes til bakover.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-23": "Du klarte det! Du kan nå bruke <b/>variabel kontroll</b> og ventefunksjoner for å gjensidig ekskludere parallellkode!<br/> Klikk på det grønne flagget og se parallellkoden din fungere sammen.<br/><br/>Begge kodeblokkene kjører samtidig, men variabelen «neste trekk» sørger for at vi alltid vet hva som skjer videre!<br/><br/><i/>For en ekstra utfordring, hvorfor ikke prøve å endre neste trekk til «fremover» (eller til og med noe tilfeldig som «banan») og se hvordan Marty går nå ...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.description": "La oss bruke parallellprogrammering med variabel kontroll for å hjelpe Marty med å vise frem alle de morsomme ansiktene sine!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-1": "Nå som vi er eksperter på variabelkontroll av parallelle programmer, la oss sette lærdommen vår ut i praksis ved å hjelpe Marty med å vise frem alle de morsomme ansiktene sine!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-2": "Velg to blokker med grønt flagg.<br/><br/>Når du klikker på det grønne flagget, aktiveres begge blokkene og kjører all koden under dem samtidig, parallelt.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-4": "La oss plassere den første lydblokken vår under en av de grønne flaggblokkene.<br/><br/>Bruk rullegardinmenyen til å velge «Vantro», slik at den passer til Martys overraskede ansikt!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-5": "La oss nå plassere den andre lydblokken. <br/><br/>Bruk rullegardinmenyen til å velge «Nei!», slik at den passer til Martys gretne ansikt!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-7": "La oss nå skrive litt kode for å kontrollere Martys uttrykk under den andre grønne flaggblokken. Vi vil at koden vår skal si: <br/><br/><i/>Da det grønne flagget klikket <br/>Øyne vidåpne <br/>Øyne sinte <br/>Øyne opphisset</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-9": "La oss nå plassere den andre øyeblokken. <br/><br/>Bruk rullegardinmenyen til å velge «sint» for å vise frem Martys sinte ansikt!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-10": "La oss nå plassere den siste øyeblokken. <br/><br/>Bruk rullegardinmenyen til å velge «Spent» for å vise frem Martys spente ansikt!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-11": "La oss teste koden vår. <br/><br/>Trykk på den grønne flaggblokken og se om Martys uttrykk stemmer overens med riktig lyd... <br/><br/>Stemmer de overens? <b/>nei!</b> <br/><br/>Dette er fordi lydene og uttrykkene tar <b/>ulik tid.</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-12": "I den forrige veiledningen brukte vi variabler for <b/>gjensidig ekskludering</b>, for å sørge for at to ting <b/>ikke</b> skjedde samtidig. <br/><br/>I denne veiledningen skal vi bruke variabler til å <b/>synkronisere</b> den parallelle koden vår, og sørge for at de riktige tingene <b/> ​​skjer samtidig</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-14": "I Variabler, velg en <b/>set Marty feels to 0</b>-blokk og plasser den før den første lydblokken som vist. <br/><br/>Fyll inn 0 med «overrasket».",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-15": "Velg en annen <b/>sett Marty føler seg til 0</b>-blokk og plasser den før den andre lydblokken som vist. <br/><br/>Fyll inn 0 med «sint».",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-16": "Velg en siste <b/>sett Marty føler seg til 0</b>-blokk og plasser den før den siste lydblokken som vist. <br/><br/>Fyll inn 0 med «spent».",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-18": "Vi vil at Marty skal <b/>vente til</b> Marty føler seg = overrasket for å åpne øynene, for eksempel <br/><br/>Velg tre likhetsoperatorer, og fyll dem ut som vist nedenfor. <br/>Du kan få tre <b/>Marty føler</b>-blokker fra den oransje Variabler-fanen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-20": "Du klarte det – kjempebra!<br/>Klikk nå på det grønne flagget og se koden din jobbe parallelt!<br/><br/>Hvert uttrykk og hver lyd samsvarer mens vi bruker <b/>variabel kontroll for å synkronisere</b> Martys morsomme ansikter!. <br/><i/>Marty er overrasket! <br/>Marty er sint! <br/>Marty er spent! </i> <br/><br/>Ekstra utfordring – hvor mange morsomme ansikter kan du få Marty til å tegne ved hjelp av variabel kontroll?",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.description": "La oss gjenskape unplugged-modus ved å bruke alt vi har lært så langt! If-setninger, løkker, parallellkode, operatorblokker og mer ...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-1": "I denne veiledningen skal vi gjenskape frakoblet modus ved å bruke alt vi har lært så langt!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-3": "La oss komme i gang!<br/><br/>Vi skal lage 5 parallelle programmer for å kontrollere hver farge i frakoblet modus:<br/><b/>grønn</b> betyr å gå <b/>fremover</b>, <br/><b/>gul</b> betyr å gå <b/>bakover</b>, <br/><b/>lilla</b> betyr å skyve <b/>høyre</b>, <br/><b/>blå</b> betyr å skyve <b/>venstre</b>, <br/><b/>rød</b> betyr <b/>stopp og feir!</b>,",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-4": "Først plasserer du 5 grønne flaggklosser i skriptområdet, én for hver fargeflis i unplugged.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-5": "Vi vil ikke at Marty skal sjekke fargesensoren sin bare én gang, vi vil at han skal sjekke om og om igjen for å gjøre den riktige handlingen. <br/><br/>Så la oss plassere en evig løkke under hver grønn flaggblokk.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-6": "For hver kodeblokk ønsker vi å si:<br/><br/><i/><b/>Hvis</b> Marty registrerer fargen grønn/blå/rød/lilla/gul, <b/>så</b> utfør den relevante handlingen.</i><br/><br/>Så la oss plassere en if-setning i hver forever-løkke.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-7": "I hver kodeblokk ønsker vi å sjekke om for eksempel <b/>fargesensor = grønn</b> før vi ber Marty gå fremover. <br/><br/> For å gjøre dette, plasserer vi en likhetsoperator i hver if-setning, og fyller dem ut med én unplugged-farge hver. <br/><br/>Koden din skal se slik ut:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-9": "Flott! Nå vil vi at Marty skal <b/>gjenta</b> den riktige handlingen <b/>til</b> han er på et annet kort. <br/><br/>For å gjøre dette bruker vi en <b/>repeat until</b>-blokk.<br/><br/>Plasser én i hver if-setning som vist her:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-10": "For å fylle ut repetisjonsblokken, vil vi si: <br/><br/><i/>gjenta til <b/>Not</b> fargesensor = grønn</i>, for eksempel. <br/><br/>Legg til en not-operator i hver kodeblokk som vist nedenfor:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-11": "For å fylle ut hver ikke-operator, ønsker vi i hovedsak å kopiere det som står i hvis-setningen, som vist nedenfor. <br/><br/>Vi ender opp med kode som sier <i/>gjenta til <b/>Ikke</b> fargesensor = grønn</i> og så videre. <br/><br/>Du kan gjøre dette raskt ved å venstreklikke på den grønne lik-blokken i hvis-setningen, klikke på dupliser og dra den ned i <b/>ikke</b>-operatoren. <br/><br/><br/><i/>Alternativt kan du gå tilbake til trinn 7 og 8 for å gi deg et hint om hvordan du fyller dem ut riktig!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-12": "Bra jobbet! La oss nå plassere riktig handling i hver kodeblokk. <br/><br/>Inne i kodeblokken som registrerer grønt, plasser <b/>gå to skritt fremover</b> inne i gjenta til-blokken, som vist her:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-14": "Inne i kodeblokken som oppdager blått, plasser <b/>slide 1 gang til venstre</b> inne i gjentakelsesblokken, som vist her.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-19": "Det er to ting til vi må gjøre hvis vi vil gjenskape frakoblet modus på riktig måte. <br/><br/>Når Marty registrerer en ny farge, endrer han LED-lysene på øyet til den fargen og lager en «pip pip!»-lyd. <br/><br/>La oss sette dette inn i koden vår!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-20": "Plasser en <b/>set Select LED eyes to</b>-blokk <b/>inne i if-setningen, men over repeat until-blokken</b> i hver kodedel. <br/><br/>Endre LED-fargen til den relevante fargen for den blokken, og sørg for å bruke rullegardinlisten til å velge <b/>begge øynene</b>. <br/><br/>Koden din skal se slik ut:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-22": "Plasser en <b/>Startlyd: Arcade Beep</b>-blokk etter hver LED-øyeblokk og før hver gjentakelsesblokk. <br/><br/>Koden din skal se slik ut:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-23": "Du klarte det! Fantastisk!<br/><br/>Du har brukt parallelle programmer, variabler, operatorer, sensorer, løkker og mer for å gjenskape frakoblet modus helt selv!<br/><br/><i/>For en ekstra utfordring – hva annet kan du få Marty til å gjøre når han ser hver farge?",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-2": "Så, når det gjelder programmering, <b/>hva er en liste?</b> <br/><br/>Programmerere bruker lister, noen ganger kalt matriser, for å lagre data i en bestemt rekkefølge. <br/><br/>Programmerere kan kontrollere hvordan data legges til, fjernes og lagres i listen, samt omtale data etter nummeret i listen (kalt en indeks).",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-3": "For eksempel, i denne listen kan vi si: <br/><br/><i/>fjern person nummer 2</i>, i stedet for <i/>fjern Marty</i>. <br/><br/><i/>bytt person nummer 3 og nummer 4</i>, i stedet for <i/>bytt Sam og Kirsty</i>. <br/><br/>Lister hjelper programmerere med å kontrollere og lagre informasjon enkelt, selv når den endres.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-7": "Velg en fargesensorblokk og plasser den i <b/>legg til ting i farger</b>-blokken. <br/><br/> Nå sier koden vår: <i/>uansett hvilken farge Marty registrerer, legg denne til i listen «farger».</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-8": "Etter at vi har lagt til en farge i fargelisten vår, vil vi at Marty skal gå nok skritt til å nå neste rute. <br/><br/>Plasser en <b/>gå fremover</b>-kloss som vist, og endre <b/>2</b> til en <b/>7</b>. <br/><br/></i>Vi synes 7 skritt er nok til å gå fra en frakoblet rute til den neste, men du kan prøve dette nå og endre om nødvendig!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-9": "Før Marty sjekker fargesensoren sin, bør vi be ham om å pause for å få en nøyaktig avlesning. Legg til en <b/>pausebevegelse</b>-blokk som vist nedenfor:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-11": "La oss nå få Marty til å bruke LED-øynene sine til å fortelle oss hvilke farger han har sett. <br/><br/>Velg 4 <b/>Angi valgte LED-øyne til</b> blokker og plasser dem etter repetisjonsløkken. <br/><br/>Bruk rullegardinmenyen til å velge <b/>begge øynene</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-13": "Nesten ferdig! <br/><br/>Legg til en <b/>vent 1 sekund</b>-blokk før hver LED-blokk som nedenfor, for å gi nok tid til hvert fargeskifte.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-2": "Først av alt, la oss lage listen vår. <br/><br/> Naviger til Variabler-fanen og klikk på «Lag en liste». <br/><br/>Kall listen «farger» og klikk på «ok».",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-3": "Det første Marty må kjøpe er batterier. <br/><br/>Velg blokken <b/>legg til ting på Martys handleliste</b>. <br/><br/>I stedet for <b/>ting</b>, skriv <b/>batterier</b>. Klikk på blokken og se batterier vises på listen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-4": "Det neste Marty trenger er ledninger!<br/><br/>Behold den samme klossen som før, bytt <b/>batterier</b> til <b/>ledninger</b> og klikk på klossen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-5": "Marty trenger også muttere og bolter! <br/><br/>Bruk den samme blokken til å legge til muttere og bolter på listen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-8": "Vi skal skrive denne koden som vi kan bruke for enhver liste! <br/><br/>Uansett hvordan vi endrer listen, kan Marty fortsatt lese listen høyt med denne koden! <br/><br/>Denne repetisjonsløkken er spesiell - programmerere kaller dem <b/>iterative løkker</b> <br/><br/>Iterasjon betyr å gjenta den samme oppgaven, og endre noe hver gang til en betingelse er oppfylt. <br/><br/>Her kan du se den <b/>gjentatte oppgaven</b>, <b/>betingelsen</b> og den <b/>gjentatte endringen</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-9": "For å starte den iterative løkken vår, velg en gjentakelse til-blokk.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-10": "La oss lage variabelen <b/>varenummer</b> som vi skal bruke til å gå gjennom Martys handleliste. <br/><br/>Gå til variabelfanen, velg Lag en variabel, kall den <b/>varenummer</b> og klikk på «ok».",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-12": "Vi vil ikke at Marty skal si hei, vi vil at han skal lese opp en vare fra listen. <br/><br/>Gå til Variabler-fanen, velg <b/>vare 1 i Martys handleliste</b>-blokken og plasser den som vist. <br/><br/>Erstatt tallet 1 med variabelen <b/>varenummer</b>. <br/><br/>Bra jobbet! Hvis varenummer er 3, ville Marty sagt «ledninger».",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-13": "La oss nå legge til den gjentatte endringen i løkken vår.<br/><br/>I hver løkke ønsker vi å legge til én til <b/>varenummer</b>-variabelen.<br/><br/>Plasser <b/>endringsvarenummeret 1</b>-blokken etter leseblokken som vist:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-15": "Naviger til Variabler-fanen og fyll ut større enn-blokken som vist, slik at det står: <br/><br/><i/>gjenta til: varenummeret er større enn Martys handleliste</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-16": "Du klarte det! <br/><br/>Før vi tester koden vår, sørg for at variabelen for varenummer er satt til null – hvis ikke, kan du tilbakestille den ved hjelp av denne blokken.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-17": "Loading...",
  "gui.menuBar.sensorsDashboard": "Sensorer Dashboard",
  "gui.menuBar.showCode": "Loading...",
  "gui.gui.toggleMartyMachineTab": "Maskinlæring",
  "gui.gui.toggleSaveLoadTab": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.name": "Cog og Marty-interaksjon",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.description": "Lær hvordan <b>Cog</b> og <b>Marty</b> kan samhandle med hverandre",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1.1": "Flott! Klikk nå på «koble til»-knappen for å koble til Cog",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2.1": "Flott! Klikk nå på «koble til»-knappen for å koble til Marty.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3": "Når du har valgt Cog-blokkene, drar du hendelsesblokken «ved knappetrykk» til skriptområdet. Denne blokken vil lytte etter når Cog-knappen klikkes.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3.hint": "Hendelsesblokken «ved klikk» er under Hendelseskategorien. Dra den til skriptområdet for å starte kodingen.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5": "Dra nå blokken «kringkast melding» fra kategorien Hendelser til skriptområdet. Denne blokken vil kringkaste en melding når Cog-knappen trykkes.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5.hint": "Blokken «kringkastingsmelding» er under kategorien Hendelser. Dra den til skriptområdet for å starte kodingen.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-6": "La oss nå gå videre til Marty. Vi må velge Marty for å se Marty-blokkene. Klikk på Marty-enhetsknappen.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-9": "Vi er nesten der! Dra «Dans!»-blokken til skriptområdet. Denne blokken vil få Marty til å danse når meldingen mottas.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-10": "Bra jobbet! Du har nå kodet Cog og Marty slik at de kan samhandle med hverandre. Klikk nå på Cogs knapp for å se Marty danse!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.name": "Introduksjon til tannhjullys og -lyder",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.description": "Lær hvordan du programmerer Cog med blokker, og lager lyder og lys som utløses ved å samhandle med Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-2": "La oss først koble til Cog. Klikk på knappen «Koble til en enhet» og velg deretter Cog. <br /><br /> Du kan hoppe over dette trinnet hvis en Cog allerede er koblet til.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-3": "Flott! Klikk nå på «koble til»-knappen for å koble til Cog.<br /><br>Du kan hoppe over dette hvis du allerede er koblet til en Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-4": "Fantastisk! Du skal nå ha lagt til ett tannhjul, og det skal være koblet til tannhjulet ditt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-5": "Velg kategorien Hendelser",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6.hint": "Hendelsesblokken «ved knappetrykk» er under Hendelseskategorien. Dra den til skriptområdet for å starte kodingen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8": "Legg til en <b>Angi [ring]-LED-er til [farge]</b>-blokk ved å dra den for å koble den til På-knapp-trykk-blokken",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8.hint": "Blokken «sett [ring]-LED-er til [farge]» ligger under kategorien Utseende. Dra den til skriptområdet og koble den til blokken Ved knapptrykk",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-9": "Prøv det ut! <br /><br />Trykk på knappen på Cog, så skal lysene tennes!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13": "Legg til en <b>Slå av LED-lys</b>-blokk under Ved risting-blokken",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-15": "Endre blokken <b>Angi [ring]-LED-er til [farge]</b> for å kontrollere knapp-LED-en i stedet, ved å velge «knapp» fra rullegardinmenyen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-16": "Prøv det ut! <br /><br />Trykk på knappen på Cog, og nå skal lyset i knappen tennes!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-17": "Rist på tannhjulet for å slå av LED-lysene.<br /><br />Endre nå den samme rullegardinmenyen for å velge «alle» i stedet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-18": "Prøv det ut! <br /><br />Trykk på knappen på Cog, så skal alle lysene slå seg på!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19": "Legg til en <b>Angi [ring]-LED-er til mønster [Blink]</b>-blokk under Angi LED-fargeblokken",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-20": "Prøv det ut! <br /><br />Trykk på knappen på Cog, og nå skal LED-ringen begynne å blinke!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-21": "Endre mønsteret til «Spin1» og prøv det ut!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23": "Legg til en annen <b>Sett [ring] LED-er til mønster [Blink]</b>-blokk under den forrige, og endre den slik at den setter knappen til å blinke.<br /><br />Prøv det ved å trykke på knappen på Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-24": "Slett koden under «On Button Press»-blokken ved å dra den tilbake til blokkpaletten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25": "Legg til en <b>Angi LED-er ved hjelp av ColorPicker</b>-blokk som er koblet til På-knapp-trykk-blokken",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-26": "Endre de individuelle LED-fargene ved hjelp av fargevelgeren.<br /><br />Velg først en farge ved hjelp av fargehjulet og glidebryterne for metning og lysstyrke, og velg deretter LED-ene du vil sette til den fargen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27": "Angi også knappfargen ved å legge til en <b>Sett [ring] LEDs til [farge]</b>-blokk og endre den for å angi knappen til favorittfargen din.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-28": "Prøv det ut! Trykk på knappen, så endres lysene til fargene du har valgt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31": "Legg til en annen <b>Angi LED-er ved hjelp av ColorPicker</b>-blokk under venteblokken, og endre deretter fargene til det du velger",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31.hint": "Blokken «Angi LED-lys ved hjelp av fargevelgeren» ligger under kategorien Utseende. Dra den til skriptområdet og koble den til venteblokken du nettopp la til, og endre deretter fargene.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-33": "Prøv det ut! Trykk på knappen, så slås lysene på, og endres deretter etter 1 sekund!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34": "Legg til en annen <b>Ved knappetrykk</b>-blokk",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34.hint": "Hendelsesblokken «ved knappetrykk» er under Hendelseskategorien. Dra den til skriptområdet for å starte kodingen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-35": "Velg lydkategorien",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36.hint": "Blokken «Spill note [C4] i [1] sekunder» er under kategorien Lyd. Dra den til skriptområdet og koble den til den nye Ved knappetrykk-blokken du la til i forrige trinn.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38": "Legg til en <b>Spill tone fra [200] til [300] Hz i [3] sekunder</b>-blokk mellom På-knapp-trykk-blokken og Spill note-blokken",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38.hint": "Blokken «Spill tone fra [200] til [300] Hz i [3] sekunder» er under kategorien Lyd. Dra den til skriptområdet og koble den mellom blokken Ved knappetrykk og avspillingsnoten du la til i forrige trinn.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-39": "Endre tallene i Spill Tone-blokken for å gå fra 260 til 523 Hz i 1 sekund.<br /><br />Hver musikalsk tone har en frekvens, og 523 Hz er frekvensen til C5 - C i den femte oktaven.<br /><br />Prøv det ut ved å trykke på knappen på Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-40": "Når du trykker på knappen, skjer lydene og lysene samtidig – vi sier at de kjører parallelt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-41": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-42": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.description": "Vi gjør Cog om til en terning, som viser et ulikt antall lys hver gang du rister på den!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-1": "La oss programmere Cog til å være noe nyttig – en terning!<br /><br />Vi skal få cog til å reagere på å bli ristet ved å vise et tilfeldig antall lys og lage samme antall pipelyder.<br /><br />For å gjøre det skal vi lære om <b>Variabler</b> – spesielle blokker som kan <i>variere</i> eller endre verdi, og <b>Betingelser</b> – blokker som tar en avgjørelse!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-2": "Først må du sørge for at du er koblet til et tannhjul.<br /><br />Hvis ikke, legg til et slik du gjorde i forrige veiledning ved å trykke på Legg til-knappen i enhetspanelet og velge et tannhjul, og deretter klikke på koble til. Hvis du trenger det, kan du hoppe tilbake til forrige veiledning for å se hvordan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-3": "Legg til en <b>Ved risting</b>-hendelsesblokk fra <b>Hendelser</b>-kategorien",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-5": "Klikk på knappen <b>Opprett en variabel</b><br /><br />Angi det nye variabelnavnet til <b>ledID</b> og trykk OK",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7": "Legg til en <b>gjentakelsesblokk</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8": "Gå til kategorien <b>Utseende</b> og legg til en <b>Sett LED [1] til [farge]</b>-blokk inni gjentakelsesblokken.<br /><br />Endre fargen til favorittfargen din :-)",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-9": "Prøv det ut! <br /><br />Hva skjer hvis du rister på tannhjulet?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10": "Gå tilbake til kategorien <b>Variabler</b> og legg til en <b>Endre [ledID] med [1]</b>-blokk rett etter LED-blokken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-11": "Dra <b>ledID-variabelen</b> over i <b>Set LED</b>-blokken, slik at den viser <b>Set LED <i>ledID</i> til [farge]</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-12": "Prøv det ut!<br /><br />Hva skjer hvis du rister på Cog?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-13": "Prøv igjen – flere LED-lamper vil slå seg på!<br /><br />Men hvis du rister på tannhjulet <i>igjen</i> etter det, skjer det ingenting nytt. La oss endre på det!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14.hint": "Blokken «Sett [ledID] til [0]» er i kategorien Variabler. Dra den til skriptområdet og plasser den slik at den klikker rett etter blokken «Ved risting», før gjentakelsesblokken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15": "Legg også til en <b>Slå av alle LED-lys</b>-blokk fra <b>Utseende</b>-kategorien.<br /><br />Legg den til rett før gjentakelsesblokken, etter <i>sett [ledID] til [0]</i>-blokken du nettopp la til.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15.hint": "Blokken «Slå av alle LED-lys» er i kategorien Utseende.<br /><Br />Sørg for at du legger den til mellom blokken «sett [ledID] til [0]» og blokken «gjenta».",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-17": "Gå til kategorien <b>Operatører</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-18": "Dra blokken <b>velg tilfeldig [1] til [10]</b> for å erstatte tallet i repetisjonsblokken.<br /><br />Nå vil repetisjonsblokken gå i løkke et tilfeldig antall ganger fra 1 til 10, og endre seg hver gang!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-20": "Prøv det ut! <br /><br />Nå får du et ulikt antall lys hver gang du rister på Cog.<br /><Br />Du har programmert Cog til å være en terning!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-21": "<i>ledID</i> er en <b>variabel</b> – den har en verdi som kan endres eller <i>varieres</i><br /><br />I denne koden teller den opp for å slå på en annen LED hver gang gjennom løkken!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22": "La oss også legge til litt lydfeedback.<br /><Br />Gå til kategorien <b>Lyder</b> og legg til en <b>Spill note [C4] i [1] sekunder</b>-blokk.<br /><br />Endre den til å spille noten i <b>0,1 sekunder</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23.hint": "Blokken «Vent [1] sekunder» er i kontrollkategorien. Legg den til i koden ved å dra den inn i repetisjonsløkken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-24": "Prøv det ut!<br /><Br />Nå hører du også et antall pip som samsvarer med antallet lys!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-26": "Gå til kategorien <b>Operatører</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27.hint": "'='-blokken er under Operatorer-kategorien. Dra den til den samsvarende formen i if-blokken.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-28": "Gå tilbake til kategorien <b>Variabler</b> og dra <b>ledID-variabelen</b> inn i den <b>første boksen i likhetsblokken</b><br /><br />Deretter <b>setter du den andre boksen til 13</b>, slik at hele linjen viser <b>hvis ledID = 13 så</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30": "La oss legge til noe i <b>if</b>-blokken!<br /><br />Gå til <b>sounds</b>-kategorien og legg til en <b>Play tune</b>-blokk",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30.hint": "«Spill melodi»-blokken er i kategorien Lyder. Legg den til i koden ved å dra den slik at den kobler seg til if-betingelsen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-31": "Endre melodien til <b>plystre</b> fra rullegardinmenyen",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32": "Legg også til noen lyseffekter fra utseendemenyen<br /><br />For eksempel kan vi få ringen og knappens LED-lys til å vise et mønster",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-33": "Prøv det ut!<br /><br />Se om du kan kaste en 13 på terningen ved å riste på tannhjulet!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-42": "Bra jobbet!<br /><br />Du har lært at en <b>variabel</b> er noe som kan endres i <b>verdi</b>. Vi kan bruke dem til å få koden vår til å gjøre forskjellige ting uten å måtte endre koden.<br /><br />Vi lærte om <b>if</b>-blokker – disse kan brukes til å få kode til å bare kjøre hvis en viss <b>betingelse</b> er oppfylt.<br /><br />Og vi lærte hvordan vi bruker en repetisjons-<b>løkke</b> til å gjøre noe mange ganger – i dette tilfellet slå på en annen LED hver gang.",
  "gui.spriteSelector.sprites": "SPRITES",
  "gui.deviceSelector.devices": "ENHETER",
  "gui.spriteSelector.addSpriteFromLibrary": "Velg en sprite",
  "gui.spriteSelector.addSpriteFromPaint": "Loading...",
  "gui.spriteSelector.addSpriteFromSurprise": "Overraskelse",
  "gui.spriteSelector.addSpriteFromFile": "Last opp Sprite",
  "gui.deviceSelector.addDeviceByConnecting": "Koble til en enhet",
  "gui.deviceSelector.addDeviceFromLibrary": "Loading...",
  "gui.spriteSelector.noSpritesInUse": "Ingen sprites i bruk",
  "gui.deviceSelector.noDevicesInUse": "Legg til en enhet",
  "gui.saveLoad.localStorageTitle": "I appen",
  "gui.saveLoad.localStorageSubtitle": "Lokal lagring",
  "gui.saveLoad.cloudStorageTitle": "I skyen",
  "gui.saveLoad.cloudStorageSubtitle": "Skylagring",
  "gui.saveLoad.portableFileStorageTitle": "Bærbar",
  "gui.saveLoad.portableFileStorageSubtitle": "Fillagring",
  "gui.saveLoad.createNewSaveFile": "Opprett en ny lagringsfil:",
  "gui.saveLoad.savedFilesTitle": "Dine lagrede filer:",
  "gui.saveLoad.deleteFile": "Slett",
  "gui.saveLoad.loadFile": "Laste",
  "gui.saveLoad.saveFile": "Loading...",
  "gui.saveLoad.saveFileNamePlaceholder": "Skriv inn navnet du vil gi den nye lagringsfilen her ...",
  "gui.saveLoad.fileLoadError": "Kunne ikke laste inn prosjektet.",
  "gui.saveLoad.fileSaveError": "Kunne ikke lagre prosjektet.",
  "gui.saveLoad.overwriteFile": "Loading...",
  "gui.saveLoad.copyToClipboard": "Kopier til utklippstavlen",
  "gui.saveLoad.copied": "Kopiert!",
  "gui.saveLoad.saveProject": "Loading...",
  "gui.saveLoad.projectSaved": "Prosjektet er lagret!",
  "gui.saveLoad.projectSaveFailed": "Kunne ikke lagre prosjektet",
  "gui.saveLoad.projectLoaded": "Prosjektet er lastet inn!",
  "gui.saveLoad.projectLoadFailed": "Kunne ikke laste inn prosjektet",
  "gui.saveLoad.loadProjectPlaceholder": "Loading...",
  "gui.saveLoad.createNewCloudSave": "Opprett en ny skylagringsfil:",
  "gui.saveLoad.saveFileCode": "Din automatisk genererte lagringsfilkode er:",
  "gui.saveLoad.saveFilePlaceholder": "Din automatisk genererte lagringsfilkode er:",
  "gui.saveLoad.loadProjectTitle": "Last inn prosjekt",
  "gui.saveLoad.tipsTitle": "Tips for lagring i skyen:",
  "gui.saveLoad.tips1": "Sørg for å skrive ned eller registrere den automatisk genererte koden som oppgis hver gang du lagrer en ny fil. Du trenger denne for å laste den inn senere.",
  "gui.saveLoad.tips2": "Selv om Marty the Robot-appen fortsetter å lagre filer automatisk på det lokale lagringsområdet, finnes det ingen automatisk lagringsfunksjon for skylagring av filer. Lagre filen manuelt på nytt hver gang du ønsker at den skal være tilgjengelig for nedlasting via skylagring.",
  "gui.saveLoad.tips3": "Loading...",
  "gui.saveLoad.saveToFile": "Loading...",
  "gui.saveLoad.loadFromFile": "Last inn fra fil",
  "gui.saveLoad.fileSaved": "Fil lagret!",
  "gui.martyMachineModelEditor.model": "Modellnavn",
  "gui.martyMachineModelEditor.className": "Samle inn data for",
  "gui.martyMachineModelEditor.createNewClass": "Loading...",
  "gui.martyMachineModelEditor.samples": "Prøver",
  "gui.MartyMachineModelEditor.record": "Registrer data",
  "gui.MartyMachineModelEditor.stop": "Stoppe",
  "gui.MartyMachineModelEditor.train": "Tog",
  "gui.MartyMachineModelEditor.run": "Løp",
  "gui.MartyMachineModelEditor.save": "Loading...",
  "gui.MartyMachineModelEditor.saving": "Loading...",
  "gui.martyMachineTab.addNew": "Legg til ny modell",
  "gui.martyMachineTab.newImageModelMarty": "Ny bildemodell (Marty)",
  "gui.martyMachineTab.newImageModelDevice": "Ny bildemodell (enhet)",
  "gui.martyMachineTab.newAccelerometerModel": "Ny akselerometermodell",
  "gui.martyMachineTab.newAudioModel": "Ny lydmodell",
  "gui.martyMachineTab.loadTMModel": "Last inn TM-modell",
  "gui.martyMachineTab.tutorials": "Veiledninger",
  "gui.martyMachineTab.alertSelectDevice": "Ups! Vennligst velg en Marty- eller Cog-enhet for å bruke akselerometermodellen.",
  "gui.martyMachineTab.alertConnectDevice": "Ups! Koble til enheten for å bruke akselerometermodellen.",
  "gui.martyMachineTab.alertModelNameExists": "Modellnavnet finnes allerede. Vennligst velg et annet navn.",
  "martyMachine.modelNameExists": "Ups! Modellnavnet finnes allerede. Vennligst velg et annet navn.",
  "martyMachine.backgroundNoiseClassNeedsSamples": "Ups! Bakgrunnsstøyklassen trenger minst 10 prøver for å kunne trenes. Legg til flere prøver i bakgrunnsstøyklassen.",
  "martyMachine.classNameExists": "Ups! Klassenavnet finnes allerede. Vennligst velg et annet navn.",
  "martyMachine.selectClassAlert": "Vennligst legg til eller velg en eksisterende klasse før du spiller inn prøver.",
  "gui.MartyMachineNewModelConfirmationModal.label": "Ulagrede endringer vil gå tapt.",
  "gui.MartyMachineNewModelConfirmationModal.headsUp": "Bare en liten advarsel! Hvis du har gjort endringer i den nåværende modellen, vil de ikke bli lagret. Kan du fortsette?",
  "gui.MartyMachineNewModelConfirmationModal.close": "Loading...",
  "gui.MartyMachineNewModelConfirmationModal.continue": "Fortsette",
  "gui.TfVisChart.loadingTitle": "Laster inn tapsplott",
  "gui.TfVisChart.loadingSubtitle": "Dette kan ta litt tid, vennligst vent ...",
  "gui.MartyMachineModelEditor.requiresAtLeast10Samples": "Krever minst 10 prøver",
  "gui.MartyMachineModelEditor.createNewClass": "Opprett ny klasse",
  "gui.howtos.marty-machine-create-model.name": "Lag AI-modell",
  "gui.howtos.marty-machine-create-model.step_create-model": "Loading...",
  "gui.howtos.marty-machine-create-audio-model.step_visit-user-guide": "Gå til brukerhåndboken vår for mer informasjon",
  "gui.howtos.marty-machine-create-image-model.name": "Lag bildemodell",
  "gui.howtos.marty-machine-create-image-model.step_create-image-model": "Opprett ny bildemodell",
  "gui.howtos.marty-machine-create-image-model.step_change-model-name": "Endre modellnavn",
  "gui.howtos.marty-machine-create-image-model.step_collect-data": "Loading...",
  "gui.howtos.marty-machine-create-image-model.step_train-model": "Togmodell",
  "gui.howtos.marty-machine-create-image-model.step_run-model": "Kjør modell",
  "gui.howtos.marty-machine-create-image-model.step_save-model": "Lagre modell",
  "gui.howtos.marty-machine-create-audio-model.name": "Loading...",
  "gui.howtos.marty-machine-create-audio-model.step_create-audio-model": "Opprett ny lydmodell",
  "gui.howtos.marty-machine-create-audio-model.step_change-model-name": "Endre modellnavn",
  "gui.howtos.marty-machine-create-audio-model.step_collect-data": "Loading...",
  "gui.howtos.marty-machine-create-audio-model.step_train-model": "Togmodell",
  "gui.howtos.marty-machine-create-audio-model.step_run-model": "Kjør modell",
  "gui.howtos.marty-machine-create-audio-model.step_save-model": "Lagre modell",
  "gui.howtos.marty-machine-load-tm-model.name": "Last inn læremaskinmodell",
  "gui.howtos.marty-machine-load-tm-model.step_load-tm-model": "Last inn læremaskinmodell",
  "gui.howtos.marty-machine-load-and-run-image-model.name": "Last inn og kjør bildemodell",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-and-run-image-model": "Hent frem AI-blokkene",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-model": "Loading...",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classification-on": "Loading...",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classify-image": "Klassifiser bilde",
  "gui.howtos.marty-machine-load-and-run-audio-model.name": "Last inn og kjør lydmodell",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-and-run-audio-model": "Hent frem AI-blokkene",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-model": "Loading...",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classification-on": "Loading...",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classify-audio": "Loading..."
}