{
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.description": "Framsteg från BlocksJr till MartyBlocks!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-1": "Välkommen till MartyBlocks! <br /><br /> Låt oss sammanfatta vad vi vet från MartyBlocks Jr för att vänja oss vid den här nya uppsättningen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-2": "Vi hittar \"startknappen\" i Händelser. <br /><br /> Dra den till skriptområdet för att börja koda",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-4": "Kan du återskapa den här MartyBlocks Jr-sekvensen i MartyBlocks? <br /><br /> Vi har redan den gröna flaggan och gör dig redo-blocket, nu gör vi resten!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-6": "Du hittar även glidblocket i Motion. <br /><br /> Lägg till blocket efter \"Gå 4 steg framåt\", ställ in rullgardinsmenyn på \"höger\" och skriv \"3\" så att det matchar BlocksJr-koden.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-7": "Använd samma block för att få Marty att glida åt vänster. <br /><br /> Lägg till blocket efter \"Glid 3 gånger åt höger\", ställ in rullgardinsmenyn på \"vänster\" och skriv \"2\" så att det matchar BlocksJr-koden.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-8": "Slutligen lägger vi till blocket för att gå baklänges. <br /><br /> Lägg till blocket efter \"Slide 2 times left\" och skriv \"1\" så att det matchar BlocksJr-koden.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-1.step-9": "<b/>Du klarade det! Du har nu gått över från BlocksJr till MartyBlocks.</b> <br /><br /> Nu är du redo att utforska MartyBlocks och göra så många coola saker med Marty!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.description": "Lär dig hur man skapar och kontrollerar Sprites i MartyBlocks!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-1": "Vi kan använda sprites för att göra så många saker i MartyBlocks! Från att styra Marty till att sända meddelanden och ta emot input. <br /><br /><b/>Låt oss använda musen för att styra en sprite och utforska olika bakgrunder!</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-2": "Välj en sprite att arbeta med – du kan välja en sprite från biblioteket eller få en överraskningssprite!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-4": "Låt oss använda \"forever\"-slingan så att spriten fortsätter tills vi säger åt den att stoppa med den röda stoppknappen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-5": "I Rörelse, välj punkten mot muspekarblocket. <br /><br /> Lägg till detta som vårt första block i forever-loopen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-6": "I Rörelse, välj även blocket \"gå 10 steg\". <br /><br /> Låt oss lägga till detta under punkten mot blocket och ändra antalet steg till 5.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-7": "Du kan också ändra bakgrunden som din sprite sitter på. <br /><br />Dessa kan hjälpa oss att göra ännu fler saker med sprites. <br /><br /> Välj tio olika bakgrunder (du vet att du har gjort detta när det står bakgrunder: 10)",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-8": "Låt oss hjälpa vår sprite att växla mellan dessa bakgrunder för att utforska! <br /><br />Välj ett block för att växla bakgrund och använd rullgardinsmenyn för att välja \"slumpmässig bakgrund\".<br /><br />Placera detta mellan blocket \"när grön flagga klickades\" och forever-loopen, som visas i exempelkoden här:",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-2.step-9": "Du klarade det! <br /><br /> <b/>Nu kan vi utforska en ny bakgrund med vår sprite varje gång vi klickar på den gröna flaggan! </b><br/><br /> Du kan använda knappen med fyra pilar för att se din sprite i helskärm!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.description": "Låt oss utforska Events och Sprites, och hur de kan kontrollera Martys rörelser!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-2": "Först och främst, låt oss öppna sprite-menyn för att välja vår arktiska sprite. <br /><br /><b/>Sök efter \"polar-bear\"</b> och välj spriten för att placera den i bakgrunden.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-3": "Toppen! Nu ska vi se till att vår isbjörn känner sig hemma. <br /><br />Öppna bakgrundsmenyn och välj sedan den arktiska bakgrunden för att ge vår isbjörn ett hem!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-4": "Klicka på isbjörnen i sprite-menyn för att visa dess kod.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-5": "Navigera sedan till händelser. <br /><br />Dessa block säger <b/>\"när detta händer, gör det\"</b>. De kan hjälpa oss att se till att vår kod bara körs när vi vill att den ska.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-8": "Låt oss hämta två \"byt bakgrund\"-block från Looks och lägga till dem under händelseblocken som visas <br /><br />Använd rullgardinsmenyn för att välja arktisk för den ena och bakgrund1 (standard) för den andra.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-11": "I händelser, välj ett block för \"när bakgrunden växlar till\". <br /> Använd rullgardinsmenyn för att välja Arktis.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-12": "Slutligen, navigera till Motion, välj blocket \"Wiggle!\" och placera det som visas i exempelkoden:",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-3.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.description": "Använd en sprite för att berätta för Marty att det är dags för fest!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-1": "Vi kan använda sprites för att kommunicera med Marty, och med varandra, genom att sända meddelanden.<br /><br />Vi ska använda en sprite för att berätta för Marty att det är dags för fest!",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-2": "Först väljer vi en festbakgrund. <br/>Öppna bakgrundsmenyn och sök efter <b/>fest</b> för att skapa rätt stämning.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-3": "Nu behöver vår fest lite musik! <br/> Klicka på \"Välj en Sprite\" och sök efter <b/>högtalare</b> för att komplettera vår festscen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-4": "Klicka på högtalaren i spritesmenyn för att navigera till högtalarens kod. Vi vill skriva kod som säger: <br /><br /><i> när denna sprit klickade, sänd ut \"festdags!\"</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-5": "Dra det här blocket till kodningsområdet för att börja vår sprite-kod.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-8": "Detta borde vara din färdiga högtalarspritekod.<br/><br/>Nu ska vi berätta för Marty vad han ska göra när han hör meddelandet <i/>dags för fest!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-9": "Navigera till dina Martys block genom att klicka på Marty i enhetsmenyn.",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-intro-4.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.description": "Lär dig att använda if-satser för att skydda Marty!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-1": "I den här handledningen ska vi lära oss hur <b/>if-satser</b> och Martys <b/>hindersensorer</b> fungerar! <br /><br /> Vi kommer att använda dem tillsammans i en evighetsloop för att hjälpa Marty att sluta gå om något blockerar hans väg.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-2": "Detta är ett block med if-satser. <br /><br />If-satser är väldigt viktiga i programmering. De hjälper oss att kontrollera när en kod körs.<br/><br/>Ibland vill vi bara att en del av koden ska köras <b /> om <b /> något annat är sant.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-3": "Kod inuti if-satsen körs bara om koden i diamanten är sann – vi kan göra så mycket med if-satser!<br /><br /> Dra ett if-satsblock till skriptområdet för att starta vår kod.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-4": "Vi kommer att använda Martys hindersensorer för den här aktiviteten – du kan se dem här i de röda cirklarna.<br /><br />De kan se om något blockerar Martys väg genom att använda en speciell typ av osynligt ljus som kallas infrarött (IR).",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-5": "IR-sensorer består av två delar: <b />sändare och mottagare.</b> <br /><br /><b />Sändaren</b> skickar ut osynligt ljus, vilket reflekteras tillbaka om det finns ett hinder i vägen. <br /> <b />Mottagaren</b> letar efter IR-ljus som studsar tillbaka från ett hinder. <br /><br />Om mottagaren detekterar reflekterat ljus vet sensorn att det finns något i vägen. <br /><br />IR-sensorer används för att öppna automatiska dörrar, parkera bilar och hjälpa Marty-robotar att undvika hinder! <br/><br/><br/><i/>Klicka på bilden för att expandera diagrammet.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-6": "Navigera till Avkänning och välj blocket \"välj fothinder avkänt\".<br /><br />I det här exemplet kan du välja antingen vänster eller höger marksensor från rullgardinsmenyn - men du måste välja en av dem, annars fungerar inte blocket!!<br /><br />Placera avkänningsblocket inuti diamanten i if-satsblocket som visas nedan. Denna kod säger nu att om <i />\"fothinder avkänt\" är sant, gör då något. </i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-8": "Vi vill inte att Marty ska kontrollera efter hinder bara en gång, vi vill att han ska fortsätta kontrollera om och om igen, så låt oss placera vår if-sats inuti en evighetsloop.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-9": "Toppen! Nu ska vi testa vår if-satskod genom att få Marty att gå framåt i all evighet om han inte ser ett hinder.<br /><br />Välj blocket \"gå 2 steg framåt\" och placera det ensamt, redo att köras parallellt med vår if-satskod.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-10": "Låt oss placera vårt gångblock inuti en evig loop så att Marty fortsätter att gå om han inte ser ett hinder.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-1.step-11": "Du klarade det!<br /><br /> Placera nu Marty på marken framför ett hinder, klicka på båda evighetsslingorna för att starta din kod och se om Marty håller sig säker!<br /><br /> Försök att ta bort hindret och kontrollera om Marty vet att det är säkert att fortsätta gå.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.description": "Lär dig att använda if else-satser för att hålla Marty säker!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-1": "I den här handledningen ska vi lära oss hur <b/> ​​if-else-satser</b> fungerar! <br /><br /> Vi kommer att använda Martys marksensorer i en if-else-sats för att hindra Marty från att gå av en kant.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-3": "Välj ett if-else-uttryck. <br /><br /> Dra det till skriptområdet för att starta vår kod.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-5": "För att säkerställa att vår kod kontrollerar båda sensorerna samtidigt använder vi och -blocket i operatorerna. <br /><br />Placera båda sensorblocken inuti och -blocket som visas i exempelkoden:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-6": "Nu ska vi placera och -blocket i vårt if-else-block, så att det matchar exempelkoden nedan.<br /><br />Denna kod säger nu: <i/>Om \"vänster fot och höger fot på marken\" är sant, gör något. Om det inte är sant, gör något annat.<i/>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-7": "Låt oss fylla i vårt if/else-uttryck. Om båda fötterna är på marken vill vi att Marty ska gå framåt. Placera ett gångblock framåt i det översta utrymmet som visas.<br /><br /> Eftersom vi vill att Marty ska kontrollera att båda fötterna är säkert på marken efter <b/>varje steg</b>, ändra \"2\" till \"1\" i gångblocket.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-8": "Om en eller båda fötterna inte är i luften vill vi stoppa Marty på ett säkert sätt – för att göra detta använder vi \"gör dig redo\"-blocket för att räta upp hans ben. <br /><br />Placera ett \"gör dig redo\"-block efter \"annars\", som visas nedan:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-2.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.name": "Reaktionstestspel!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.description": "Nu gör vi ett reaktionstestspel!<br /><br />Vi programmerar Cog att lysa upp slumpmässigt och spelaren har en kort tid på sig att trycka på knappen och få en poäng.<br /><br />Vi använder en <i>variabel</i> för att hålla koll på poängen och en timer för att kontrollera om de är tillräckligt snabba.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-1": "Nu gör vi ett reaktionstestspel!<br /><br />Vi programmerar Cog att lysa upp slumpmässigt och spelaren har en kort tid på sig att trycka på knappen och få en poäng.<br /><br />Vi använder en <i>variabel</i> för att hålla koll på poängen och en timer för att kontrollera om de är tillräckligt snabba.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-2": "Se först till att du är ansluten till ett kugghjul.<br /><br />Om inte, lägg till ett som du gjorde i den senaste handledningen genom att trycka på knappen Lägg till i enhetspanelen och välja ett kugghjul och sedan klicka på Anslut. Om du behöver, hoppa tillbaka till den senaste handledningen för att se hur",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-3": "Lägg till ett block <b>När flaggan klickades</b> från kategorin <b>Händelser</b><br /><br />Detta blir starten på vårt program och körs när vi trycker på den gröna flaggan högst upp på skärmen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-4": "<b>Lägg till en</b> <i>set [ring] LEDs till [color]</i> <b>block</b> från kategorin <b>Looks</b>,<br /><br />Ändra den för att ställa in <i>knappens</i> färg",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-5": "Lägg till ett <b>vänta [1] sekunder</b>-block från <b>kontroll</b>-kategorin",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-6": "Gå tillbaka till kategorin <b>Utseenden</b> och lägg till ett block <b>Stäng av alla lysdioder</b>.<br /><br />Lägg till det precis efter vänteblocket, så att Cog släcker knapplysdioden efter 1 sekund.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-7": "<b>Prova det!</b> Klicka på den gröna flaggan för att starta programmet! Knappen på Cog lyser i 1 sekund och släcks sedan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-8": "<b>Kontrollera om du kan trycka på knappen i tid!</b> Gå till kategorin <b>Händelser</b> och lägg till ett block <b>När knappen trycks ner</b><br /><br />",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-9": "Lägg till ett <b>Om __ då</b>-block under <b>När knappen trycks ner</b>-blocket från <b>Kontroll</b>-kategorin.<br /><br />Vi använder detta om-block för att kontrollera om spelaren har tryckt på knappen i tid.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-10": "Dra ett <block till if-blocket från kategorin <b>Operatorer</b><br /><br />Symbolen < betyder 'mindre än' och är bara sant om talet till vänster är mindre än talet till höger",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-11": "Dra <b>timer</b>-blocket från kategorin <b>Sensing</b> till den första rutan på <blocket<br /><br />Sätt sedan den andra rutan till 1, så att raden säger <i>om timer <1 då</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-13": "Lägg till ett block <b>Återställ timer</b> under blocket <b>När flaggan klickas</b><br /><br />Detta återställer timervariabeln till 0 precis innan knappens lysdiod tänds.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-14": "Gå tillbaka till kategorin <b>Utseenden</b> och lägg till ett <b>Set [ring] LEDs to [color]</b>-block inuti if-blocket.<br /><br />Ändra färgen till vad du vill och se till att du lägger till den i if-satsen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-15": "Lägg till ett block <b>Spela ton [C4] i [1] sekunder</b> från kategorin <b>Ljud</b><br /><br />Placera det direkt efter blocket <b>Ange LED</b> och ändra det till att spela <b>C6</b> i <b>0,25 sekunder</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-16": "Lägg till ett <b>Släck alla lysdioder</b>-block efter <b>Spela not</b>-blocket.<br /><br />Koden i if-satsen körs bara (och därför lyser Cog bara och piper) om knappen trycks ner inom 1 sekund efter att timern återställts.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-17": "<b>Prova det!</b> Tryck på den gröna flaggan för att starta. Om du trycker på knappen inom 1 sekund tänds lamporna och du hör ett pip!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-19": "Lägg även till ytterligare ett <b>Vänta [1] sekunder</b>-block inuti repetitionsloopen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-20": "Gå till kategorin <b>Operatorer</b> och ändra tiden på det vänteblocket till ett slumpmässigt tal mellan 1 och 5 sekunder.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-21": "När du trycker på den gröna flaggan har du 10 chanser att trycka på knappen medan den lyser!<br /><br />Det blir en slumpmässig paus mellan varje, och under varje iteration genom loopen återställs timern, så vi behöver inte ändra koden som reagerar på knapptryckningen. <br /><br />Prova det! Hur många av lamporna kan du fånga?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-22": "Att hålla koll på sin poäng i huvudet är lite tråkigt. Nu lägger vi till kod för att hålla koll på poängen automatiskt!<br /><br />Gå till kategorin <b>Variabler</b> och skapa en variabel som heter <b>poäng</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-25": "Inuti if-satsen, lägg till ett block med 1 ord som ändrar [min variabel] och välj variabeln <b>poäng</b> från menyn så att det står \"ändra poäng med 1\"",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-26": "Testa det!<br /><br />Nu ökar poängen med 1 varje gång du trycker på tiden!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-27": "Nu ska vi göra det lite svårare!<br /><br />Vad händer om ljuset går snabbare när du tände det?<br /><br />Skapa en annan variabel och kalla den <i>fördröjning</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-28": "Ställ in 'fördröjning' på 1 i början av programmet, direkt efter att du har återställt poängen",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-30": "Under de 10 iterationerna av repetitionsslingan kommer fördröjningen att minska från 1 sekund till 0,5 (eller en halv sekund)",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-31": "Nu ska vi använda fördröjningsvariabeln<br /><br />En bra sak med variabler är att vi kan använda dem på mer än ett ställe<br /><br />Dra fördröjningsvariabeln till blocket '<' så att det står <i>om timer <fördröjning då</i><br /><br />Dra den också till blocket 'vänta [1] sekund' så att det står 'vänta [fördröjning] sekunder'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-32": "Testa det!<br /><br />Märker du att spelet snabbar upp?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-33": "Låt oss få cog att visa poängen för spelaren i slutet.<br /><br />Vi kan göra det som vi gjorde med tärningarna i den senaste aktiviteten.<br /><br />Först och främst, skapa en variabel som heter <b>ledID</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-34": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-35": "Gå sedan till kategorin <b>Kontroll</b> och lägg till ytterligare en <b>upprepningsloop</b>.<br /><br />Ersätt numret i den med variabeln 'score' så att det står 'upprepa [score]'",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-36": "Lägg till ett <b>Set LED [1] to [color]</b>-block inuti den här nya repetitionsslingan.<br /><br />Ersätt numret med variabeln 'ledID' så att det står 'Set LED [ledID] to [color]'.<br /><br />Ställ sedan in färgen till vad du vill!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-37": "Och slutligen, lägg till ett <b>Change [variable] by [1]</b>-block efter det inställda LED-blocket, och få det att ändra <b>ledID</b> med 1",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-38": "Testa det!<br /><br />När du är klar visar Cog din poäng!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-39": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-3.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-1": "Nu gör vi en ljusshow som reagerar när du interagerar med Cog!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-2": "Se först till att du är ansluten till ett kugghjul.<br /><br />Om inte, lägg till ett som du gjorde i den senaste handledningen genom att trycka på knappen Lägg till i enhetspanelen och välja ett kugghjul och sedan klicka på Anslut. Om du behöver, hoppa tillbaka till den senaste handledningen för att se hur",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-3": "Gå till kategorin <b>Händelser</b> och lägg till ett <b>på objekt avkänt [vänster]</b>-block.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-4": "Gå till kategorin <b>Utseenden</b> och lägg till <b>en uppsättning lysdioder med hjälp av färgväljaren</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-5": "Ställ in färgerna till vad du vill.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-7": "Lägg till ytterligare ett <b>på objektavkänning</b>-block från kategorin <b>Händelser</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-8": "Ändra sensorn till höger med hjälp av rullgardinsmenyn.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-10": "Testa det! Placera ett föremål på den högra hindersensorn.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-13": "Här är de individuella bildrutorna för den animationen.<br /><br />Kan du planera en egen animation och låta den spelas upp när kugghjulet känner av ett objekt?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-15": "Hittills, när vi har använt knappen på Cog, har den detekterat om den trycks ned eller inte.<br /><br />Vi kallar den här typen av information för en <b>boolesk</b> - något som antingen är sant eller falskt.<br /><br />Förutom att tänka på knappen som en boolesk indata kan vi också använda den som en <b>analog</b> indata - en som kan ha många olika värden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-16": "Gå till kategorin <b>Avkänning</b> och markera rutan bredvid blocket <b>Knappkraftvärde %</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-19": "Gå nu till kategorin <b>Kontroll</b> och lägg till en <b>för alltid</b>-slinga.<br /><br />Till skillnad från <b>upprepningsslingan</b> som bara upprepades ett visst antal gånger, kommer <b>för alltid</b>-slingan att fortsätta loopa tills du trycker på den röda stoppknappen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-20": "Gå till kategorin <b>Utseenden</b> och lägg till ett <b>set [ring] LEDs to [color]</b>-block i den ständiga loopen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-21": "Dra nu blocket som säger <b>nyans [360] mättnad [100] ljusstyrka [100]</b> till platsen för färgen i blocket <b>ställ in [ring] LED-lampor på [färg]</b>.<br /><br />Det finns ett par olika sätt att beskriva färger, och nyans, mättnad och ljusstyrka (eller värde) är ett av dem.<br /><br />Med dessa tre siffror kan vi beskriva vilken färg som helst.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-22": "**Nyansen** är ett tal mellan 0 och 360 (som graderna på en cirkel) som anger vilken grundfärg vi vill ha.<br /><br />Den kan visas i en cirkel – och det har du redan sett när du använder färgväljaren!<br /><br />0 grader är högst upp och representerar rött. 90 grader är en gröngul, 180 grader är en cyanblå, 270 grader är lila och 360 grader är tillbaka till rött!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-24": "Slutligen anger <b>ljusstyrka</b> (eller ljusstyrka, eller värde) hur ljus du vill att färgen ska vara.<br /><br />I det här exemplet, med en nyans på 360 och en mättnad på 100, ger en ljusstyrka på 100 återigen den rödaste röda färgen.<br /><br />En ljusstyrka på 0 ger inget rött alls - i det här fallet skulle lysdioden på Cog bara släckas!<br /><br />En ljusstyrka på 50 kommer att vara i mitten - en mörkröd färg.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-25": "Låt oss använda <b>knappkraft</b> för att ställa in en av dessa!<br /><br />Gå tillbaka till kategorin <b>Avkänning</b> och dra blocket <b>knappkraftvärde</b> till ljusstyrkeutrymmet i blocket <b>nyans, mättnad, ljusstyrka</b>.<br /><br />Lägg också till en <b>väntetid på 0,1 sekunder</b> i slutet av evighetsloopen så att ljusen inte ändras för snabbt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-26": "Låt oss också tända lampan i knappen på Cog för skojs skull!<br /><br />Lägg till ett <b>Set [ring] LEDs to [color]</b>-block före forever-loopen och ändra det för att ställa in <b>knappen</b>. Välj vilken färg du vill.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-27": "Testa det! När du trycker ner knappen kommer lysdioderna att lysa starkare och starkare rött!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-28": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-29": "Nu kommer lamporna att ändras från vitt till rött när du trycker på knappen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-30": "Slutligen, försök att ställa in nyansen istället.<br /><br />Värdet för nyans måste gå från 0 till 360, så vi måste göra lite beräkningar.<br /><br />Gå till kategorin <b>Operatorer</b> och dra ett <b>multiple</b> block till nyansvärdet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-31": "Ställ in den så att den multiplicerar knapptryckningsvärdet med 3,6.<br /><br />Detta innebär att istället för att ange siffror från 0 till 100 får vi siffror från 0 till 360 (3,6 x 100).<br /><br />Prova det!<br /><br />När du trycker på knappen ändras lampornas färg från rött till grönt till blått och tillbaka till rött!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-32": "Se om du kan ändra färgen på knappen också!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-33": "Nu ska vi se om vi kan få Cog att reagera på starkt ljus genom att lysa en stund.<br /><br />Radera koden du skapade för att ändra färgerna baserat på knapptryckning genom att dra den till blockpaletten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-34": "Gå till kategorin <b>Avkänning</b> och markera rutan bredvid blocket <b>Värde för omgivande ljus</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-36": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-37": "Gå sedan till <b>Operatorer</b> och lägg till ett <b>större än</b>-block i <b>vänta till</b>-blocket.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-38": "Gå tillbaka till kategorin <b>Avkänning</b> och dra blocket <b>Värde för omgivande ljus</b> till vänster sida av <b>>>blocket.<br /><br />Ändra höger sida till ett tal som bara uppnås när du lyser med en ficklampa på Cog.<br /><br />Du behöver inte ange det maximala talet, bara ett som är högre än vad du ser utan ficklampa.<br /><br />Här har jag valt 1500, så hela raden lyder <b>vänta tills värdet för omgivande ljus > 1500</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-39": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-40": "Testa det!<br /><br />Klicka på den gröna flaggan för att börja koden.<br /><br />När du sedan lyser med en ficklampa på Cog tänds lamporna!<br /><br />Blocket <b>vänta tills</b> stoppar kodexekveringen tills villkoret du angav är uppfyllt.<br /><br />I det här fallet kontrollerar man om ljussensorns värde är tillräckligt starkt.<br /><br />När villkoret är sant är blocket <b>vänta tills</b> uppfyllt, och exekveringen går vidare till blocket <b>ställ in [ring]-lysdioder till [färg]</b> för att tända lysdioderna.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-41": "Låt oss få lamporna på Cog att tändas gradvis när den upptäcker en ficklampa.<br /><br />För att göra det använder vi en variabel igen!<br /><br />Gå till kategorin <b>Variabler</b> och skapa en variabel som heter <b>ljusstyrka</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-42": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-43": "Lägg nu till ett <b>upprepa tills</b>-block under <b>vänta tills</b>-blocket och låt det omge blocket <b>Set [ring] LEDs to [color]</b>.<br /><br />Du hittar blocket <b>upprepa tills</b> i kategorin <b>Kontroll</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-44": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-45": "Lägg nu till ett block <b>ändra ljusstyrkan med 10</b> inuti blocket <b>upprepa tills</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-46": "Ändra blocket <b>set [ring] LEDs to [color]</b> för att använda ett block för <b>hue, saturation, lightness</b>.<br /><br />Använd variabeln <b>brightness</b> för ljusstyrka.<br /><br />Ändra även färgen till en fin blå färg genom att ställa in nyansen till 180.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-47": "Lägg sedan till ett <b>vänta</b>-block från <b>kontroll</b>-kategorin och ändra det till <b>vänta 0,1 sekunder</b>.<br /><br />Detta kommer att sakta ner fade-effekten lite.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-48": "Blocket <b>repeat until</b> är lite som en kombination av <b>repeat</b>-blocket du använde tidigare, som upprepades ett visst antal gånger, och blocket <b>wait until</b> du just använde.<br /><br />I det här fallet fortsätter det att upprepas tills villkoret är uppfyllt, och sedan slutar det att upprepas och kodkörningen fortsätter.<br /><br />I det här exemplet fortsätter det att upprepa loopen och gradvis öka ljusstyrkan tills ljusstyrkan når det maximala värdet 100.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-49": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-50": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-51": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-52": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-53": "Den här koden kommer nästan att fungera, men kan du hitta felet?<br /><br />Ljusstyrkan kommer att fortsätta öka istället för att minska!<br /><br />Ändra det så att det står <b>ändra ljusstyrka med -5</b> istället.<br /><br /><b>-5</b> här subtraherar 5 från ljusstyrkevariabeln varje gång.<br /><br />Detta kommer att tona ut lamporna med halva hastigheten som vi tonade in dem.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-54": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-55": "Nu ska vi göra det så att du inte behöver klicka på den gröna flaggan varje gång du vill att Cog ska reagera.<br /><br />Lägg till en <b>för alltid</b>-loop så att den börjar efter <b>Stäng av alla lysdioder</b>-blocket och omger all annan kod.<br /><br />Nu fortsätter Cog att reagera på starka ljus tills du trycker på den röda stoppskylten!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-56": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-4.step-57": "Nästa steg - om du är i en klass med andra personer med Cogs, eller om du har fler än en, försök att sätta ihop många av dem medan de kör koden du just skapade.<br /><br />Kan du använda en ficklampa för att skriva saker på dem och måla med ljus?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.description": "Nu ska vi skapa ytterligare en användbar sak med Cog! <br /><br />Den här gången ska vi använda Cogs lutningsavkänning för att skapa ett vattenpass - något som visar om något är i våg eller om det lutar. <br /><br />Många vattenpass fungerar bara i en dimension, men vi ska få våra att fungera i två!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-1": "<b>Låt oss tillverka ett vattenpass</b> som visar om något är plant eller lutar!<br /><br />Vi använder Cogs lutningsavkänning för att få det att fungera i två dimensioner.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-2": "Se först till att du är ansluten till ett kugghjul.<br /><br />Om inte, lägg till ett som du gjorde i den senaste handledningen genom att trycka på knappen Lägg till i enhetspanelen och välja ett kugghjul och sedan klicka på Anslut. Om du behöver, hoppa tillbaka till den senaste handledningen för att se hur",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-3": "Gå till kategorin <b>Händelser</b> och lägg till ett <b>vid tilt [vänster]</b>-händelseblock.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-4": "Gå nu till kategorin <b>Utseenden</b> och lägg till <b>en uppsättning lysdioder med hjälp av färgväljaren</b>-blocket.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-6": "Ställ sedan in bara en LED till vänster så att den lyser.<br /><br />Prova det! Luta kugghjulet åt vänster.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-7": "Lägg till ytterligare ett <b>vid tilt [vänster]</b>-block från kontrollkategorin och ändra det så att det står <b>vid tilt [höger]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-10": "Lägg till ytterligare en uppsättning block <b>vid lutning</b> och <b>färgväljare</b>.<br /><br />Ställ in den så att den reagerar vid <b>lutning [bakåt]</b> och så att endast lysdioden vid klockan 6 tänds.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-11": "Lägg slutligen till en fjärde uppsättning block och ställ in dem på <b>tilt [framåt]</b> och tänd lysdioden framtill på kugghjulet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-12": "Testa det!<br /><br />Luta kugghjulet i alla fyra riktningar och se hur ljuset rör sig runt!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-15": "Luta kugghjulet runt och titta på hur siffrorna förändras!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-16": "Låt oss titta på det lite mer i detalj, klicka på knappen <b>Sensoröversikt</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-18": "Och välj din kugge.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-19": "Ett diagram kommer att visas!<br /><br />Vi måste välja de sensorer vi vill visa. Klicka för att expandera kategorin <b>Accelerometer</b> och markera sedan rutorna bredvid <b>X</b> och <b>Y</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-20": "Tryck på <b>uppspelningsknappen</b> för att börja visa sensordata.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-21": "Luta kugghjulet och titta på hur värdena för X-axeln och Y-axeln ändras.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-23": "Nu ska vi testa lite! Du behöver lite papper för att anteckna.<br /><br />Luta kugghjulet åt höger och anteckna vilket värde accelerometerns axel och accelerometerns axel har.<br /><br />Gör sedan samma sak för att luta framåt, bakåt och åt vänster.<br /><br />Vi kommer att använda dessa data strax!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-24": "Gå nu till kategorin <b>Variabler</b> och skapa två variabler som heter <b>ax</b> (för accelerometer x) och <b>ay</b> (för accelerometer y).",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-25": "Lägg till dessa block i ditt projekt:<br /><br /><ul><li>När flaggan klickas:</li><ul><li>För alltid:</li><ul><li>Sätt ax till Accelerometer X</li><li>Sätt ay till Accelerometer Y</li></ul></ul></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-26": "Gå nu till kategorin <b>Händelser</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-28": "Låt oss ge meddelandet ett bättre namn, välj <b>Nytt meddelande</b> från rullgardinsmenyn.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-30": "Klicka nu på fliken <b>Sprites</b> högst upp.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-31": "Klicka på knappen <b>Lägg till sprite</b> och välj <b>Boll</b>-spriten (eller vilken annan sprite du vill).",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-32": "Din kod kommer att försvinna! Oroa dig inte - den finns fortfarande där, bara länkad till cog istället för till denna sprite.<br /><br />Gå till kategorin <b>Händelser</b> och lägg till ett <b>när jag får [uppdatera position]</b>-block.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-33": "Ändra det så att det står <b>när jag får [uppdatera position]</b> – det är meddelandet vi just skapade.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-34": "Gå nu till kategorin <b>Rörelse</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-36": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-37": "Vi vill flytta bollen för att visa hur mycket kugghjulet lutar.<br /><br />Titta tillbaka på anteckningarna du gjorde om vilka accelerometeravläsningar du fick när du lutade kugghjulet i var och en av de fyra riktningarna.<br /><br />Vi vill att bollen ska röra sig åt vänster och höger när du lutar kugghjulet åt vänster och höger. För spriten ställs vänster och höger in av dess x-koordinat.<br /><br />Du bör se att när du lutade kugghjulet åt höger var ay-värdet över 0, medan ax-värdet var nästan 0. När du lutade åt vänster var ay-värdet under 0.<br /><br />Detta innebär att vi bör använda ay-värdet för att ställa in x-koordinaten för spriten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-39": "Gå till kategorin <b>Variabler</b> och lägg till variabeln <b>ay</b> i multiplikationsblocket.<br /><br />Skriv <b>100</b> på andra sidan av multiplikationsblocket.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-41": "Du borde se att <b>ax</b> har ändrats – så vi använder det för att ställa in y-koordinaten.<br /><br />Lägg till ytterligare ett multiplikationsblock och placera variabeln <b>ax</b> inuti det.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-42": "Men det finns ett problem! Vi vill att spriten ska röra sig uppåt när du lutar kugghjulet framåt, vilket skulle innebära att den behöver en y-koordinat över 0.<br /><br />Men när du lutade kugghjulet framåt var y-värdet under 0!<br /><br />För att åtgärda detta måste vi multiplicera det med <b>-100</b> istället för <b>100</b>. Det extra minustecknet kommer att vända det från att vara under 0 till över 0, och vice versa.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-43": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-44": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-45": "Låt oss lägga till en bakgrund bakom bollen för att bättre visa vad vi visar.<br /><br />Välj <b>Scen</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-46": "Välj sedan fliken <b>Bakgrunder</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-47": "Rita några cirklar runt mittpunkten.<br /><br />Du kan gärna göra dem färgglada om du vill!<br /><br />Tips - om du använder en dator kan du hålla nere shift för att se till att du får en cirkel istället för en ellips.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-48": "Du kan välja fliken <b>Kod</b> högst upp för att gå tillbaka till kodningsskärmen och välja Kugghjul igen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-49": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-50": "Om du lutar i 45 graders vinkel kommer indikatorn att vara på samma avstånd från mitten, men ax och y kommer nu att vara runt 0,7 – kan du förstå varför det är så?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-51": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-52": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-53": "Låt oss få Cog att även indikera när den är platt!<br /><br />Gå tillbaka till kategorin <b>Avkänning</b> och markera kryssrutan bredvid <b>Lutningsriktning</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-54": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-55": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-5.step-56": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.name": "Nu gör vi ett skidspel!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.description": "Nu ska vi skapa ett spel där vi använder Cog och Sprites på skärmen!<br /><br />Vi ska skapa ett skidspel där spelaren måste undvika att träffa träd och stenar.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-1": "Nu ska vi skapa ett spel där vi använder Cog och Sprites på skärmen!<br /><br />Vi ska skapa ett skidspel där spelaren måste undvika att träffa träd och stenar.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-1.2": "Se först till att du är ansluten till ett kugghjul.<br /><br />Om inte, lägg till ett som du gjorde i den senaste handledningen genom att trycka på knappen Lägg till i enhetspanelen och välja ett kugghjul och sedan klicka på Anslut. Om du behöver, hoppa tillbaka till den senaste handledningen för att se hur",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-2": "Gå till kategorin Händelser och lägg till ett block <b>On object sensed [left]</b>.<br /><br />Vi använder detta som startknapp.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-3": "Lägg till en <b>för alltid</b> loop från kontrollkategorin.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-4": "Gå till variabelkategorin och skapa en variabel som heter `ay`.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-5": "Lägg till block för att <i>ställa in [ay] till [accelerometer [Y]]</i> inuti den ständiga loopen.<br /><br />Du måste använda ett <b>set</b>-block från kategorin Variabler, <b>Accelerometer</b>-blocket från kategorin Sensorer och för att ändra axeln till <b>Y</b> med hjälp av rullgardinsmenyn.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-6": "Lägg till ett <b>broadcast [message 1]</b>-block och ställ in det för att sända ett <b>New Message</b> som heter <i>update position</i>.<br /><br />Vi använder detta som en signal för att flytta runt vår sprite.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-7": "Lägg till ytterligare ett <b>broadcast [message1]</b>-block före forever-loopen och ställ in det för att sända ett <b>New Message</b> som heter <i>start</i>.<br /><br />Vi använder detta för att se till att allt återställs i början av ett spel.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-9": "Lägg till <b>Penguin 2</b>-spriten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-10": "Med pingvinspriten vald, lägg till ett <b>när jag får [start]</b>-block från kategorin Händelser.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-11": "Gå till kategorin Utseende och lägg till ett block <b>set size to [100]%</b>.<br /><br />Ändra storleken till 20%.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-12": "Gå tillbaka till kategorin Händelser och lägg till ett block <b>när jag får [uppdatera position]</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-13": "Gå till kategorin Rörelse och lägg till ett <b>gå till x: [] y: []</b>-block.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-14": "Ändra det till att säga <b>gå till x: [[ay] x 200] y:0</b>.<br /><br />Du måste använda ett <b>multiplicera (*)</b>-block från kategorin Operatorer och variabeln <b>ay</b> från kategorin Variabler.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-16": "Nu lägger vi till några hinder!<br /><br />Lägg till <b>Tree1</b>-spriten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-17": "Med Träd-spriten vald, lägg till ett <b>när jag får [start]</b>-block.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-18": "Från kategorin Utseende, lägg till ett <b>set size to [30]%</b>-block och ett <b>hide</b>-block.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-19": "Lägg till en <b>för alltid</b> loop från kontrollkategorin.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-20": "Inuti forever-loopen, lägg till ett <b>create clone of [myself]</b>-block.<br /><br />En klon är en identisk kopia av något.<br /><br />I det här fallet kommer create clone-blocket att skapa en kopia av trädspriten och all kod som är länkad till den.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-21": "Efter det blocket, lägg till ett <b>vänta[1] sekunder</b>-block.<br /><br />Detta innebär att ett nytt träd skapas var 1:a sekund.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-23": "Lägg till ett <b>go to x: [pick random [-240] to [240] y: [-200]</b>-block.<br /><br />Du hittar blocket <b>pick random</b> i kategorin Operatorer.<br /><br />Detta gör att den nya klonen av trädet börjar på en slumpmässig plats längst ner på skärmen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-24": "Lägg till ett <b>glid[1] sek till: x[] y:[]</b>-block.<br /><br />Glidblocken gör en jämn rörelse under en viss tid.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-26": "Före glidblocket, lägg till ett <b>show</b>-block från kategorin Looks.<br /><br />Klonen kommer att börja vara dold, eftersom spriten den kopierades från var dold, så vi måste visa den innan vi börjar flytta den.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-28": "Testa det!<br /><br />Ett nytt träd visas varje sekund och flyttas uppåt på skärmen.<br /><br />För att stoppa programmet, tryck på den röda stopptecknet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-29": "Låt oss få spelet att upptäcka om pingvinen kraschar in i ett träd.<br /><br />Med Träd-spriten fortfarande vald, lägg till ytterligare ett <b>när jag startar som klon</b>-block och en <b>för alltid</b>-loop under det.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-30": "Lägg till ett <b>if [] then</b>-block inuti forever-slingan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-32": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-33": "Testa det!<br /><br />Täck över den vänstra objektsensorn för att starta spelet och luta Cog för att styra pingvinen för att undvika träden.<br /><br />När du rör vid ett träd avslutas spelet!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-34": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-36": "Och lägg till ett <b>change [score] by [1]</b>-block mellan glidblocken och ta bort dessa klonblock.<br /><br />Detta kommer att öka poängen med 1 för varje träd som vi lyckas undvika.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-38": "Lägg till dessa block tillsammans med de andra för Träd-spriten.<br /><br />När spelet startar kommer fördröjningen att ställas in på 1.<br /><br />Sedan, var 5:e sekund, kommer fördröjningen att ställas in på ¾ (tre fjärdedelar) av vad den var tidigare.<br /><br />Den kommer att gå från 1 sekund, till 0,75 sekunder (tre fjärdedelar av en sekund), till 0,56 (drygt en halv sekund), till 0,42, till 0,3 sekunder, och så vidare!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-39": "Använd nu variabeln delay för att ställa in tiden mellan träden som skapas.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-40": "Testa det!<br /><br />Du kommer att märka att träden börjar dyka upp mycket snabbare ju längre du kommer!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-41": "Låt oss lägga till lite lampor på Cog för att göra det mer spännande.<br /><br />Lägg till ett <b>broadcast [stop]- och wait-block</b> före <b>stop [all]-blocket.<br /><br />Du måste skapa ett nytt meddelande som heter <b>stop</b>.<br /><br />Blocket <b>broadcast [stop]- och wait</b> ser till att vilken kod som helst som körs när stoppmeddelandet skickas kommer att avslutas innan koden fortsätter och <b>stop [all]-blocket körs.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-42": "Välj Kugghjul.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-43": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-44": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-6.step-45": "Bra jobbat!<br /><br />Du har lärt dig hur man skapar ett spel i Blocks! Vi har använt klonfunktionen för att göra massor av kopior av träd att undvika, och fått Cog att styra en karaktär på skärmen.<br /><br />Nästa steg:<ul><li>Kan du skapa en annan typ av hinder att undvika - kanske stenar?</li><li>Kan du få pingvinen att hoppa när du trycker på knappen på Cog?</li><li>Kan du göra det så att du kan hoppa över stenhinder för att få bonuspoäng?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.description": "Låt oss förvandla Cog till ett musikinstrument!<br /><br />Vi får Cog att spela noter som ändras beroende på hur du interagerar med det och lär oss om tonarter.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-1": "Låt oss förvandla Cog till ett musikinstrument!<br /><br />Vi får Cog att spela noter som ändras beroende på hur du interagerar med det och lär oss om tonarter.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-4": "Skriv ner värdet för IR-sensorn till höger utan att ha något framför den.<br /><br />Placera sedan handen på 5 cm-markeringen och anteckna numret som sensorn läser av nu.<br /><br />Det är normalt att värdena rör sig lite upp och ner – försök att skriva ner ett tal som ligger mitt emellan dessa variationer.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-5": "Upprepa detta med din hand på markeringarna 4 cm, 3 cm, 2 cm, 1 cm och 0 cm.<br /><br />Du bör få en måtttabell.<br /><br />Du kanske märker att siffrorna ändras mycket när din hand är nära Cog, men mindre ju längre bort din hand kommer.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-7": "Vi ska använda höger IR-sensor för att välja vilken ton som ska spelas. Låt oss ta en ögonblicksbild av den genom att skapa en variabel som heter `reading` och ställa in den på värdet för höger IR-sensor.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-8": "Nu behöver vi använda villkor för att välja vilken ton som ska spelas.<br /><br />Vi vill bara spela en ton, så vi använder blocket <b>if … else</b>.<br /><br />För villkoret, lägg till en <b>less than</b> (<) jämförelse och sätt den till <b>reading &lt; [2100]</b>. Istället för 2100, sätt detta tal till det du mätte när din hand var på 4cm-linjen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-11": "Nu kodar vi fler anteckningar!<br /><br />Vi lägger till ytterligare ett <b>if … else</b>-block inuti else-delen av det första.<br /><br />Att lägga villkor inuti varandra på det här sättet kallas nesting.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-12": "Sätt villkoret för det andra if … else-blocket till att säga <b>[läsning] <2200</b>, men istället för 2200 använd talet du mätte med handen på 3cm-linjen.<br /><br />Lägg till ytterligare ett <b>Startnot</b>-block inuti if-delen av det andra villkorsordet och ställ in det för att spela noten <b>D4</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-13": "Gör det två gånger till, så att du får fyra if … else-block.<br /><br />Du kan göra detta snabbare om du högerklickar, eller håller ner det sista if… else-blocket och väljer alternativet <b>Duplicera</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-14": "För det tredje villkorsordet, sätt talet till det du mätte vid 2 cm-markeringen.<br /><br />För det fjärde villkorsordet, sätt talet till det du mätte vid 1 cm-markeringen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-16": "Nu är det dags för den femte noten.<br /><br />Det finns ingen anledning att använda ytterligare ett if … else-block eftersom detta är det enda alternativet som finns kvar!<br /><br />Lägg till ett <b>Startnotsblock [A4]</b> i else-delen av det sista if … else-villkoret.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-17": "Testa det!<br /><br />Kan du få Cog att göra alla 5 tonerna?<br /><br />Du kan ändra siffrorna lite om du vill göra några justeringar.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-18": "Låt oss få Cog att sluta spela noten när du slutar trycka på knappen.<br /><br />Efter alla if .. else-block, lägg till ett <b>wait until [[button clicked] = [False]]</b>-block och ett <b>Stoppljud</b>-block.<br /><br />Du måste leta i kategorin Kontroll för vänta till-blocket, kategorin Operatorer för =-blocket, kategorin Avkänning för blocket knapptryckt och kategorin Ljud för blocket Stopljud.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-19": "Försök igen!<br /><br />Nu slutar Cog spela tonen när du slutar trycka på knappen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-20": "Det vore kul om du kunde byta ton medan du höll knappen nedtryckt.<br /><br />Sätt in ett <b>upprepa tills</b>-block runt all kod precis efter blocket för vid knapptryckning.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-21": "Sätt villkoret i repeat until-blocket till <b>[[button clicked] = False]</b>.<br /><br />Flytta blocket <b>Stoppa ljud</b> utanför repeat until-loopen och ersätt blocket <b>vänta till</b> med ett <b>vänta på [0.1] sekunder</b>-block.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-22": "Testa det!<br /><br />Lyft upp Cog och rör handen fram och tillbaka framför sensorn medan du håller knappen intryckt – du borde höra tonen gå upp och ner!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-23": "Vi har gjort Cog-noter i C-dur, så vi borde kunna spela med i vilken låt som helst som också är i C-dur!<br /><br />Till exempel, försök att spela med i \"Let it Be\" av The Beatles.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-25": "Ersätt vart och ett av <b>Start note</b>-blocken med ett <b>set [note] to [notec4]</b>-block.<br /><br />Du måste skriva <b>notec4</b> exakt så för att detta ska fungera. För de andra anteckningarna använder du <b>noted4</b>, <b>notee4</b>, <b>noteg4</b> och <b>notea4</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-28": "Testa det!<br /><br />Nu när du rör handen bör noten ändras snabbare!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-30": "Hur annars skulle du kunna ändra noten?<br /><br />Vad sägs om att använda hur Cog lutas? Då kan du ändra noten bara genom att vrida Cog åt vänster och höger!<br /><br />Du kan modifiera din kod för att testa det - här är ett litet tips om hur du gör det:",
  "gui.howtos.lessons.type-lesson-cog-tutorial-7.step-31": "Vilken föredrar du – att använda IR-sensorn eller lutningen för att ställa in tonen?<br /><br />Vilka andra sensorer kan du använda?<br /><br />Försök att spela med i andra låtar i C-dur.<br /><br />Du kan också ändra noterna för att spela den pentatoniska skalan i en annan tonart istället. Många låtar är i samma tonart, även om vissa har tonartändringar – hur kan du få Cog att ändra tonarten den spelar i?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.name": "Klocka",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.description": "Nu förvandlar vi Cog till en klocka!<br /><br />Det finns 12 lysdioder i ringen på Cog, så vi kan använda saker som visarna på en klocka för att indikera timmar, minuter och sekunder!<br /><br />Vi ska fundera lite på matematiken som behövs och vara kreativa med olika sätt att visa tiden!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-1": "Nu förvandlar vi Cog till en klocka!<br /><br />Det finns 12 lysdioder i ringen på Cog, så vi kan använda saker som visarna på en klocka för att indikera timmar, minuter och sekunder!<br /><br />Vi ska fundera lite på matematiken som behövs och vara kreativa med olika sätt att visa tiden!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-2": "Lägg till följande block i din kod:<br /><br /><b>när den gröna flaggan klickas</b><ul><li>stäng av alla lysdioder</li><li>ställ in lysdiod [1] på [röd]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-4": "Blocks-gränssnittet, liksom de flesta datorer, använder en 24-timmarsklocka.<br /><br />Om det är på morgonen kommer den aktuella timmen att vara mellan 0 och 11.<br /><br />Om det är eftermiddag kommer den aktuella timmen att vara mellan 12 och 23.<br /><br />Vanliga analoga klockor eller armbandsur använder istället en 12-timmarsklocka, där det finns två 12-timmarssegment (am och pm) under ett 24-timmarsdag.<br /><br />Cog har 12 lysdioder i ringen, så vi kommer också att använda en 12-timmarsklocka. Hur kan vi ändra talet i Blocks-gränssnittet från en 24-timmarsklocka till en 12-timmarsklocka?<br /><br />Vi kan kontrollera om timmen är större än 11, och i så fall subtrahera 12.<br /><br />Eller så kan vi använda modulusoperatorn, vilket ger dig resten efter att du har gjort en division.<br /><br />Så här, om vi dividerar 17 med 12, får vi svaret 1 med en rest på 5 (eller 1r5). 17:00 i 24-timmarsklockan är 17:00 i 12-timmarsklockan, så det stämmer!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-5": "Sätt in <b>[[current [hour]] mod [12]]</b> som LED-ID i <b>set LED</b>-blocket.<br /><br />Försök att köra koden genom att trycka på den gröna flaggan - Cog visar ett enda rött ljus som visar var timvisaren skulle vara på en klocka!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-6": "Vi vill förmodligen visa mer än bara timmen på vår klocka, så låt oss lista ut hur vi kan visa minuterna också.<br /><br />Blocket <b>current [minute]</b> ger dig minuten som ett tal mellan 0 och 59!<br /><br />Dra den till kodområdet och klicka på den för att se aktuell minut.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-7": "Det finns dock ett annat problem, vi behöver bara visa 60 minuter på 12 lysdioder!<br /><br />På en klocka gör minutvisaren ett varv varje timme, med början vid klockan 12. När klockan är 30 minuter över timmen är minutvisaren i klockan 6, halvvägs genom ett varv.<br /><br />Lysdioderna på Cog är numrerade som timmarkeringarna på en klocka. Minutvisaren flyttar 5 minuter mellan varje siffra på en klocka. Det är logiskt eftersom 60 minuter / 12 siffror = 5 minuter per siffra.<br /><br />Så om vi använder divisionsoperatorn för att dividera den <b>aktuella [minuten]</b> med 5, vet vi vilken lysdiod som ska tändas för att visa minutvisaren på vår klocka.<br /><br />Det finns dock ytterligare ett problem - att bara dividera minuten med 5 ger normalt inte ett heltal, och vi måste ange lysdioden som ett heltal (eller heltal).<br /><br />För att gå från talet med en decimalpunkt till ett heltal måste vi avrunda det. Om det bara avrundas kommer block antingen att avrunda uppåt eller nedåt, beroende på om bråket är under 0,5, 0,5 eller högre.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-8": "För vår klocka vill vi dock inte att minutvisaren ska flyttas till nästa position förrän minutvisaren ska vara helt där. Till exempel, vid 17:09, vill vi fortfarande att minutvisaren ska vara på \"1\"-positionen.<br /><br />För att göra det måste vi alltid avrunda nedåt. Det finns ett sätt att göra det i Block - med hjälp av operatorn <b>floor</b>. Du hittar det på operatorn som som standard är <b>[abs]</b>, i rullgardinsmenyn.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-9": "Lägg till ett block för att <b>ställa in LED [[golv] för [[nuvarande [minut]] / [5]] till [blå]</b>.<br /><br />Prova det! Tryck på den gröna flaggan så visar Cog nu minutvisaren som ett blått ljus, samt timvisaren som ett rött ljus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-10": "Hur skulle du visa sekunderna också?<br /><br />Lägg till ytterligare ett <b>Set LED</b>-block men den här gången ställ in LED <b>[[floor] of [[current [second]] / [5]] på [green]</b>.<br /><br />Kom ihåg att du kan högerklicka eller hålla nere ett block för att få möjlighet att duplicera det - det kan spara mycket tid.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-11": "Testa det!<br /><br />Nu får du tre \"visare\" på klockan - röd för timmar, blå för minuter och grön för sekunder!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-12": "Låt oss göra så att tiden uppdateras automatiskt. Lägg till en <b>forever</b>-loop och ett <b>wait [5] seconds</b>-block.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-14": "Det är lite förvirrande om de olika visarna är på samma plats, försök att lägga till en liten paus mellan varje lysdiod och ändra pausen i slutet till bara 3 sekunder.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-15": "Testa det!<br /><br />Nu visar den timmar, minuter och sekunder en i taget.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-16": "Det vore coolt att kunna visa om det var am eller pm också.<br /><br />Vi skulle kunna göra detta genom att ändra klockans bakgrundsfärg beroende på om timmen är mindre än 12.<br /><br />Ersätt blocket <b>Stäng av alla lysdioder</b> med ett <b>if … else</b>-block som kontrollerar om den aktuella timmen är < 12.<br /><br />Välj sedan två olika färger för att ställa in ring-lysdioderna för pm och am. I det här exemplet har vi valt orange för am och lila för pm - färgerna måste vara olika från de du använder för att visa visarna på klockan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-17": "Testa det!<br /><br />Nu visar din klocka om det är förmiddag eller kväll genom att ändra färg!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-19": "Om du har vänner som också har ett kugghjul, kan du använda tre av dem för att visa tiden - en som visar timmar, en minuter och en sekund, så här?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-20": "Du kan också använda ett kugghjul för att visa att timmarna går långsammare, genom att gradvis tända nästa lysdiod allt eftersom minuterna går.<br /><br />Radera din tidigare klockkod och prova!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-21": "Testa det!<br /><br />Lysdioderna tänds långsamt allt eftersom tiden går – till exempel på den här bilden visar vår klocka halv sju!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-24": "Listor är specialvariabler som kan innehålla en ordnad lista av individuella variabler.<br /><br />Ta bort din tidigare kod och lägg till blocken som visas i bilden.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-25": "Tryck på den gröna flaggan för att köra koden, så får <b>lysdioder</b>-listan 12 färgkoder - en för varje lysdiod på kugghjulet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-27": "Lägg till block för att ställa in dessa variabler till positionerna för tim- och minutvisarna, med samma matematik som du gjorde tidigare.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-28": "Nu ska vi ändra objekten i listan för att ställa in färgerna för tim- och minutvisarna.<br /><br />Blocket <b>ersätt objekt</b> ändrar objektet på den angivna positionen i listan. Eftersom listan börjar numrera sina objekt vid 1 måste vi lägga till 1 till tim- och minutvariablerna.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-30": "Låt oss skapa något som bättre hanterar när tim- och minutvisarna är på samma plats.<br /><br />Lägg till ett <b>if</b>-uttryck för att kontrollera om tim- och minutvariablerna är desamma (dvs. om tim- och minutvisarna är på samma plats).<br /><br />Om så är fallet, ändra objektet i listan till en annan färg - i det här fallet har vi valt lila genom att sätta rött och blått till 255 och grönt till 0.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-32": "Testa det!<br /><br />De 12 färgkoderna i <b>lysdioder</b>-listan kommer att visas som färger på Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-33": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-34": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-35": "Nu är det dags att lägga till sekundvisaren!<br /><br />Vi gör detta i en parallell kodsektion, så lägg till ytterligare ett <b>när grön flagga klickades</b>-block.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-36": "Skapa en annan variabel som heter <b>sekund</b> och ställ in den på samma sätt som vi har ställt in sekundvisarens position tidigare.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-38": "Sätt även in andrahandskoden i en <b>för alltid</b> loop.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-39": "Din kod borde nu se ut så här – Testa det!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-8.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.name": "Utdragbart hjul",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-1": "I tidigare aktiviteter har vi sett hur vi kan använda accelerometern på Cog för att mäta i vilken riktning Cog lutar.<br /><br />Vi kan också använda den här sensorn för att räkna ut vinkeln som Cog befinner sig i.<br /><br />Vi använder det för att förvandla Cog till ett rullhjul - det är en anordning för att mäta avstånd genom att rulla ett hjul längs dem.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-2": "Lägg till ett <b>när grön flagga klickades</b>-block och en <b>för alltid</b>-loop.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-3": "Skapa en variabel som heter `vinkel`.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-4": "<b>Ställ in</b> <b>vinkeln</b> till <b>atan2</b> för [Accelerometer [Y]] och [Accelerometer [X]].<br /><br />Du hittar <b>atan2</b>-blocket i operatorkategorin.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-5": "Atan2 är en matematisk funktion som använder trigonometri för att beräkna vinkeln inuti en rätvinklig triangel när längderna på de intilliggande och motsatta benen är givna.<br /><br />Här anger vi Y-axelns och X-axelns acceleration, som är vinkelräta mot varandra (vid 90 grader), och atan2-funktionen anger vinkeln.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-6": "Testa det!<br /><br />Tryck på den gröna flaggan och håll sedan Cog vertikalt med den gula pilen pekande uppåt och rotera den runt som en ratt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-8": "För vårt rullhjul skulle vi föredra om det räknade uppåt från 0 till 360 grader.<br /><br />Lägg till dessa block inuti <b>forever loop</b>:<ul><li><b>Om</b> [[vinkel] < [0]] så</li><ul><li>Ändra [vinkel] med [360]</li></ul></ul><br />Nu istället för -180 grader kommer vår vinkel att ställas in på +180 grader.<br /><br />Den kommer att fortsätta öka därifrån upp till 360, och sedan loopa tillbaka till 0 grader.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-9": "Testa det!<br /><br />När du roterar kugghjulet kommer vinkeln att gå från 0-360 och sedan göra en loop.<br /><br />Denna matematik fungerar eftersom 360 grader är ett helt varv, så när vi lägger till ytterligare 360 ​​grader till rotationen pekar vi åt samma håll, men nu med en positiv vinkel som blir lättare att hantera när vi räknar varv.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-11": "Låt oss rita en sprite som representerar Cog!<br /><br />Börja med att lägga till en cirkel och använd sedan linjeverktyget för att skapa en hexagon runt den.<br /><br />Cirkeln är bara en guide som hjälper oss att få rätt hexagon – oroa dig inte om din hexagon inte är perfekt!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-12": "Ta bort cirkeln och ersätt den med en mindre cirkel i mitten som representerar knappen på Cog.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-16": "Testa det!<br /><br />Tryck på den gröna flaggan och rotera sedan kugghjulet – du kommer att se att spriten roterar också!<br /><br />Det finns dock ett problem – spriten är 90 grader från kugghjulet – det beror på att Blocks-gränssnittet räknar vänsterpunkten som 0 grader, medan vi behandlar uppåtpekning som 0 grader.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-19": "Låt oss lägga till en lysdiod på Cog för att visa att rotationsavkänningen fungerar.<br /><br />Lägg till två nya variabler som heter <i>LED</i> och <i>lastLED</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-20": "Vår vinkelvariabel visar en rotation från 0 till 360 grader, men vi har bara 12 lysdioder runt ringen på kugghjulet.<br /><br />Det betyder att upplösningen blir 30 grader per lysdiod, eftersom 360 grader / 12 lysdioder = 30 grader / lysdiod.<br /><br />Lägg till dessa block inuti <b>forever loop</b>:<ul><li>Sätt [LED] till [[round [angle]/[30]] mod [12]]</li></ul><br />Vi dividerar vinkeln med 30 för att få ett tal mellan 0 och 12, och avrundar det sedan eftersom vi behöver ett heltal för att ange vilken lysdiod vi ska tända.<br /><br />Eftersom våra lysdioder bara är numrerade från 0 till 11 använder vi modblocket som vi gjorde i klockaktiviteten. Detta är moduloperatorn och returnerar resten när de två talen divideras - så istället för att få siffran 12 för LED-ID får vi en 0 igen istället - vilket är vad vi vill ha eftersom LED 0 är vid klockan 12-positionen på kugghjulet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-21": "Lägg nu till dessa block inuti <b>forever-loopen</b> också:<ul><li>Om [not [[LED] = [lastLED]]] då</li><ul><li>Sätt LED [LED] till [blue]</li><li>Sätt LED [lastLED] till [black]</li><li>Sätt [lastLED] till [LED]</li></ul></ul><br />Kan du lista ut hur den nya koddelen fungerar och vad den kommer att göra?<br /><br />Vi använder variablerna LED och lastLED för att hålla reda på vilken LED som lyser och om vi behöver ändra den. När värdet på LED ändras från en iteration av loopen till nästa kommer villkoret i if-satsen att vara sant.<br /><br />När det händer tänder vi den nya LED-lampan och släcker den gamla (genom att ställa in den till svart, vilket är samma sak som att vara släckt för en lampa). Slutligen uppdaterar vi variabeln lastLED så att den är inställd för nästa gång i loopen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-24": "Testa det!<br /><br />När du roterar kugghjulet kommer lysdioden alltid att vara överst!<br /><br />När vi subtraherar variabeln [vinkel] från 360 grader, ändrar vi i praktiken vilken riktning vi roterar runt cirkeln.<br /><br />Om vi ​​till exempel roterar 10 grader medurs från 0, kommer vi att vara vid 10 grader. Om vi ​​roterar 10 grader moturs från 0, kommer vi att vara vid 350 grader.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-28": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-29": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-30": "Vi behöver några fler variabler för att beräkna den tillryggalagda sträckan.<br /><br />Skapa dessa nya variabler:<ul><li>lastAngle - vi använder den för att spåra vad vinkeln var förra gången runt forever-loopen, precis som vi gjorde med lastLED-variabeln</li><li>revolutions - vi använder den för att hålla reda på hur många fullständiga varv hjulet har roterat</li><li>totalRotation - vi lägger ihop de fullständiga och partiella varven för att få den totala rotationsmängden i grader</li><li>distance - vi konverterar den totala rotationen till ett avstånd</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-32": "Vi behöver också spåra varv i motsatt riktning. När det händer kommer vinkeln att hoppa från 0 -> 360 grader.<br /><br />Lägg till dessa block inuti <b>forever-loopen</b>:<ul><li>Om [[vinkel] - [lastAngle]] > [180]] så</li><ul><li>Ändra [varv] med [-1]</li></ul></ul><br />Det betyder att om vinkeln hoppar upp mycket plötsligt minskar vi antalet varv med 1.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-33": "Lägg till ett <b>set [lastAngle] to [angle]</b>-block inuti <b>forever-loopen</b>.<br /><br />Det gör lastAngle-variabeln redo för nästa gång loopen körs.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-34": "Nu är det dags att räkna ut hur långt hjulet har rullat!<br /><br />Lägg till det här blocket i <b>forever-loopen</b>:<ul><li>Sätt [totalRotation] till [[[revolutions] * [360]] + [[angle]]]</li></ul><br />Detta lägger till 360 grader för varje rotation till den aktuella vinkelmätningen för att få den totala rotationen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-35": "Lägg nu till det här blocket:<ul><li>Sätt [avstånd] till [[[totalRotation] / [360]] * [omkrets]]</li></ul><br />Variabeln totalRotation ger den totala rotationen i grader, så genom att dividera den med 360 får vi antalet varv som ett rationellt tal - ett tal som kan ha saker efter decimalkommat snarare än bara heltal.<br /><br />Att multiplicera det med omkretsen ger oss den totala sträckan som hjulet har rullat!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-36": "Testa det!<br /><br />Sätt ett kugghjul inuti kartonghjulet och försök att rulla det!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-38": "Vi måste ta med startvinkeln i beräkningen av den totala rotationen genom att subtrahera den från den aktuella vinkeln.<br /><br />Ändra blocket som ställer in variabeln totalRotation till:<ul><li>Sätt [totalRotation] till [[[varv] * [360]] + [[vinkel] - [startvinkel]]]</li></ul><br />Detta subtraherar startvinkeln från den aktuella vinkeln, så att vi kan börja räkna från vilken vinkel kugghjulet än befinner sig i när du trycker på knappen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-39": "Testa det!<br /><br />Ta en linjal och placera ditt kugghjul bredvid den vid 0-markeringen.<br /><br />Tryck på knappen för att återställa kugghjulet och rotera sedan hjulet längs linjalen – du bör märka att avståndsvariabeln håller reda på hur långt du har rullat.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-41": "Lägg sedan till ett <b>add [distance] to [distances]</b>-block precis efter blocket för att trycka på knappen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-42": "Testa det!<br /><br />Du kan mäta avstånd och trycka på knappen för att registrera dem i listan så att du kan titta på dem när du kommer tillbaka till skärmen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-9.step-43": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.name": "Flygande fladdermusspel",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.description": "Nu gör vi ett nytt spel!<br /><br />Den här gången ska vi göra ett spel om en fruktfladdermus som är ganska kräsen med vad den äter.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-2": "Vi ska få fladdermusen att flyga åt vänster och höger med hjälp av lutningsavkänningen på kugghjulet igen.<br /><br />Som du har gjort tidigare, skapa en variabel som heter <b>ay</b>.<br /><br />Vi kommer också att hålla koll på poängen i det här spelet, så skapa en variabel som heter <b>score</b> också.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-3": "Lägg till dessa block:<ul><li>När grön flagga klickas</li><ul><li>Sätt poäng till [0]</li><li>För alltid</li><ul><li>Sätt [ay] till [Accelerometer [Y]]</li><li>Sända [uppdatera position]</li></ul></ul></ul><br />De kommer att:<ul><li>Låta användaren starta spelet genom att trycka på den gröna flaggan</li><li>Återställa poängen när spelet startar</li><li>Uppdatera variabeln ay till värdet på accelerometerns Y-axel i en loop och sända meddelandet om uppdatering av position</li></ul><br />Vi använder variabeln <b>ay</b> och meddelandet <b>uppdatera position</b> för att ändra positionen för vår sprite.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-4": "Nu lägger vi till spriten.<br /><br />Tryck på knappen <b>Välj en sprite</b> och välj sedan fladdermusspriten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-5": "Med Fladdermusspriten vald, lägg till dessa block:<ul><li>När jag får [uppdatera position]</li><ul><li>Sätt x till [[ay] * 200]</li></ul></ul><br />Detta innebär att varje gång <b>ay</b>-variabeln uppdateras, flyttar vi även fladdermusens position.<br /><br />Variabeln ay varierar mestadels mellan -1 och 1, så genom att multiplicera med 200 ställer vi in ​​x-positionen till att vara mellan -200 och 200.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-6": "Testa det!<br /><br />Tryck på den gröna flaggan och luta sedan kugghjulet från sida till sida, så rör sig även bat!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-7": "Låt oss göra vår fladdermus lite mindre och få den att falla nerför skärmen som standard.<br /><br />Lägg till dessa block:<ul><li>När den gröna flaggan klickas</li><li>Ställ in storleken till [50]%</li><li>För alltid</li><ul><li>Ändra y med [-10]</li><li>Vänta [0,1] sekunder</li></ul></ul></ul><br />När du nu trycker på den gröna flaggan och kör programmet kommer fladdermusen långsamt att falla nerför skärmen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-8": "Låt oss göra ett sätt för fladdermusen att flaxa med vingarna och klättra igen.<br /><br />Välj Kugge igen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-11": "Hitta nästa kostymblock i kategorin Utseenden.<br /><br />Försök att klicka på det – du borde se att fladdermusens sprite ändras till en i en annan pose!<br /><br />Klicka på det några gånger – fladdermusspriten har fyra olika poser, som kallas kostymer i Block-gränssnittet.<br /><br />Vi kan använda dessa kostymer för att animera rörelser på fladdermusen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-15": "Låt oss lägga till en roligare bakgrund också – fladdermöss lever ofta i skogen och gillar nattetid, så låt oss lägga till en skogsbakgrund.<br /><br />Klicka på knappen <b>Välj en bakgrund</b>.<br /><br />Välj sedan skogsbakgrunden.<br /><br />Nu kan du flyga din fladdermus genom skogen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-16": "Okej - det är dags att göra det här mer till en lek!<br /><br />Låt oss börja med att göra en inköpslista för vår bat.<br /><br />Gå till kategorin <i>Variabler</i> och klicka på knappen <b>Skapa en lista</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-18": "Vi kan lägga till saker i listan med hjälp av de nya blocken som har dykt upp i variabelsektionen.<br /><br />Först måste vi se till att bat har en tom lista när spelet startar.<br /><br />Lägg till dessa block:<ul><li>När den gröna flaggan klickas</li><li>Ta bort all [frukt]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-20": "Gör samma sak igen för att lägga till ett <b>äpple</b> i listan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-23": "Hitta <b>objektet [1] i blocket [frukt]</b> och dra det till kodningsområdet.<br /><br />Om du trycker på det ser du att det returnerar (matar ut) objektet som finns på den angivna positionen i listan - i det här fallet banan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-24": "Hitta längden på blocket <b>[fruit]</b> och dra det till kodningsområdet.<br /><br />Om du trycker på det ser du att det returnerar antalet objekt i listan - i det här fallet 2.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-26": "Hur kan vi få koden att välja ett slumpmässigt objekt från listan?<br /><br />Använd blocket <b>pick random</b> från kategorin Operatorer och ställ in det att välja ett slumpmässigt tal mellan 1 och <b>length of [fruit]</b>. Lägg sedan hela det slumpmässiga blocket i <b>item</b>-blocket, så här:<br /><br />När du trycker på den knappen ser du att den slumpmässigt väljer antingen banan eller äpple.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-27": "Lägg till dessa block under blocket <b>add [apple] to [fruit]</b>:<ul><li>Upprepa [10]</li><ul><li>Sätt [fruit] på [item [pick random [1] to [length of [fruit]]] of [fruit]]</li><li>Sänd [show fruit]</li><li>Tänk på [fruit] i [5] sekunder</li></ul></ul><br />Du hittar blocket think i avsnittet Looks och kan lägga till variabeln fruit till det.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-28": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-29": "Nu lägger vi till de där frukterna i vårt spel.<br /><br />Klicka på knappen <b>Välj en sprite</b> och välj Bananer-spriten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-30": "Dra bananerna till en bättre plats på skärmen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-32": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-33": "Om frukten är korrekt ökar vi poängen med 1 och skickar rätt meddelande.<br /><br />Annars minskar vi poängen med 1 och skickar fel meddelande.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-34": "För att undvika att få (eller förlora!) poäng mer än en gång, kommer vi att få bananerna att gömma sig när fladdermusen har nått dem.<br /><br />Lägg till ett <b>hide</b>-block efter if… else-blocket - det betyder att bananerna alltid kommer att gömma sig när fladdermusen rör vid dem.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-35": "Eftersom vi gömmer bananerna behöver vi ha ett sätt att visa dem igen.<br /><br />Tidigare lade vi till kod för att skicka ett <b>visa frukt</b>-meddelande varje gång fladdermusen plockar en ny frukt. Vi använder det som en signal för att visa frukten.<br /><br />Lägg till dessa block:<ul><li>När jag får [visa frukt]</li><li>Visa</li></ul><br />Nu när fladdermusen plockar en ny frukt kommer bananerna att visas igen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-36": "Lägg till ytterligare en sprite – den här gången Apple-spriten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-37": "Flytta äppelspriten till andra sidan av scenen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-39": "Med Apple-spriten vald, ändra koden så att den kontrollerar om fruit-variabeln är lika med <b>apple</b> istället.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-41": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-42": "Lägg till dessa block:<ul><li>När jag får [korrekt]</li><li>Sätt [ring]-lysdioderna på [grönt]</li><li>Spela tonen [C6] i [0,5] sekunder</li><li>Släck alla lysdioder</li></ul><br />Och<br /><br /><ul><li>Sätt [ring]-lysdioderna på [rött]</li><li>När jag får [felaktigt]</li><li>Spela tonen [C4] i [0,5] sekunder</li><li>Släck alla lysdioder</li></ul><br />Dessa kommer att använda de korrekta och felaktiga meddelandena som du kodade tidigare för frukterna, och få Cog att lysa och spela ett ljud varje gång du samlar en frukt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-43": "Testa det!<br /><br />Nu får du feedback från Cog när du samlar frukt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-10.step-44": "Bra jobbat!<br /><br />Du har lärt dig hur man använder kostymer i Block för att animera sprites.<br /><br />Du lärde dig också hur man skapar en lista och väljer föremål från den, och använder dem som en del av ett spel.<br /><br />Nästa steg:<ul><li>Kan du lägga till fler frukter?</li><li>Kan du lägga till något som fladdermusen aldrig vill äta?</li><li>Kan du göra spelet svårare med tiden?</li><li>Kan du få Cog att visa poängen i slutet?</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.name": "Intervalltimer Stoppur",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-2": "Börja med att skapa en lista som heter <b>tider</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-3": "Lägg till dessa block:<br /><ul><li>När du trycker på knappen</li><li>Lägg till <b>timer</b> till <b>tider</b></li><li>Återställ timern</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-7": "Nu ska vi ändra vad knappen gör baserat på stoppurets tillstånd - d.v.s. beroende på om det är startat eller inte.<br /><br />Ändra koden under blocket <b>vid knapptryckning</b> till:<br /><ul><li>Vid knapptryckning</li><li>Om <b>startad</b> = <b>true</b> då</li><ul><li>Lägg till <b>timer</b> till <b>tider</b></li></ul><li>Annars</li><ul><li>Radera alla <b>tider</b></li></ul><li>Återställ timer</li></ul><br />Så, om stoppuret har startats kommer varvtiden att läggas till i listan. Om inte, kommer listan över gamla tider att rensas så att en ny lista kan startas.<br /><br />I båda fallen återställs timern och är redo att registrera nästa varvtid.<br /><br />Kan du se vad som saknas i den här koden?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-10": "Det fungerar bra som stoppur!<br /><br />Men det är lite knepigt för våra användare att veta vilket tillstånd stoppuret är i - är det startat eller stoppat?<br /><br />Låt oss lägga till lite feedback för det.<br /><br />I blocken <b>vid skakning</b>, under blocket <b>set started to false</b>, lägg till dessa block:<br /><ul><li>Stäng av alla lysdioder</li><li>Ställ in lysdioderna på <b>knappen</b> till <b>rött</b></li></ul><br />Nu när du skakar kugghjulet för att återställa det, kommer det som lysdioderna gjorde att stoppas och bara tända knappen för att visa att den är stoppad och redo att startas.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-11": "Vi behöver också lägga till feedback som visar när knappen trycks ned korrekt och när stoppuret är igång.<br /><br />I slutet av <b>knapptryckning</b>-blocken, lägg till dessa block:<br /><ul><li>Ställ in <b>ring</b>-lysdioderna till <b>grönt</b></li><li>Spela tonen <b>C6</b> i <b>0,5</b> sekunder</li><li>Ställ in <b>ring</b>-lysdioderna till <b>blått</b></li><li>Ställ in <b>ring</b>-lysdioderna till mönstret <b>Spin1</b></li></ul><br />Nu varje gång du trycker på knappen får du ett bekräftande ljud och lampan blinkar grönt innan de börjar snurra blått för att indikera att stoppuret är igång.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-12": "Testa det!<br /><br />Det är mycket enklare nu att se om stoppuret är stoppat eller startat.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-13": "Kan du hitta felet i vår kod?<br /><br />Vad händer om du försöker spela in tider på mindre än 0,5 sekunder?<br /><br />Det kommer du inte att kunna - eftersom koden från föregående knapptryckning fortfarande kommer att köras och spela noten.<br /><br />Hur kan vi åtgärda detta, samtidigt som vi fortfarande spelar noten i 0,5 sekunder?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-14": "Ett sätt att åtgärda detta är att använda broadcast-blocket för att skicka ett meddelande som triggar ljus och ljud istället.<br /><br />Kommer du ihåg hur broadcast- och wait-blocken inte slutfördes förrän all kod som den utlöste var klar? Broadcast-blocket gör inte det, så fort den har skickat knapptryckningsmeddelandet slutförs den.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-15": "Testa det!<br /><br />Det är mycket enklare nu att se om stoppuret är stoppat eller startat.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-17": "Vi beräknar medelvärdet efter att vi har stoppat stoppuret genom att skaka kugghjulet.<br /><br />Lägg till dessa block under blocket <b>Ställ in knappens lysdioder på rött</b>:<br /><ul><li>Ställ in <b>medelvärde</b> till 0</li><li>Ställ in <b>räknaren</b> till 0</li></ul><br />Det gör våra variabler redo för att beräkna medelvärdet.<br /><br />Fundera nu på hur du skulle beräkna medelvärdet av en lista med tal?",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-19": "Vi använder variabeln counter för att hålla reda på var vi befinner oss i listan medan vi summerar alla gånger.<br /><br />Lägg till ett block i repetitionsloopen för att <b>ändra counter med 1</b>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-20": "I block är det första objektet i listan objekt 1, så första gången genom repetitionsslingan ändras räknarvariabeln från 0 till 1. Andra gången genom loopen ändras den till 2, etc.<br /><br />Vi använder sedan den räknaren för att öka medelvärdesvariabeln med nästa tal i listan.<br /><br />Lägg till blockets <b>ändringsmedelvärde per objekträknare av gånger</b>.<br /><br />När repetitionsslingan är klar har den itererat igenom varje objekt i listan och lagt till varje tal till medelvärdesvariabeln.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-21": "Okej, det går bra, men nu lagrar medelvärdesvariabeln faktiskt summan av alla våra tider.<br /><br />För att få medelvärdet måste vi dividera det med antalet objekt i listan.<br /><br />Lägg till ett <b>set average till [average / counter]</b>-block.<br /><br />Räknarevariabeln är för närvarande inställd på att ha räknat hur många objekt som fanns i listan, så vi kan använda den som divisor för att få medelvärdet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-22": "Testa det!<br /><br />När du nu skakar kugghjulet kommer medelvärdesvariabeln att ställas in på medelvärdet av alla gånger du registrerat!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-11.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.name": "Quiz-spel",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-1": "Nu gör vi ett frågesport! <br/><br/>Vi lägger in en lista med frågor och svar och använder kugghjul som summer för deltagarna. <br/><br/>Den här aktiviteten använder flera kugghjul anslutna till ett program. Om möjligt, turas om att dela kugghjul mellan små grupper för att köra programmet. <br/><br/>Om du bara har tillgång till ett kugghjul, fundera på hur du kan ändra koden för att använda IR-sensorerna på kugghjulet som summer också, så att tre personer kan spela på ett kugghjul.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-3": "Vi behöver skapa tre listor - en för *frågor*, en för *svar* och en för att spåra deltagarnas *poäng*. <br/><br/>Lägg till tre listor som heter *frågor*, *svar* och *poäng*.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-4": "Lägg till dessa block för att fylla i listan med frågor. <br/><ul><li>När den gröna flaggan klickas</li><li>Ta bort alla [frågor]</li><li>Lägg till [Vad är 2+2?] till [frågor]</li></ul>Lägg till så många frågor du vill genom att lägga till fler <i>lägg till [] till [frågor]</i> block. <br/><br/>Gör sedan samma sak för svaren och se till att dina frågor stämmer överens med dina svar.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-5": "Testa det genom att trycka på den gröna flaggan. <br/><br/>Fråge- och svarslistorna fylls i – ta en minut för att kontrollera att svaren motsvarar rätt frågor. <br/><br/>När du är nöjd klickar du i kryssrutorna bredvid svars- och frågelistorna för att dölja dem.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-8": "Vi skulle bara kunna lägga till ett vänteblock före upprepningsslingan, men det är inte särskilt snyggt. <br/><br/>Vi skulle också kunna lägga till all kod i en stor lång sekvens, men det blir ganska svårt att hantera. <br/><br/>Alternativt kan vi skapa våra egna block och se till att vi kör dem i den ordning vi vill. <br/><br/>Klicka på knappen Skapa ett block.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-10": "Ett nytt block kommer att visas i blockpaletten, och i kodningsområdet ser du ett hattblock med titeln <i>define [fyll i frågor]</i>. <br/><br/>Oavsett vilken kod vi lägger under det blocket kommer den att köras när vi anropar blocket <i>Fyll i frågor</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-11": "Ersätt blocket <i>När grön flagga klickades</i> med det nya blocket <i>define [Fyll i frågor]</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-14": "Testa det – spriten läser upp frågorna en efter en. <br/><br/>Du kan behöva flytta spriten till skärmens nedre vänstra hörn för att ge mer plats åt frågorna.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-15": "Låt oss lägga till ett sätt att ringa in och svara på frågan. <br/><br/>Välj kugghjul.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-17": "Lägg till dessa block: <ul><li>När grön flagga klickas</li><li>Sätt [spelarens nummer] till [1]</li></ul>Senare kommer vi att lägga till fler kugghjul och ställa in deras spelarnummer annorlunda.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-18": "Vi vill bara aktivera buzzern när en fråga har ställts, så vi använder meddelandet <i>svara nu</i> som sändes när spriten ställde en fråga. <br/><br/>Lägg till dessa block: <ul><li>När jag får [svara nu]</li><li>Ställ in [ring]-lysdioderna på [blå]</li><li>Ställ in [ring]-lysdioderna på mönstret [Spin1]</li><li>Vänta tills [[[knapp klickad] = [true]] eller [[summer] > [0]]]]</li></ul>Du måste skapa en ny variabel som heter <b>summer</b> - vi använder den för att spåra vilken summer som trycks ner först. <br/><br/>Du hittar <i>eller</i>-blocket i kategorin Operatorer. <br/><br/>Villkoret i \"vänta till\"-blocket är antingen att knappen klickas eller att summervariabeln är större än 0. <br/><br/>På så sätt kan vi vänta tills antingen knappen på detta kugghjul trycks ner, eller en annan summer trycks ner och summervariabeln ställs in någon annanstans.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-19": "Lägg till dessa block: <ul><li>Om [[button clicked] = [true]] then</li><ul><li>Sätt [buzzer] till [player number]</li><li>Sätt [ring] LED-lamporna till [green]</li></ul>Annars</li><ul><li>Släck alla LED-lampor</li></ul></ul>Med den här koden, om det var knappen på detta kugghjul som trycktes ner först, ställer vi in ​​<i>buzzer</i>-variabeln till detta <i>spelarens nummer</i> och sätter lamporna på kugghjulet gröna. <br/><br/>Annars betyder det att någon annan kom dit först, eller att tiden fick slut, och vi släcker bara lamporna istället.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-20": "Gå tillbaka till spriten du lade till tidigare.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-23": "Under blocket <i>define [check answer]</i>, lägg till ett <i>if … else</i>-block med villkoret <i>[buzzer] > [0]</i>. <br/><br/>Detta kontrollerar om en summer trycktes ner i tid eller inte.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-24": "Om summern trycks ner ger vi personen som tryckte på den några sekunder på sig att svara på frågan. <br/><br/>Lägg till dessa block i if-villkoret: <ul><li>Broadcast [buzzed]</li><li>Säg [join [Ja, spelarnummer] [summer]] i [6] sekunder</li></ul>Blocket <i>join</i> finns i kategorin Operatorer, det sammanfogar två textklumpar (eller strängar).",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-25": "Lägg även till dessa block: <ul><li>Säg [join [join [Sa du] [item [1] of [answers]] [? Tryck grönt för ja och rött för nej]]</li><li>Sänd ut [bekräfta svar] och vänta</li></ul>Kom ihåg hur vi tidigare har <i>kapslat if</i>-villkor, du kan också <i>kapsla join</i>-operatorer om du vill koppla ihop fler än två textsträngar. <br/><br/>Så, efter att ha gett spelaren 6 sekunder att säga sitt svar ut för de andra deltagarna att höra, kommer spriten att fråga dem om de sa rätt svar, taget från svarslistan. Den kommer sedan att be dem trycka grönt för ja och rött för nej, skicka meddelandet <i>bekräfta svar</i> och vänta innan de fortsätter.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-27": "Lägg till dessa block: <ul><li>När jag får [bekräfta svar]</li><li>Om [[summer] = [spelarens nummer] då</li></ul>. <br/><br/>Senare kommer vi att ha fler kugghjul anslutna och köra den här koden. Detta if-villkor kommer att kontrollera om det var detta kugghjul som var den framgångsrika summern.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-28": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-29": "Lägg till dessa block: <ul><li>Vänta tills [[[obstacle sensed [left]] = [sant]] eller [[obstacle sensed [right]] = [sant]]]</li><li>Om [[obstacle sensed [right]] = [sant]] då</li></ul>Ersätt objektet [player number] of [scores] med [[item [1] of [scores]] + [1]]<br/><br/>Annars<br/><ul><li>Ersätt objektet [player number] of [scores] med [[item [1] of [scores]] - [1]]</li></ul>Släck alla lysdioder. <br/><br/>Blocket <i>vänta tills</i> väntar tills antingen vänster eller höger IR-sensor känner av ett objekt - det är här vi väntar på att spelaren ska välja om de fick svaret rätt eller fel. <br/><br/>Om de svarade rätt har de täckt över rätt IR-sensor, eftersom det är där vi satte det gröna ljuset. <br/><br/>Om så är fallet ersätter vi deras poäng på poängtavlan med samma siffra plus 1. <br/><br/>Om inte, ersätter vi deras poäng på poängtavlan med samma siffra minus 1. <br/><br/>På så sätt ökar vi deras poäng om de svarar rätt på frågan och minskar den om de svarar fel. <br/><br/>Så var försiktig - om du svarar men inte vet svaret förlorar du poäng!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-30": "Vi bör också lägga till en nedräkning så att spelaren vet hur lång tid de har på sig att svara. <br/><br/>Vi använder <i>buzzed</i>-meddelandet som vi skapade tidigare för att göra detta. <br/><br/>Skapa en annan variabel som heter <i>ledID</i>, och gör den återigen <i>Endast för denna sprite</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-32": "Testa det! <br/><br/>Frågorna ställs en efter en. Om du trycker på knappen får du 6 sekunder på dig att svara medan kugghjulet visar en nedräkning, och sedan blir du ombedd att välja rött eller grönt beroende på om du svarade fel eller rätt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-33": "Vi måste fortfarande göra något om ingen ringer in i tid för en fråga, och vi måste säga vem vinnaren är i slutet. <br/><br/>Gå tillbaka till spriten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-34": "I det tomma <i>else</i>-villkoret i <i>check answer</i>-definitionen, lägg till dessa block: <ul><li>Säg [För långsamt!] i [2] sekunder</li><li>Säg [join [Svaret var] [item [1] of [answers]] i [5] sekunder</li></ul>På så sätt, om ingen surrar i tid, kommer spriten att läsa upp det rätta svaret för alla.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-36": "Ett nytt kugghjul har lagts till med samma kod som det första!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-37": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-38": "Koppla in ett andra kugghjul och prova!<br/><br/>Nu får det kugghjul som surrar först efter att en fråga ställts chansen att svara.<br/><br/>Du kan lägga till fler spelare genom att duplicera kugghjulet flera gånger!<br/><br/>Kom ihåg att uppdatera variabeln <i>spelarens antal</i> på varje kugghjul.<br/><br/>Du måste också ställa in variabeln antal spelare så att den matchar <i>antalet</i> spelare.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-39": "Okej!<br/><br/>Nu måste vi lista ut vem vinnaren är i slutet av quizet. <br/><br/>Gå tillbaka till sprite-koden <br/><br/>Skapa ett annat block som heter <i>tillkännage vinnare</i> och anropa det efter huvudfrågeslingan",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-40": "Först ska vi räkna ut vad den högsta poängen är. <br/><br/>Skapa ett annat block som heter <i>find max score</i>. <br/><br/> Under blocket <i>define [find max score]</i>, lägg till dessa block:<ul><li>set [maxScore] to [item [1] of [scores]]</li><li>set [playerID] to [1]</li><li>repeat [length of [scores]]</li><ul>if [[item [playerID] of [scores]] > [maxScore]] then</li><ul><li>set [maxScore] to [item [playerID] of [scores]]</li><ul><li>change [playerID] by [1]</li></ul></li></ul></li></ul><br/><br/> Du måste ange variablerna <i>maxScore</i> och <i>playerID</i>. <br/><br/>Denna kod kommer att <li>iterera</li> sig igenom resultattavlan - stega igenom den en post i taget - och ställa in variabeln <i>maxScore</i> på den högsta poängen den hittar längs vägen.<br/><br/>Klicka på den delen av koden för att köra den - variabeln <i>maxScore</i> ska slutligen ställas in på det högsta värdet i poänglistan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-41": "Nu när vi vet vad den högsta poängen är, behöver vi veta hur många spelare som fick den poängen. <br/><br/>Skapa ett nytt block som heter <i>hur många spelare har poäng [poäng]</i> - du kan göra detta genom att trycka på knappen <i>Lägg till ett inmatningsnummer eller en text</i> i fönstret Skapa ett block.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-42": "Lägg till dessa block i blocket <i>define [how many players with score [score]]</i>:<ul><li>set [result] to [0]</li><li>set [playerID] to [0]</li><li>repeat [length of [scores]]</li><ul><li>change [playerID] by [1]</li><li>if [[item [playerID] of [scores]] = [score]] then</li><ul><li>change [result] by [1]</li></ul></ul></ul>Detta nya block (eller funktion) skiljer sig lite från de vi skapade tidigare, eftersom det tar in en parameter - poängen vi vill leta efter. <br/><br/>Du kan dra <i>score</i>-parametern ner från define-blocket för att använda den i din kod. Det är som en variabel, men den kan bara användas i den här funktionen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-43": "För att testa det, kör blocket \"how many players with score []\" med parametern \"score\" satt till ett tal som finns i din poänglista. Resultatvariabeln kommer att ställas in på antalet spelare med den poängen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-44": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-45": "Inuti <i>else</i>-delen av <i>if … else</i>-blocket, lägg till dessa block<ul><li>Säg [join [join [There are ] [result]] [winners!]] i [5] sekunder</li><li>Säg [join [With scores of ] [maxScore]] i [5] sekunder</li><li>Ställ in [winners] till [join [Player] [item # of [maxScore] in [scores]]</li><li>Ställ in [playerID] till [item # of [maxScore] in [scores]</li><li>Upprepa tills [[playerID] = [length of [scores]]</li><li>Ändra [playerID] med [1]</li><li>Om [[item [playerID] of [scores] = [maxScore]] då</li><li>Ställ in [winners] till [join [join [winners] [and Player]] [playerID]</li><li>Säg [winners]</li></ul>Om det finns fler än en vinnare, kommer spriten att säga hur många det finns och sedan lista dem. Variabler kan lagra mer än bara siffror - här används variabeln <i>winners</i> för att bygga upp en textsträng som listar alla vinnare.</br></br><i>repeat until</i>-slingan itererar från den första poängen i listan som matchar variabeln <i>maxScore</i> till slutet. Varje gång den hittar en annan poäng som matchar, lägger den till den spelaren i variabeln <i>winners</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-46": "Testa det! <br/> Nu i slutet av quizet listas vinnarna, även om det blir oavgjort!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-13.step-47": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.name": "Rörelsespårare",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.description": "Låt oss göra en rörelsespårare!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-2": "Skapa en lista som heter <i>ax</i><br/><br/>Vi använder denna för att lagra de senaste avläsningarna från accelerometerns x-axel.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-5": "Vi behöver ett sätt att avgöra om den data vi har samlat in visar om kugghjulet rör sig eller inte.<br/><br/>Ett enkelt sätt att göra det är att titta på hur mycket det förändras - rörelse bör betyda acceleration, vilket accelerometern kommer att mäta.<br/><br/>Vi skapar ett nytt block som heter <i>get range</i>, vilket kommer att räkna ut hur mycket data i ax-listan varierar.<br/><br/>Lägg till dessa block:<ul><li>Definiera [get range]</li><li>Sätt [rangeCounter] till [0]</li><li>Sätt [min] till [item [1] of [ax]]</li><li>Sätt [max] till [item [1] of [ax]]</li><li>Upprepa [length of [ax]]</li><ul><li>Ändra [rangeCounter] med [1]</li><li>Sätt [sample] till [item [rangeCounter] of [ax]]</li><li>Om [[sample] < [min]] sedan</li><ul><li>Sätt [min] till [prov]</li></ul><li>Om [[prov] > [max]] sedan</li><ul><li>Sätt [max] till [prov]</li></ul><li>Sätt [resultat] till [[max] - [min]]</li></ul></ul><br/>Denna funktion kommer nu att iterera igenom hela ax-listan ett prov i taget och välja ut minimi- och maximivärdena.<br/>I slutet kommer den att ställa in resultatvariabeln till skillnaden mellan de två.<br/>Mer rörelse innebär att ett större värdeintervall registreras.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-6": "Låt oss lägga till block för att tolka det intervallet och klassificera det som rörelse eller inte.<br/><br/>Lägg till dessa block:<ul><li>När den gröna flaggan klickas</li><li>Sätt [motionThreshold] till [0.2]</li><li>För alltid</li><ul><li>Vänta [1] sekunder</li><li>Hämta intervall</li><li>Om [[result] > [motionThreshold]] då</li><ul><li>Sätt [motionDetected] till sant</li></ul><li>Annars</li><ul><li>Sätt [motionDetected] till falskt</li></ul></ul></ul><br/>Här har vi definierat ett tröskelvärde - ett värde som vi jämför intervallet av accelerometerprover mot. Om intervallet är högre än detta tröskelvärde säger vi att vi har detekterat rörelse, och om inte så säger vi att vi inte har det.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-7": "Testa det!<br/>Nu tittar programmet en gång i sekunden på listan över prover från accelerometern och avgör om det tror att det har förekommit rörelse eller inte.<br/><br/>Det tar de 10 individuella accelerometeravläsningarna (eller proverna) och beräknar en enda sann eller falsk detektering för rörelse.<br/><br/>Vi kan ändra de variabler vi har ställt in för att justera detta beteende.<br/><br/>Till exempel kan vi ändra <i>motionThreshold</i> för att göra programmet mer eller mindre känsligt för rörelser.<br/><br/>Vi kan också ändra <i>numSamples</i> för att variera hur lång en ögonblicksbild av rörelse vi tittar på varje gång. Med 10 prover tagna med 0,1 sekunders intervall tittar vi på om det har förekommit rörelse under den senaste sekunden, men om du ökar <i>numSamples</i> skulle det kontrollera efter rörelse över ett längre fönster.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-9": "Lägg till en annan variabel som heter activeSeconds.<br/>Precis innanför den där <i>forever</i>-loopen, lägg till ett <i>set [activeSeconds] to [0]</i>-block, och sedan ett <i>repeat [60]</i>-block som omger resten av koden i forever-loopen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-11": "Skapa en ny lista som heter activeMinutes<br/>Precis efter <i>repeat [60]</i>-slingan (men fortfarande inuti forever-slingan), lägg till dessa block:<ul><li>Om [[activeSeconds] > [activeSecondsThreshold]] så</li><ul><li>Lägg till [true] till [activeMinutes]</li></ul><li>Annars</li><ul><li>Lägg till [false] till [activeMinutes]</li></ul></ul><br/>Nu, efter var 60:e sekund - alltså en gång i minuten - jämför vi det totala antalet aktiva sekunder i den minuten med <i>activeSecondThreshold</i>-variabeln för att klassificera om vi tror att minuten som helhet har varit aktiv eller inte.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-13": "Testa det!<br/><br/>Varje gång rörelse detekteras i mer än 30 sekunder under varje 60-sekundersfönster kommer den minuten att registreras som sann i <i>activeMinutes</i>-listan.<br/><br/>Annars kommer ett <i>falskt</i> att registreras.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-14": "Låt oss visa användaren lite annan användbar information.<br/>Skapa två nya variabler som heter <i>totalActiveSeconds</i> och <i>totalSeconds</i><br/>Initiera dem båda genom att sätta dem till 0 i början av programmet.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-15": "Kan du komma på var du borde lägga till block för att öka dessa nya variabler?<br/><br/>En potentiell plats är som visas här, där <i>totalActiveSeconds</i> ökas varje gång <i>activeSeconds</i> ökas, och <i>totalSeconds</i> ökas vid varje iteration av <i>repeat [60]</i>-slingan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-17": "Låt oss rapportera en del av denna information på ett mer användarvänligt sätt.<br/><br/>Lägg till ett <i>broadcast [rapportstatistik]</i>-block precis före slutet av <i>forever</i>-loopen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-18": "Lägg till en ny sprite – du kan välja vilken du vill. I det här exemplet har vi valt en robot.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-19": "Lägg till dessa block:<ul><li>När jag får [rapportstatistik]</li><li>Säg [join [join [join [join [Du har varit aktiv i ] [totalActiveSeconds]] [av ]] [totalSeconds]] [ sekunder]] i [5] sekunder</li><li>Säg [join [join [Det är [runda [[[totalActiveSeconds] / [totalSeconds]] * 100]]] [% av tiden]] i [5] sekunder</li></ul><br/>Nu, en gång i minuten, kommer spriten att berätta för användaren hur aktiv de har varit och vad det är som en procentandel av den tid som har gått.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-20": "Testa det!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-22": "Testa det!<br/><br/>Du kommer förmodligen att upptäcka att de två rapporterade procenttalen skiljer sig från varandra – det beror på de två olika sätten vi grupperade och klassificerade informationen på.<br/><br/>Varje gång någon programmerar ett system för att konvertera många individuella avläsningar till enklare statistik måste de fatta beslut om hur de ska göra det – det är vårt jobb som programmerare att försöka se till att sammanfattningen är så korrekt som möjligt och inte vilseledande.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-25": "Lägg till dessa block:<ul><li>När jag tar emot [signal användare]</li><li>Upprepa [3]</li><ul><li>Ställ in [ring]-lysdioderna på [röd]</li><li>Spela tonen [A5] i [0,5] sekunder</li><li>Ställ in [ring]-lysdioderna på [vit]</li><li>Vänta [0,5] sekunder</li></ul><li>Släck alla lysdioder</li></ul><br/>Nu kommer även Cog att pipa och tändas för att låta användaren veta att de borde röra sig mer.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-14.step-27": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.name": "ML-gestavkänning",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.description": "Låt oss skapa en modell för gestavkänning!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-2": "Klicka på fliken <i>Maskininlärning</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-3": "Välj ikonen <i>+</i> och klicka på alternativet <i>Ny accelerometermodell</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-4": "Tryck på <i>Fortsätt</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-5": "Data vi kommer att använda för att träna den här modellen kommer att vara accelerometerns tre axlar. <br/><br/> Du kan se dessa data i realtid på den här skärmen, precis som i sensorpanelen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-6": "Skriv in ett modellnamn för <i>gesture</i> och skriv sedan in ordet <i>nothing</i> i rutan Skapa ny klass.<br/>Tryck på +-knappen för att skapa den nya klassen.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-7": "Det skapar en klass som heter *ingenting*. <br/>Vi har en klass för varje typ av rörelse vi vill detektera – och det innebär också att vi har ett basfall med ingen rörelse.<br/><br/>Vi behöver nu samla in träningsdata för *ingenting*-klassen. Du kan samla in dataprover för accelerometermodeller som denna genom att hålla ner knappen på Cog.<br/><br/>Lyft upp Cog, håll den stadig och tryck sedan på knappen i ett par sekunder.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-9": "Skapa nu en annan klass som heter swoosh",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-10": "Den här gången vill du spela in exempel på att göra en långsam susande rörelse från sida till sida.<br/>Flytta kugghjulet försiktigt fram och tillbaka och håll knappen nedtryckt för varje enskild rörelse - släpp taget när rörelsen är klar.<br/>Rörelsen du spelar in här kommer förhoppningsvis att kännas igen senare och klassificeras som ett susande ljud.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-11": "Återigen, se till att du har minst 10 prover",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-12": "Skapa nu en annan klass som heter *flick*",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-14": "Se till att du har minst 10 samplingar igen.<br/>Du kommer förmodligen att se att för <i>ingenting</i>-klassen är linjerna på de enskilda samplingarna ganska plana. I <i>swoosh</i> finns det en som gör en stor kurva ner och upp.<br/>Och linjerna för <i>flick</i> är mycket mer ojämna - om du såg dessa samplingar skulle du förmodligen kunna klassificera dem i en av våra tre etiketter - <i>ingenting</i>, <i>swoosh</i> och <i>flick</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-15": "Okej, nu ska vi se om vi kan få datorn att göra det!<br/>Klicka på knappen <i>Träna</i>. Detta kommer att titta på all märkt träningsdata och försöka bygga en modell som kan klassificera ny data allt eftersom den kommer in.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-16": "Du kommer att se ett meddelande om ett belastningsförlustdiagram, och sedan visas ett diagram.<br/>Förlustdiagrammet visar hur bra modellen presterar från steg till steg när den upprepade gånger försöker klassificera träningsdata. Varje iteration av träning kallas en *epok* - det är det som finns på x-axeln i förlustdiagrammet.<br/>En brant nedåtgående gradient i förlustdiagrammet innebär att modellen förändras mycket varje epok och blir bättre på att klassificera data.<br/>Träningen avslutas när förlustnivån inte längre förändras mycket.<br/>En låg förlust innebär att den har kunnat klassificera de flesta träningsdata som vi gav den korrekt - så vi vill att den slutliga förlustmängden ska vara låg.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-17": "Tryck nu på knappen <i>Kör</i> för att försöka köra modellen på nya data.<br/>Flytta sedan runt kugghjulet - försök att göra de två rörelserna du tränade den på och se om den kan känna igen dem.<br/>De tre procentstaplarna representerar modellens konfidensnivå i sin klassificering.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-19": "När du är nöjd trycker du på <i>Träna</i> för att träna modellen igen.<br/>Kör sedan den och se om du är nöjd med prestandan.<br/>Jag hade fortfarande problem med att modellen upptäckte ett <i>swoosh</i> före varje <i>snärt</i>, när det inte fanns något. För att försöka fixa det lade jag till några exempel i <i>ingenting</i>-klassen där jag roterar Cog från horisontellt till vertikalt - den typ av rörelse jag gör före ett snärt, som felaktigt kategoriserades som ett swoosh.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-20": "Din modell kommer att vara vältränad när varje detektering är distinkt och tydlig - som här där den går direkt från *ingenting → swoosh* och tillbaka, och detsamma för *ingenting → snärt* och tillbaka.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-22": "Okej, med din modell sparad är du redo att använda den i ett program!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-24": "Gå till kategorin *ML*",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-25": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-27": "Testa det!<br/>Tryck på den gröna flaggan så börjar modellen springa och klassificera rörelser.<br/>Testa dina <i>swoosh</i>- och <i>flick</i>-rörelser, så borde du se att de upptäcks!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-28": "Lägg till dessa block:<ul><li>När accelerometern tas emot, etikettera [swoosh]</li><li>Ställ in [ring]-lysdioderna på [grön]</li><li>Sänd [swoosh] och vänta</li><li>Vänta [1] sekunder</li><li>Släck alla lysdioder</li></ul><p>Och</p><ul><li>När accelerometern tas emot, etikettera [flick]</li><li>Ställ in [ring]-lysdioderna på [röd]</li><li>Sänd [flick] och vänta</li><li>Vänta [1] sekunder</li><li>Släck alla lysdioder</li></ul><br/>Nu kommer Cog att reagera genom att visa lampor, och vi kommer att sända ut ett meddelande när en swoosh eller en flick detekteras.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-29": "Testa det!<br/>När du gör rörelserna lyser Cog upp",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-30": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-31": "Välj nu <i>Scen</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-32": "Och gå till fliken <i>Kostymer</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-33": "Lägg till lite text som säger \"Lär dig stava\".<br/>Detta blir titelskärmen för spelet.<br/>Du kan också lägga till annan dekoration om du vill - som här där vi har lagt till en lila trapets och en vit kontur runt texten.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-34": "Vi lägger till några fler bakgrunder att använda i spelet.<br/>Tryck på knappen <i>Välj en bakgrund</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-35": "Välj bakgrunden <i>Slott 3</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-36": "Lägg även till <i>Slott 2</i> och <i>Häxhuset</i>, så att du har totalt fyra bakgrunder.<br/>Byt namn på den första till <i>titelskärmen</i>, så att vi lätt kan identifiera den.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-37": "Gå tillbaka till kodfliken, med scenen fortfarande vald.<br/><br/>Lägg till dessa block:<ul><li>När du klickar på den gröna flaggan</li><li>Växla bakgrund till [titelskärm]</li><li>Vänta [2] sekunder</li><li>Växla bakgrund till [Slott 3]</li></ul><br/>När spelet startas kommer spelaren att visas titelskärmen i 2 sekunder innan den växlar till Slott 3 - insidan av slottet",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-38": "Vi kommer att lägga till en kort handledning i spelet och få spelaren att bekräfta att de kan göra swoosh- och flickrörelserna.<br/>Vi kommer att se till att dessa rörelser krävs för att ta sig igenom bakgrunderna.<br/><br/>Lägg till dessa block:<ul><li>När jag får [swoosh]</li><li>Om [[bakgrund [namn]] = [Slott 3]] då<ul><li>Upprepa [50]<ul><li>Ändra [fisheye]-effekten med [10]</li><li>Ändra [virvel]-effekten med [-10]</li></ul></li><li>Byt bakgrund till [Slott 2]</li><li>Upprepa [50]<ul><li>Ändra [fisheye]-effekten med [-10]</li><li>Ändra [virvel]-effekten med [10]</li></ul></li></ul></li></ul><br/>Så nu när spelaren gör en swoosh-rörelse medan Häxan är inne i slottet, den kommer att göra en snygg övergång till bakgrunden i Castle 2",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-39": "Vi behöver en för snärtrörelsen också.<br/><br/>Lägg till dessa block:<ul><li>När jag får [snärt]</li><li>Om [[bakgrund [namn]] = [Slott 2]] då<ul><li>Upprepa [50]<ul><li>Ändra [fisheye]-effekten med [10]</li><li>Ändra [virvel]-effekten med [-10]</li></ul></li><li>Växla bakgrund till [Häxhuset]</li><li>Upprepa [50]<ul><li>Ändra [fisheye]-effekten med [-10]</li><li>Ändra [virvel]-effekten med [10]</li></ul></li><li>Sänd [starta spelet]</li></ul></li></ul><br/>Det kan gå snabbare att högerklicka och duplicera den här koden, var bara noga med att ändra den på rätt ställen och lägg till sändningsblocket!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-41": "Vi behöver lägga till några instruktioner i handledningsstegen.<br/><br/>Lägg till dessa block:<ul><li>När bakgrunden växlar till [Slott 3]</li><li>Vänta [2] sekunder</li><li>Säg [Det är dags att lämna slottet] i [2] sekunder</li><li>Säg [Visar med trollstaven för att transportera oss ut]</li></ul><p>Och</p><ul><li>När bakgrunden växlar till [Slott 2]</li><li>Vänta [2] sekunder</li><li>Säg [Låt oss gå till mitt hus för att öva på trollformler] i [2] sekunder</li><li>Säg [Snärta med trollstaven för att transportera oss dit]</li></ul>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-42": "Okej, nu testar vi!<br/>För att köra ML-modellen måste du välja Cog igen och starta programmet med Cog valt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-43": "Med kugghjulet valt, tryck på den gröna flaggan för att köra koden!<br/>Du måste göra en <i>swoosh</i> och en <i>flick</i> för att hjälpa häxan att magiskt resa från slottet till skogen, och sedan från skogen till sitt hus.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-44": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-45": "Lägg till dessa block:<ul><li>När jag får [starta spelet]</li><li>Ta bort alla [gester]</li><li>Lägg till [swoosh] till [gester]</li><li>Lägg till [flick] till [gester]</li><li>Sätt [lives] till [3]</li><li>Sätt [sequenceLength] till [2]</li></ul><br/>Du måste skapa en lista som heter <i>gester</i> och variabler som heter <i>lives</i> och <i>sequenceLength</i>.<br/>Gestlistan listar alla möjliga rörelser vi kan göra - om du vill utöka spelet med fler rörelser kan du lägga till dem här när du har tränat en modell på dem också.<br/>Vi ger vår spelare 3 liv till att börja med, och de förlorar ett varje gång de gör något fel.<br/>Och vi börjar med en sekvens av 2 rörelser",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-46": "Skapa ett nytt block som heter <i>skapa en sekvens av [längd]-gester</i>.<br/>Du måste använda både alternativen <i>Lägg till ett inmatningsnummer eller en text</i> och <i>Lägg till en etikett</i>.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-47": "Lägg till dessa block:<ul><li>Definiera [skapa en sekvens av [längd]-gester]<ul><li>Ta bort hela [sekvens]</li><li>Upprepa [längd]<ul><li>Lägg till [objekt [välj slumpmässigt [1] till [längden på [gester]]] av [gester]] till [sekvens]</li></ul></li></ul></li></ul><br/>Du måste skapa en annan lista som heter <i>sekvens</i>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-48": "Lägg nu till blocket <i>make a sequence of [sequenceLength] gestes</i>.<br/>Funktionen make a sequence tar in värdet av <i>sequenceLength</i> variabeln som ett argument för dess <i>length</i> parameter.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-49": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-50": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-51": "Lägg till dessa block för att definiera funktionen \"avsluta spelet\":<ul><li>Definiera [avsluta spelet]<ul><li>Säg [Det räcker för nu. Bra jobbat!] i [2] sekunder</li><li>Säg [join [join [Du lärde dig en besvärjelse med] [[sequenceLength] - [1]]] [gester]] i [10] sekunder</li><li>Stoppa [alla]</li></ul></li></ul><br/>När spelaren får slut på liv får de veta sin poäng - hur lång en sekvens av rörelser de kunde memorera och utföra",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-52": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-15.step-53": "Bra jobbat!<br/>Du har lärt dig om maskininlärning och <b>tränat</b> en modell för att <b>klassificera</b> gester från rörelsedata.<br/>Du kunde samla in massor av <b>prover</b> för att träna modellen och testa den innan du sparade den och använde den i din kod.<br/>Sedan använde du funktioner och listor för att skapa ett memory-spel!<br/><br/><b>Nästa steg</b><br/>• Kan du lägga till en tredje gest i spelet?<br/>• Experimentera med att justera maskininlärningsparametrarna - konfidensgränsen och märkningsfrekvensen.<br/>• Skapa ett bättre slut på spelet om spelaren kan komma ihåg riktigt riktigt långa sekvenser av drag.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.description": "Lär dig hur programmerare använder variabler och loopar för att förbättra sin kod!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-1": "I den här handledningen ska vi lära oss hur programmerare använder <b/>variabler</b> för att förbättra sin kod!<br /><br />Variabler är verkligen viktiga i programmering. De hjälper datorer att <b/>komma ihåg och manipulera</b> data så att vi kan utföra mer komplicerade uppgifter med färre kodrader.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-2": "Föreställ dig en variabel som en märkt förvaringslåda. En variabel har tre delar: ett namn, en typ och ett värde.<br /><br /> <b/>Namnet</b> berättar för oss <i/>\"vad kallar vi den här lådan?\"</i> <br /> <b/>Typen</b> berättar för oss <i/>\"vilken typ av sak förvarar vi i den här lådan?\"</i><br /> <b/>Värdet</b> berättar för oss <i/>\"vad exakt förvarar vi för närvarande i lådan?\"</i> <br /><br /> I den här övningen ska vi skapa och använda en variabel som heter <b/>min räknare</b> för att hjälpa Marty att räkna till tio!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-3": "Låt oss först göra vår variabel till <b/>min räknare</b>.<br /><br />Välj \"Skapa en variabel\" och kalla den <b/>min räknare</b>. Klicka på \"ok\" och se hur variabeln visar oss i det övre vänstra hörnet, med ett aktuellt värde på 0.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-5": "Låt oss få Marty att läsa upp vår variabel!<br /><br />Välj blocket ”Marty speak” och ersätt ”hello” med variabeln <b/>my counter</b> som nedan. Klicka på det här blocket så ska du höra din Marty säga ”noll”.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-6": "Om vi ​​vill att Marty ska räkna uppåt från 0 till 10 måste vi +1:a till <b/>min räknare</b> varje gång vi ber Marty säga ett nummer.<br /><br />I variabler kan vi välja blocket <b/>ändra min räknare med 1</b>, vilket kommer att +1:a till <b/>min räknare</b>.<br /><br />Placera detta före \"Marty talar\" som nedan. Klicka på dessa block och hör Marty säga \"ett\"!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-7": "Klicka på kodblocket igen, och Marty säger \"två\". <br/><br/>Klicka på kodblocket tills Marty räknar från 1 till 10!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-8": "Hmm... Tänk om vi vill räkna till tio igen? Vi måste återställa <b/>min räknare</b> till noll! <br /><br />Välj \"ställ in min räknare till 0\" i skriptområdet, klicka på den och <b/>min räknare</b> borde återställas till 0.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-9": "Låt oss prova en extra utmaning – tänk om vi ville få Marty att räkna från 0 till 10 bara genom att klicka på den gröna flaggknappen?<br /><br /> Vi skulle behöva att Marty upprepar vår kod många gånger tills han når tio.<br /><br /> Vi kan styra detta med hjälp av ett <b/>upprepa tills</b>-block – placera vår befintliga kod inuti det så här:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-11": "Nu slutför vi vår <b/>upprepa till</b>-sats.<br /><br /> Vi vill fortsätta loopen tills min räknare är större än tio.<br /><br /> Navigera till variabler och fyll i upprepa-satsen med <b/>min räknare</b> precis så här:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-13": "Bra jobbat! Du är nästan där!<br/><br/>Slutligen, lägg till ett <b/>när grön flagga klickades</b>-block högst upp i vår kod för att avsluta det.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-3.step-14": "Du klarade det! Nu vet du hur man använder variabler, manipulerar dem och gör en <b/> ​​iterativ loop </b> för att hjälpa Marty att räkna till tio!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-1": "I den här handledningen ska vi lära oss hur programmerare använder <b/>parallella program, kapplöpningsvillkor och ömsesidig uteslutning</b> för att styra i vilken ordning kodbitar körs!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-2": "Parallella program är separata kodbitar som vi ber en dator att köra samtidigt.<br/><br/>Precis som med människor finns det vissa saker som datorer, och Martys, inte kan göra samtidigt.<br/><br/>Till exempel, <b/>människor kan inte gå framåt och bakåt samtidigt - och det kan inte Marty heller!</b><br/><br/>Att försöka göra detta skapar det vi kallar ett <b/>kapplöpningsvillkor</b>, där vårt program faktiskt inte kan köra all vår parallella kod samtidigt.<br/><br/>Detta kan orsaka oförutsägbart beteende - dåliga nyheter för programmerare!<br/><br/><br/><i/>Klicka på bilden för att expandera diagrammet.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-3": "Så, hur tar programmerare tillbaka kontrollen när kappvillkor uppstår? <br/><br/> De använder <b/>ömsesidig uteslutning</b> för att säga saker som, <i/>gå inte bakåt förrän jag går framåt först.</i> <br/><br/> Ömsesidig uteslutning kan implementeras med många olika metoder, såsom if-satser, wait-block, variabelkontroll och mycket mer!<br/><br/><br/><i/>Klicka på bilden för att expandera diagrammet.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-4": "För att demonstrera ett kappvillkor ska vi be Marty att gå framåt och bakåt samtidigt.<br/><br/>Först skriver vi vår \"gå framåt\"-kod.<br/><br/> Välj ett <b/>när grön flagga klickades</b>-block och dra det till skriptområdet.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-5": "Placera ett <b/>gå 2 steg framåt</b>-block efter det gröna flaggblocket.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-7": "Slutligen, lägg till ett <b/>gå bakåt</b>-block för att slutföra vår parallella kod.<br/><br/>Kan Marty nu gå framåt och bakåt samtidigt? <b/>Nej!</b> Vi har skapat ett kappvillkor.<br/><br/><i/>Klicka på den gröna flaggan och se vad Marty kommer att göra först...</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-9": "Nu ska vi återskapa vår parallella kod, men först ska vi <b/>gå baklänges</b>.<br/><br/> Återskapa koden som visas i bilden nedan.<br/><br/><i/>Om du behöver hjälp kan du bara gå tillbaka till steg 6 och 7!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-10": "Nu ska vi återskapa vår <b/>walk forwards</b>-kod också. Din parallella kod ska se ut så här: <br/><br/><i/>Om du behöver hjälp kan du bara gå tillbaka till steg 4 och 5!</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-11": "Klicka på den gröna flaggan och se vad Marty gör nu... <b/>han går baklänges först!</b><br/><br/> Detta beror på att Martys programvara hanterar kappvillkor genom att komma åt och köra den <b/>äldsta</b> koden först.<br/><br/>Problemet är att vi inte bara kan se genom att titta på vilken kod som skapades först, och när vi skriver mer komplicerad kod kan det bli förvirrande!<br/><br/>Låt oss utforska hur vi kan använda <b/>väntefunktioner och variabler</b> för att styra vår parallella kod!<br/><br/><br/><i/>Klicka på bilden för att expandera diagrammet.</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-13": "Låt oss säga åt Marty att gå framåt, sedan bakåt. <br/><br/>Det tar Marty ungefär 3 sekunder att gå framåt, så vi placerar ett vänteblock före \"gå bakåt\" och ändrar parametern till 3 sekunder, vilket matchar exempelkoden nedan.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-14": "Klicka på den gröna flaggan och se hur Marty går framåt först, precis som vi ville att han skulle göra! <br/><br/>Så, vi vet att användning av vänteblock kan hjälpa oss med ömsesidig uteslutning, men för längre, mer komplicerad kod är de inte så bra. <br/><br/>Den tid det tar att köra kod kan variera och vara komplex, vilket gör det svårt att exakt förutsäga en väntetid. <br/><br/>Låt oss titta på att använda <b/>variabelkontroll</b> för en mer exakt metod för ömsesidig uteslutning.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-15": "Vi ska använda en variabel som heter \"nästa drag\" för att ömsesidigt utesluta vår kod \"gå bakåt\" och \"gå framåt\". <br/><br/>Även om båda kodblocken körs när vi klickar på den gröna flaggan kan vi säga: <br/><br/>Ta inte ett <i/>faktiskt</i> steg framåt<b/> förrän nästa drag = framåt.</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-16": "Skapa en variabel som heter nästa drag. Vi använder den för att styra vilket drag Marty gör härnäst.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-18": "Istället för att vänta ett antal sekunder innan han går, vill vi att Marty ska <b/>vänta tills</b> nästa drag är inställt på rätt värde: framåt eller bakåt. <br/><br/>Lägg till ett vänta tills-block före varje gångblock, som visas här:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-21": "Om vi ​​vill att Marty ska gå framåt först, ska han gå bakåt härnäst, och vice versa.<br/><br/>Så vi vill använda blocket <b/>next move</b> för att ändra nästa drag efter att vi gått.<br/><br/>Placera två av dessa block i slutet av varje kodstycke och skriv \"forwards\" eller \"backwards\" i varje, för att matcha exempelkoden nedan:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-22": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-4.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.description": "Låt oss använda parallellprogrammering med variabelstyrning för att hjälpa Marty att visa upp alla sina roliga ansikten!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-1": "Nu när vi är experter på variabelstyrning av parallella program, låt oss omsätta våra lärdomar i praktiken genom att hjälpa Marty att visa upp alla sina roliga ansikten!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-2": "Markera två block med grön flagga.<br/><br/>När du klickar på den gröna flaggan aktiveras båda blocken och all kod under dem körs parallellt.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-3": "Nu ska vi lägga till några av Martys uttrycksfulla ljud, ett efter ett, under ett grönt flaggblock.<br/><br/> Vi vill skriva kod som säger: <br/><i/> När den gröna flaggan klickade <br/> Spela upp ljud: Otrohet tills klart <br/> Spela upp ljud: Nej! tills klart <br/> Spela upp ljud: Upphetsad tills klart</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-4": "Nu placerar vi vårt första ljudblock under ett av de gröna flaggblocken.<br/><br/>Använd rullgardinsmenyn för att välja \"Misbelief\" (Otrohet) så att det matchar Martys förvånade ansikte!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-6": "Nu ska vi placera det sista ljudblocket. <br/><br/>Använd rullgardinsmenyn för att välja \"Excited\" (Upphetsad), så att det matchar Martys upphetsade ansikte!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-8": "Nu placerar vi vårt första <b/>ögon</b>-block under det andra gröna flaggblocket som visas. <br/><br/>Använd rullgardinsmenyn för att välja \"Bred\" för att visa Martys förvånade ansikte!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-11": "Låt oss testa vår kod. <br/><br/>Tryck på den gröna flaggan och se om Martys uttryck matchar rätt ljud... <br/><br/>Stämmer de överens? <b/>nej!</b> <br/><br/>Detta beror på att ljuden och uttrycken tar <b/>olika lång tid.</b>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-13": "Navigera till fliken Variabler och skapa en variabel som heter <b/>Marty känner</b> <br/><br/>Vi använder detta för att se till att Marty gör rätt uttryck och ljud samtidigt.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-14": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-17": "För att våra variabler ska synkronisera Martys uttryck och ljud placerar vi ett <b/>wait until</b>-block före varje uttryck <br/><br/>Placera tre <b/>wait until</b>-block som visas nedan:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-18": "Vi vill att Marty ska <b/>vänta tills</b> Marty känner sig = förvånad för att vidga ögonen, till exempel <br/><br/>Välj tre lika med-operatorer och fyll i dem som visas nedan. <br/>Du kan få tre <b/>Marty känner</b>-block från den orange fliken Variabler.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-19": "Slutligen lägger vi till vänteblocken med relevanta lika-block som visas nedan:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-5.step-20": "Du gjorde det - fantastiskt!<br/>Klicka nu på den gröna flaggan och se din kod arbeta parallellt!<br/><br/>Varje uttryck och ljud matchar när vi använder <b/>variabel kontroll för att synkronisera</b> Martys roliga ansikten!. <br/><i/>Marty är förvånad! <br/>Marty är arg! <br/>Marty är upphetsad! </i> <br/><br/>Extra utmaning - hur många roliga ansikten kan du få Marty att rita med variabel kontroll?",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.description": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-1": "I den här handledningen ska vi återskapa unplugged-läget med hjälp av allt vi har lärt oss hittills!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-2": "Innan du börjar den här handledningen, testa lite med unplugged-läget för att komma ihåg hur det fungerar. <br/><br/>Koppla bort din Marty från appen och klicka på \"läge\" på baksidan av din Marty för att växla till unplugged-läget.<br/><br/>Samla en av varje färgplatta för att testa din Martys färgsensor, se hur unplugged fungerar, anslut sedan din Marty igen och kom tillbaka till den här handledningen!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-3": "Nu sätter vi igång!<br/><br/>Vi ska skapa 5 parallella program för att styra varje färg i unplugged-läge:<br/><b/>grönt</b> betyder att gå <b/>framåt</b>, <br/><b/>gult</b> betyder att gå <b/>bakåt</b>, <br/><b/>lila</b> betyder att glida <b/>höger</b>, <br/><b/>blått</b> betyder att glida <b/>vänster</b>, <br/><b/>rött</b> betyder att stanna och fira!</b>,",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-5": "Vi vill inte att Marty ska kontrollera sin färgsensor bara en gång, vi vill att han ska fortsätta kontrollera om och om igen för att göra rätt åtgärd. <br/><br/>Så, låt oss placera en evighetsslinga under varje grönt flaggblock.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-6": "För varje kodblock vill vi säga:<br/><br/><i/><b/>Om</b> Marty känner av färgen grön/blå/röd/lila/gul, <b/>då</b> utför relevant åtgärd.</i><br/><br/>Så låt oss placera en if-sats i varje forever-loop.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-7": "I varje kodblock vill vi kontrollera om till exempel <b/>färgsensor = grön</b> innan vi säger åt Marty att gå framåt. <br/><br/> För att göra detta placerar vi en lika-operator i varje if-sats och fyller i dem med en unplugged-färg vardera. <br/><br/>Din kod ska se ut så här:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-8": "För att slutföra varje if-sats, placera ett färgavkänningsblock i varje lika-operator som visas. <br/><br/>Se till att du använder rullgardinsmenyn för att välja <i/>LeftColorSensor</i>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-9": "Toppen! Nu vill vi att Marty ska <b/>upprepa</b> rätt handling <b/>tills</b> han är på ett annat kort. <br/><br/>För att göra detta använder vi ett <b/>upprepa tills</b>-block.<br/><br/>Placera ett inuti varje if-sats som visas här:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-11": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-13": "Inuti kodblocket som detekterar lila, placera <b/>glid 1 gång åt höger</b> inuti upprepa tills-blocket, som visas här. <br/><br/><br/><i/>Kom ihåg att använda rullgardinsmenyn för att ändra från vänster till höger!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-14": "Inuti kodblocket som detekterar blått, placera <b/>slide 1 gång åt vänster</b> inuti upprepningsblocket, som visas här.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-15": "Inuti kodblocket som detekterar gult, placera <b/>gå bakåt två steg</b> inuti upprepa tills-blocket, som visas här:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-16": "Nästan klart!<br/><br/>Inuti kodblocket som detekterar rött, placera en <b/>pausrörelse</b> och ett <b/>dans</b>-block inuti upprepa tills-blocket, som visas här:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-17": "Men vänta – Marty kan inte dansa utan musik!<br/><br/>Mellan paus- och dansblocken, placera <b/>startljud</b> och använd rullgardinsmenyn för att välja </b>fira</b>!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-18": "Slutligen vill vi att Marty stoppar all kod när han är klar med firandet.<br/><br/>Placera ett <b/>stoppa alla</b>-block efter dansblocket.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-19": "Det finns två saker till vi behöver göra om vi vill återskapa unplugged-läget på rätt sätt. <br/><br/>När Marty känner av en ny färg ändrar han sina ögons lysdioder till den färgen och ger ifrån sig ett \"pip pip!\"-ljud. <br/><br/>Låt oss infoga detta i vår kod!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-20": "Placera ett <b/>set Select LED eyes to</b>-block <b/>inuti if-satsen, men ovanför repeat until-blocket</b> i varje kodstycke. <br/><br/>Ändra LED-färgen till relevant färg för det blocket och se till att använda rullgardinsmenyn för att välja <b/>båda ögonen</b>. <br/><br/>Din kod ska se ut så här:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-21": "Vi hittar Martys \"pip pip!\"-ljud i ljudbiblioteket, kallat <b/>Arcade Beep</b>.<br/><br/>Kopiera klippet nedan för att hitta <b/>Arcade Beep</b>-funktionen i ljud.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-22": "Placera ett <b/>Startljud: Arcade Beep</b>-block efter varje LED-ögonblock och före varje upprepningsblock. <br/><br/>Din kod ska se ut så här:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-6.step-23": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.description": "Låt oss lära oss hur programmerare använder listor för att göra så många coola saker!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-1": "I den här handledningen ska vi lära oss allt om listor!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-2": "Så, när det gäller programmering, <b/>vad är en lista?</b> <br/><br/>Programmerare använder listor, ibland kallade arrayer, för att lagra data i en specifik ordning. <br/><br/>Programmerare kan styra hur data läggs till, tas bort och lagras i listan, samt diskutera data efter dess nummer i listan (kallas ett index).",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-4": "I den här handledningen använder vi en lista för att hjälpa Marty att memorera en rad med färgade plattor som han går på.<br/><br/>Innan vi börjar koda behöver du fyra plattor i unplugged-läge utlagda i en rad så här:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-5": "Navigera till fliken Variabler och klicka på \"Skapa en lista\". <br/><br/>Kalla listan \"färger\" och klicka på \"ok\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-6": "Varje gång Marty går vidare till en ny ruta lägger vi till färgen från hans färgsensor i vår \"färger\"-lista.<br/><br/>Välj blocket <b/>lägg till sak i färger</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-8": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-10": "Eftersom vi vill upprepa den här koden för var och en av våra fyra färgplattor, låt oss lägga till en <b/>upprepningsloop</b> runt koden. <br/><br/>Ändra <b/>10</b> till <b/>4</b> för att upprepa koden fyra gånger.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-11": "Nu ska vi få Marty att använda sina LED-ögon för att tala om för oss vilka färger han har sett. <br/><br/>Välj 4 <b/>Ställ in valda LED-ögon på</b> block och placera dem efter repetitionsslingan. <br/><br/>Använd rullgardinsmenyn för att välja <b/>båda ögonen</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-12": "Bra jobbat! Nu ska vi ändra Martys lysdioder till alla färger i vår lista. <br/><br/>Gå till fliken Variabler och välj blocket <b/>punkt 1 av färger</b>. <br/><br/>Ersätt den färgade cirkeln med <b/>punkt 1 av färger</b> och ändra numret till 1, 2, 3 och 4 som visas här:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-7.step-14": "Du klarade det! <br/><br/>Placera nu din Marty i början av din rad med brickor, som visas här, och se hur Marty kommer ihåg varje färg!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.description": "Låt oss lära oss hur programmerare använder listor för att göra så många coola saker!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-1": "I den här handledningen ska vi använda en <b/>lista</b> för att skriva Martys inköpslista.<br/><br/>Sedan ska vi skriva lite kod i en <b/>iterativ loop</b> för att få Marty att läsa sin inköpslista högt!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-3": "Det första Marty behöver köpa är batterier. <br/><br/>Markera rutan <b/>lägg till sak i Martys inköpslista</b>. <br/><br/>Skriv <b/>batterier</b> istället för <b/>sak</b>. Klicka på rutan och se batterier visas i listan.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-4": "Nästa sak Marty behöver är sladdar!<br/><br/>Behåll samma block som tidigare, byt <b/>batterier</b> mot <b/>sladdar</b> och klicka på blocket.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-6": "Marty säger att det viktigaste han behöver köpa är godis!<br/><br/>Välj rutan <b/>infoga sak vid nummer 1 på Martys inköpslista</b>.<br/><br/>Istället för <b/>sak</b>, skriv <b/>godis</b>, klicka på rutan och se godiset dyka upp vid nummer 1 på listan!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-7": "Det coola med listor är att de gör det superenkelt att skriva kod! <br/><br/>Båda dessa kodblock läser upp Martys shopping. <br/><br/>Men om vi inte använder en lista, som till vänster, skulle vi behöva ändra den här koden varje gång Martys shopping ändras. <br/><br/>Om vi ​​använder en lista, som till höger, kan vi skriva kod som fungerar hela tiden - oavsett hur lång listan är, eller vad som läggs till/tas bort!",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-8": "Vi ska skriva den här koden som vi kan använda för vilken lista som helst! <br/><br/>Oavsett hur vi ändrar listan kan Marty fortfarande läsa listan högt med den här koden! <br/><br/>Denna upprepningsloop är speciell - programmerare kallar dem <b/>iterativa loopar</b> <br/><br/>Iteration innebär att upprepa samma uppgift och ändra något varje gång tills ett villkor är uppfyllt. <br/><br/>Här kan du se den <b/>upprepade uppgiften</b>, <b/>villkoret</b> och den <b/>upprepade ändringen</b>.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-10": "Låt oss göra variabeln till <b/>artikelnummer</b> som vi ska använda för att loopa igenom Martys inköpslista. <br/><br/>Gå till variabelfliken, välj Skapa en variabel, kalla den <b/>artikelnummer</b> och klicka på \"ok\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-11": "Låt oss ställa in den upprepade uppgiften i vår iterativa loop: Marty läser upp objekt från sin lista. <br/><br/>Gå till fliken Tala, välj ett <b/>Marty talar</b>-block och placera det i repetitionsloopen.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-12": "Vi vill inte att Marty ska säga hej, vi vill att han ska läsa upp ett objekt från listan. <br/><br/>Gå till fliken Variabler och välj <b/>objekt 1 i Martys inköpslista</b> och placera det som visas. <br/><br/>Ersätt siffran 1 med variabeln <b/>objektnummer</b>. <br/><br/>Bra jobbat! Om objektnummer = 3 skulle Marty säga \"kablar\".",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-13": "Nu ska vi lägga till den upprepade ändringen i vår loop.<br/><br/>I varje loop vill vi lägga till ett till variabeln <b/>artikelnummer</b>.<br/><br/>Placera <b/>ändringsartikelnummer 1</b>-blocket efter läsblocket som visas:",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-14": "Slutligen ska vi ställa in villkoret för vår iterativa loop - <i/>upprepa tills: artikelnummer är större än Martys inköpslista</i> <br/><br/>Placera en större än-operator inuti upprepa tills-satsen som visas.",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-15": "Navigera till fliken Variabler och fyll i större än-blocket som visas, så att det står: <br/><br/><i/>upprepa tills: artikelnumret är större än Martys inköpslista</i>",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-16": "Loading...",
  "gui.howtos.lessons.type-lesson-marty-blocks-coding-8.step-17": "Grymt, klicka nu på din kod och lyssna på Marty som berättar sin inköpslista! <br/><br/>Du har lärt dig allt om listor, att lägga till och ta bort element, använda deras artikelnummer i kod och till och med hur man itererar igenom dem!",
  "gui.menuBar.sensorsDashboard": "Sensorer Instrumentpanel",
  "gui.menuBar.showCode": "Visa kod",
  "gui.gui.toggleMartyMachineTab": "Maskininlärning",
  "gui.gui.toggleSaveLoadTab": "Spara/Läs in",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1": "I den här handledningen lär vi oss hur <b>Cog</b> och <b>Marty</b> kan interagera med varandra. Tryck på \"Nästa\" för att börja!",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1": "Först ansluter vi till Cog. Klicka på knappen \"Anslut en enhet\" och välj sedan Cog.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.1.1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2": "Nu ska vi ansluta till Marty. Klicka på knappen \"Anslut en enhet\" och välj sedan Marty.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-1.2.1": "Toppen! Klicka nu på knappen \"anslut\" för att ansluta till Marty.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-2": "Nu när vi är anslutna till robotarna, låt oss börja koda! För att se Cogs block, klicka på Cog-enhetsknappen.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3": "När du har valt Cog-blocken, dra händelseblocket \"vid knapptryckning\" till skriptområdet. Detta block kommer att lyssna efter när Cog-knappen klickas.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-3.hint": "Händelseblocket 'vid klick' finns under kategorin Händelse. Dra det till skriptområdet för att börja koda.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-5.hint": "Blocket \"sänd meddelande\" finns under kategorin Händelser. Dra det till skriptområdet för att börja koda.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-6": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7": "När du är i Marty-läge, dra blocket \"När jag får meddelande\" från kategorin Händelseblock till skriptområdet. Det här blocket lyssnar efter utsända meddelanden.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-7.hint": "Blocket \"vid meddelande\" finns under kategorin Händelse. Dra det till skriptområdet för att börja koda.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-9": "Vi är nästan framme! Dra blocket \"Dansa!\" till skriptområdet. Det här blocket får Marty att dansa när meddelandet tas emot.",
  "gui.howtos.lessons.type-lesson-cog-and-marty-tutorial.step-10": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.name": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.description": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-1": "Nu lär vi oss programmera Cog med block! <br /><br />Vi ansluter till Cog och får det att lysa upp och ge ifrån sig ljud när knappen trycks in!<br /><br />Vi lär oss också om <b>seriekod</b> som körs som en sekvens och <b>parallellkod</b> som körs samtidigt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-2": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-3": "Toppen! Klicka nu på knappen \"anslut\" för att ansluta till Cog<br /><br>Återigen, du kan hoppa över detta om du redan är ansluten till en Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-4": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-5": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6": "Lägg till ett <b>Vid knapptryckning</b>-block",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-6.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-7": "Välj kategorin Utseende",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8": "Lägg till ett block <b>Ange [ring]-lysdioder till [färg]</b> genom att dra det för att ansluta till blocket På-knapptryckning",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-8.hint": "Blocket \"ställ in [ring]-lysdioder till [färg]\" finns under kategorin Utseende. Dra det till skriptområdet och anslut det till blocket På-knapptryckning",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-9": "Testa det! <br /><br />Tryck på knappen på Cog så borde lamporna tändas!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-10": "Ändra färgen på lysdioderna genom att klicka eller trycka på färgklumpen och sedan dra i färgfältet. <br /><br />Du kan också ändra mättnad (hur livfull en färg är) och ljusstyrka – om du ställer in det på 0 kommer lysdioderna att vara släckta.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-11": "Testa det! <br /><br />Tryck på knappen på Cog så ska lamporna ändras till den nya färgen du valt!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12": "Lägg till ett <b>On Shake</b>-block",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-12.hint": "Händelseblocket \"vid skakning\" finns under kategorin Händelse. Dra det till skriptområdet bort från koden som redan finns där.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-13.hint": "Blocket \"Stäng av lysdioder\" finns under kategorin Utseende. Dra det till skriptområdet och anslut det till blocket Vid skakning",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-14": "Testa det! <br /><br />Skaka Cog så borde lamporna slockna!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-15": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-16": "Testa det! <br /><br />Tryck på knappen på Cog så borde lampan i knappen tändas!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-18": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-19.hint": "Blocket 'Ställ in [ring]-lysdioder på mönster [Blinkar]' finns under kategorin Utseende. Dra det till skriptområdet och anslut det till blocket som ställer in lysdiodernas färger.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-20": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-21": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-22": "Testa de andra mönstren i listan",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23": "Lägg till ytterligare ett <b>Set [ring] LEDs to pattern [Flash]</b> block under det föregående, och ändra det så att knappen blinkar.<br /><br />Testa det genom att trycka på knappen på Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-23.hint": "Blocket 'Ställ in [ring]-lysdioder på mönster [Blinkar]' finns under kategorin Utseende. Dra det till skriptområdet och anslut det till blocket som ställer in lysdiodernas färger.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25": "Lägg till ett <b>Ställ in lysdioder med hjälp av ColorPicker</b>-block som är kopplat till blocket På-knapptryckning",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-25.hint": "Blocket \"Ställ in lysdioder med hjälp av färgväljaren\" finns under kategorin Utseende. Dra det till skriptområdet och anslut det till händelsen Vid knapptryckning",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27": "Ställ även in knappens färg genom att lägga till ett <b>Ställ in [ring]-LED:er på [färg]</b>-block och ändra det för att ställa in knappen på din favoritfärg.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-27.hint": "Blocket 'Ställ in [ring]-lysdioder till [färg]' finns under kategorin Utseende. Dra det till skriptområdet och anslut det till Ställ in lysdioder med hjälp av ColorPicker-blocket.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-28": "Testa det! Tryck på knappen så ändras alla lampor till de färger du valt.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-29": "Välj kontrollkategorin",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30": "Lägg till ett <b>vänta [1] sekunder</b>-block under LED-blocken",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-30.hint": "Blocket 'vänta [1] sekunder' finns under kategorin Kontroll. Dra det till skriptområdet och anslut det under de två blocken som ställer in LED-färgerna.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-31.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32": "Ändra även knappens färg genom att lägga till ett <b>Ställ in [ring]-LED:er på [färg]</b>-block och ändra det för att ställa in knappen på din favoritfärg.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-32.hint": "Blocket \"Ställ in [ring]-lysdioder till [färg]\" finns under kategorin Utseende. Dra det till skriptområdet och anslut det till det sista blocket Ställ in lysdioder med hjälp av ColorPicker, välj sedan \"knapp\" från rullgardinsmenyn.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-33": "Testa det! Tryck på knappen så tänds lamporna och ändras sedan efter 1 sekund!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34": "Lägg till ytterligare ett block <b>Vid knapptryckning</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-34.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-35": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36": "Lägg till ett block <b>Spela not [C4] i [1] sekunder</b> under blocket Vid knapptryckning som du just lade till",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-36.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-37": "Ändra tonen till C5 och prova det genom att trycka på knappen på Cog!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-38.hint": "Blocket 'Spela ton från [200] till [300]Hz i [3] sekunder' finns under kategorin Ljud. Dra det till skriptområdet och koppla det mellan blocket Vid knapptryckning och den spelnot du lade till i det senaste steget.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-39": "Ändra siffrorna i blocket Spela upp ton för att gå från 260 till 523 Hz i 1 sekund.<br /><br />Varje musiknot har en frekvens, och 523 Hz är frekvensen för C5 - C i den femte oktaven.<br /><br />Prova det genom att trycka på knappen på Cog",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-40": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-41": "De individuella ljuden och ljusen inträffar efter varandra - vi säger att de körs i *serie* eller i en sekvens",
  "gui.howtos.lessons.type-lesson-cog-tutorial-1.step-42": "Bra jobbat! Du har lärt dig hur man programmerar Cog, hur man får den att reagera på knapptryckningar och skakningar, och hur man gör ljud och ljus!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.name": "Gör en 13-sidig tärning!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.description": "Vi förvandlar Cog till en tärning, som visar ett annat antal ljus varje gång du skakar på den!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-1": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-2": "Se först till att du är ansluten till ett kugghjul.<br /><br />Om inte, lägg till ett som du gjorde i den senaste handledningen genom att trycka på knappen Lägg till i enhetspanelen och välja ett kugghjul och sedan klicka på Anslut. Om du behöver, hoppa tillbaka till den senaste handledningen för att se hur",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-3": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-4": "Välj kategorin <b>Variabler</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-5": "Klicka på knappen <b>Skapa en variabel</b><br /><br />Ange det nya variabelnamnet till <b>ledID</b> och tryck på OK",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-6": "Välj kategorin <b>Kontroll</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-7.hint": "Blocket \"upprepa\" finns under kategorin Kontroll. Dra det till skriptområdet och anslut det till blocket Vid skakning.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8": "Gå till kategorin <b>Utseenden</b> och lägg till ett <b>Ställ in LED [1] på [färg]</b>-block inuti det upprepade blocket.<br /><br />Ändra färgen till din favoritfärg :-)",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-8.hint": "Blocket 'ställ in LED [1] till [färg]' finns i kategorin Utseende. Dra det till skriptområdet och placera det så att det snäpper fast inuti upprepningsblocket.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-9": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10": "Gå tillbaka till kategorin <b>Variabler</b> och lägg till ett <b>Ändra [ledID] med [1]</b>-block precis efter LED-blocket.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-10.hint": "Blocket 'Ändra [ledID] med [1]' finns i kategorin Variabler. Dra det till skriptområdet och placera det så att det snäpper fast inuti upprepningsblocket, precis efter blocket Ange LED.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-11": "Dra variabeln <b>ledID</b> till blocket <b>Set LED</b> så att det står <b>Set LED <i>ledID</i> to [color]</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-12": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-13": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14": "Lägg till ett <b>Set [ledID] to [0]</b>-block direkt efter <b>On Shake</b>-blocket, före repetitionsblocket",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-14.hint": "Blocket 'Set [ledID] to [0]' finns i kategorin Variabler. Dra det till skriptområdet och placera det så att det fäster precis efter blocket 'On Shake', före upprepningsblocket.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15": "Lägg även till ett block <b>Stäng av alla lysdioder</b> från kategorin <b>Utseenden</b>.<br /><br />Lägg till det precis före upprepningsblocket, efter blocket <i>ställ in [ledID] till [0]</i> som du just lade till.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-15.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-16": "Försök igen nu! <br /><br />När du nu skakar kugghjulet återställs både lamporna och värdet på <b>variabeln</b> <i>ledID</i>, så att den räknar uppåt från 1 till 10.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-17": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-18": "Dra blocket <b>välj slumpmässigt [1] till [10]</b> för att ersätta numret i repetitionsblocket.<br /><br />Nu kommer repetitionsblocket att loopa ett slumpmässigt antal gånger från 1 till 10, och ändras varje gång!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-19": "Cog har 13 programmerbara lysdioder - 12 i ringen och en i knappen.<br /><br />Ändra blocket <b>välj slumpmässigt</b> för att välja ett nummer mellan 1 och <b>13</b> istället.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-20": "Testa det! <br /><br />Nu får du ett annat antal ljus varje gång du skakar på Cog.<br /><Br />Du har programmerat Cog till att vara en tärning!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-21": "<i>ledID</i> är en <b>variabel</b> - den har ett värde som kan ändras eller <i>varieras</i><br /><br />I den här koden räknas det upp för att tända en annan LED varje gång genom loopen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22": "Låt oss lägga till lite ljudåterkoppling också.<br /><Br />Gå till kategorin <b>Ljud</b> och lägg till ett block <b>Spela not [C4] i [1] sekunder</b><br /><br />Ändra det till att spela noten i <b>0,1 sekunder</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-22.hint": "Blocket 'Spela ton [C4] i [1] sekunder' finns i kategorin Ljud.<br /><Br />Se till att du lägger till det i Repeat-loopen!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23": "Lägg även till en kort paus genom att lägga till ett <b>Vänta [1] sekunder</b>-block från <b>Kontroll</b>-kategorin.<br /><br />Ändra även pausens längd till <b>0,1 sekunder</b>.<br /><br />Om vi ​​inte lägger till en paus kommer vi inte att kunna se hur många pip det finns, eftersom de alla kommer att slås samman till ett långt pip!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-23.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-24": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25": "Låt oss få något speciellt att hända <b>om</b> du slår högsta poängen - 13<br /><br />Gå till <b>Kontroll</b>-kategorin och lägg till ett <b>Om __ då</b>-block",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-25.hint": "Blocket 'if __ then' finns i kontrollkategorin. Lägg till det i koden genom att dra det så att det ansluter efter upprepningsslingan.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-26": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27": "Dra <b>=</b>-blocket <b>in i <i>if</i>-blocket</b><br /><br />Det är här vi ställer in <b>villkoret</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-27.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-28": "Gå tillbaka till kategorin <b>Variabler</b> och dra <b>ledID-variabeln</b> till den <b>första rutan i lika-blocket</b><br /><br />Sätt sedan <b>den andra rutan till 13</b>, så att hela raden visar <b>om ledID = 13 då</b>",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-29": "Koden i detta <b>if</b>-block kommer bara att köras <b>om</b> <b>variabeln</b> ledID är <b>lika med</b> 13<br /><br />Detta kontrolleras efter att <b>repeat</b>-blocket har upprepats klart, medan koden fortsätter ner i sekvensen<br /><br />Om <b>variabeln</b> ledID är något annat än 13 kommer hela <b>if</b>-blocket och all kod i det att hoppas över<br /><br /><b>if</b>-blocket är en typ av <b>villkorligt</b> - koden i det kommer bara att köras om <b>villkoret</b> du anger är sant.",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30": "Låt oss lägga till något i <b>if</b>-blocket!<br /><br />Gå till kategorin <b>sounds</b> och lägg till ett <b>Play tune</b>-block",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-30.hint": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-31": "Loading...",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32": "Lägg även till några ljuseffekter från utseendemenyn<br /><br />Till exempel kan vi få ring- och knapp-LED-lamporna att visa ett mönster",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-32.hint": "Blocket 'Ställ in [ring]-LED på mönster [Blinkar]' finns i kategorin Utseenden. Lägg till två av dem i if-villkoret och ändra en för att ställa in knappmönstret",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-33": "Testa det!<br /><br />Se om du kan slå en 13:a på tärningen genom att skaka på kugghjulet!",
  "gui.howtos.lessons.type-lesson-cog-tutorial-2.step-42": "Loading...",
  "gui.spriteSelector.sprites": "Loading...",
  "gui.deviceSelector.devices": "Loading...",
  "gui.spriteSelector.addSpriteFromLibrary": "Välj en sprite",
  "gui.spriteSelector.addSpriteFromPaint": "Måla",
  "gui.spriteSelector.addSpriteFromSurprise": "Överraskning",
  "gui.spriteSelector.addSpriteFromFile": "Loading...",
  "gui.deviceSelector.addDeviceByConnecting": "Anslut till en enhet",
  "gui.deviceSelector.addDeviceFromLibrary": "Välj en enhet",
  "gui.spriteSelector.noSpritesInUse": "Inga sprites används",
  "gui.deviceSelector.noDevicesInUse": "Lägg till en enhet",
  "gui.saveLoad.localStorageTitle": "Loading...",
  "gui.saveLoad.localStorageSubtitle": "Lokal lagring",
  "gui.saveLoad.cloudStorageTitle": "Loading...",
  "gui.saveLoad.cloudStorageSubtitle": "Molnlagring",
  "gui.saveLoad.portableFileStorageTitle": "Bärbar",
  "gui.saveLoad.portableFileStorageSubtitle": "Fillagring",
  "gui.saveLoad.createNewSaveFile": "Loading...",
  "gui.saveLoad.savedFilesTitle": "Dina sparade filer:",
  "gui.saveLoad.deleteFile": "Radera",
  "gui.saveLoad.loadFile": "Ladda",
  "gui.saveLoad.saveFile": "Spara",
  "gui.saveLoad.saveFileNamePlaceholder": "Skriv in vad du vill namnge din nya sparade fil här...",
  "gui.saveLoad.fileLoadError": "Loading...",
  "gui.saveLoad.fileSaveError": "Loading...",
  "gui.saveLoad.overwriteFile": "Är du säker på att du vill skriva över den här filen?",
  "gui.saveLoad.copyToClipboard": "Loading...",
  "gui.saveLoad.copied": "Kopierad!",
  "gui.saveLoad.saveProject": "Spara projekt",
  "gui.saveLoad.projectSaved": "Loading...",
  "gui.saveLoad.projectSaveFailed": "Loading...",
  "gui.saveLoad.projectLoaded": "Loading...",
  "gui.saveLoad.projectLoadFailed": "Misslyckades med att ladda projektet",
  "gui.saveLoad.loadProjectPlaceholder": "Skriv namnet på den molnbaserade filen du vill ladda här...",
  "gui.saveLoad.createNewCloudSave": "Skapa en ny molnsparfil:",
  "gui.saveLoad.saveFileCode": "Loading...",
  "gui.saveLoad.saveFilePlaceholder": "Loading...",
  "gui.saveLoad.loadProjectTitle": "Ladda projekt",
  "gui.saveLoad.tipsTitle": "Tips för att spara i molnet:",
  "gui.saveLoad.tips1": "Se till att skriva ner eller anteckna den automatiskt genererade koden som tillhandahålls varje gång du sparar en ny fil. Du kommer att behöva detta för att ladda den i framtiden.",
  "gui.saveLoad.tips2": "Loading...",
  "gui.saveLoad.tips3": "Varje gång du sparar en fil på nytt till molnlagring får du en NY KOD FÖR ATT SPARA FIL. Vänligen notera detta.",
  "gui.saveLoad.saveToFile": "Spara till fil",
  "gui.saveLoad.loadFromFile": "Läs in från fil",
  "gui.saveLoad.fileSaved": "Filen sparad!",
  "gui.martyMachineModelEditor.model": "Modellnamn",
  "gui.martyMachineModelEditor.className": "Samla in data för",
  "gui.martyMachineModelEditor.createNewClass": "Skapa klass",
  "gui.martyMachineModelEditor.samples": "Loading...",
  "gui.MartyMachineModelEditor.record": "Registrera data",
  "gui.MartyMachineModelEditor.stop": "Stopp",
  "gui.MartyMachineModelEditor.train": "Loading...",
  "gui.MartyMachineModelEditor.run": "Loading...",
  "gui.MartyMachineModelEditor.save": "Spara",
  "gui.MartyMachineModelEditor.saving": "Sparande...",
  "gui.martyMachineTab.addNew": "Loading...",
  "gui.martyMachineTab.newImageModelMarty": "Ny bildmodell (Marty)",
  "gui.martyMachineTab.newImageModelDevice": "Loading...",
  "gui.martyMachineTab.newAccelerometerModel": "Loading...",
  "gui.martyMachineTab.newAudioModel": "Ny ljudmodell",
  "gui.martyMachineTab.loadTMModel": "Loading...",
  "gui.martyMachineTab.tutorials": "Loading...",
  "gui.martyMachineTab.alertSelectDevice": "Oj! Välj en Marty- eller Cog-enhet för att använda accelerometermodellen.",
  "gui.martyMachineTab.alertConnectDevice": "Loading...",
  "gui.martyMachineTab.alertModelNameExists": "Modellnamnet finns redan, vänligen välj ett annat namn.",
  "martyMachine.modelNameExists": "Hoppsan! Modellnamnet finns redan, vänligen välj ett annat namn.",
  "martyMachine.backgroundNoiseClassNeedsSamples": "Oj! Bakgrundsbrusklassen behöver minst 10 samplingar för att tränas. Lägg till fler samplingar i bakgrundsbrusklassen.",
  "martyMachine.classNameExists": "Hoppsan! Klassnamnet finns redan, vänligen välj ett annat namn.",
  "martyMachine.selectClassAlert": "Lägg till eller välj en befintlig klass innan du spelar in samplingar.",
  "gui.MartyMachineNewModelConfirmationModal.label": "Osparade ändringar kommer att gå förlorade.",
  "gui.MartyMachineNewModelConfirmationModal.headsUp": "Bara ett varningsmeddelande! Om du har gjort några ändringar i den nuvarande modellen kommer de inte att sparas. Kan du fortsätta?",
  "gui.MartyMachineNewModelConfirmationModal.close": "Nära",
  "gui.MartyMachineNewModelConfirmationModal.continue": "Loading...",
  "gui.TfVisChart.loadingTitle": "Loading...",
  "gui.TfVisChart.loadingSubtitle": "Loading...",
  "gui.MartyMachineModelEditor.requiresAtLeast10Samples": "Kräver minst 10 prover",
  "gui.MartyMachineModelEditor.createNewClass": "Skapa ny klass",
  "gui.howtos.marty-machine-create-model.name": "Skapa AI-modell",
  "gui.howtos.marty-machine-create-model.step_create-model": "Skapa ny modell",
  "gui.howtos.marty-machine-create-audio-model.step_visit-user-guide": "Besök vår användarhandbok för mer information",
  "gui.howtos.marty-machine-create-image-model.name": "Skapa bildmodell",
  "gui.howtos.marty-machine-create-image-model.step_create-image-model": "Skapa ny bildmodell",
  "gui.howtos.marty-machine-create-image-model.step_change-model-name": "Loading...",
  "gui.howtos.marty-machine-create-image-model.step_collect-data": "Samla in data",
  "gui.howtos.marty-machine-create-image-model.step_train-model": "Tågmodell",
  "gui.howtos.marty-machine-create-image-model.step_run-model": "Loading...",
  "gui.howtos.marty-machine-create-image-model.step_save-model": "Loading...",
  "gui.howtos.marty-machine-create-audio-model.name": "Skapa ljudmodell",
  "gui.howtos.marty-machine-create-audio-model.step_create-audio-model": "Loading...",
  "gui.howtos.marty-machine-create-audio-model.step_change-model-name": "Loading...",
  "gui.howtos.marty-machine-create-audio-model.step_collect-data": "Samla in data",
  "gui.howtos.marty-machine-create-audio-model.step_train-model": "Tågmodell",
  "gui.howtos.marty-machine-create-audio-model.step_run-model": "Loading...",
  "gui.howtos.marty-machine-create-audio-model.step_save-model": "Loading...",
  "gui.howtos.marty-machine-load-tm-model.name": "Ladda inlärningsbar maskinmodell",
  "gui.howtos.marty-machine-load-tm-model.step_load-tm-model": "Ladda inlärningsbar maskinmodell",
  "gui.howtos.marty-machine-load-and-run-image-model.name": "Loading...",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-and-run-image-model": "Ta fram AI-blocken",
  "gui.howtos.marty-machine-load-and-run-image-model.step_load-model": "Laddningsmodell",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classification-on": "Aktivera klassificering",
  "gui.howtos.marty-machine-load-and-run-image-model.step_classify-image": "Loading...",
  "gui.howtos.marty-machine-load-and-run-audio-model.name": "Ladda och kör ljudmodell",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-and-run-audio-model": "Ta fram AI-blocken",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_load-model": "Laddningsmodell",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classification-on": "Aktivera klassificering",
  "gui.howtos.marty-machine-load-and-run-audio-model.step_classify-audio": "Klassificera ljud"
}